const cityData = [{
    "id": "1",
    "name": "北京市",
    "code": "110000",
    "city": [{
        "id": "1",
        "name": "北京市",
        "code": "110100",
        "area": [{"id": "108", "name": "东城区", "code": "110101"}, {
            "id": "109",
            "name": "西城区",
            "code": "110102"
        }, {"id": "110", "name": "朝阳区", "code": "110105"}, {"id": "111", "name": "丰台区", "code": "110106"}, {
            "id": "112",
            "name": "石景山区",
            "code": "110107"
        }, {"id": "113", "name": "海淀区", "code": "110108"}, {
            "id": "114",
            "name": "门头沟区",
            "code": "110109"
        }, {"id": "115", "name": "房山区", "code": "110111"}, {"id": "116", "name": "通州区", "code": "110112"}, {
            "id": "117",
            "name": "顺义区",
            "code": "110113"
        }, {"id": "118", "name": "昌平区", "code": "110114"}, {"id": "119", "name": "大兴区", "code": "110115"}, {
            "id": "120",
            "name": "怀柔区",
            "code": "110116"
        }, {"id": "121", "name": "平谷区", "code": "110117"}, {"id": "122", "name": "密云县", "code": "110228"}, {
            "id": "123",
            "name": "延庆县",
            "code": "110229"
        }]
    }]
}, {
    "id": "2",
    "name": "天津市",
    "code": "120000",
    "city": [{
        "id": "311",
        "name": "天津市",
        "code": "120100",
        "area": [{"id": "2465", "name": "和平区", "code": "120101"}, {
            "id": "2466",
            "name": "河东区",
            "code": "120102"
        }, {"id": "2467", "name": "河西区", "code": "120103"}, {
            "id": "2468",
            "name": "南开区",
            "code": "120104"
        }, {"id": "2469", "name": "河北区", "code": "120105"}, {
            "id": "2470",
            "name": "红桥区",
            "code": "120106"
        }, {"id": "2471", "name": "东丽区", "code": "120110"}, {
            "id": "2472",
            "name": "西青区",
            "code": "120111"
        }, {"id": "2473", "name": "津南区", "code": "120112"}, {
            "id": "2474",
            "name": "北辰区",
            "code": "120113"
        }, {"id": "2475", "name": "武清区", "code": "120114"}, {
            "id": "2476",
            "name": "宝坻区",
            "code": "120115"
        }, {"id": "2477", "name": "滨海新区", "code": "120116"}, {
            "id": "2478",
            "name": "宁河县",
            "code": "120221"
        }, {"id": "2479", "name": "静海县", "code": "120223"}, {"id": "2480", "name": "蓟县", "code": "120225"}]
    }]
}, {
    "id": "3", "name": "河北省", "code": "130000", "city": [{
        "id": "106",
        "name": "石家庄市",
        "code": "130100",
        "area": [{"id": "681", "name": "长安区", "code": "130102"}, {
            "id": "682",
            "name": "桥东区",
            "code": "130103"
        }, {"id": "683", "name": "桥西区", "code": "130104"}, {"id": "684", "name": "新华区", "code": "130105"}, {
            "id": "685",
            "name": "井陉矿区",
            "code": "130107"
        }, {"id": "686", "name": "裕华区", "code": "130108"}, {"id": "687", "name": "井陉县", "code": "130121"}, {
            "id": "688",
            "name": "正定县",
            "code": "130123"
        }, {"id": "689", "name": "栾城县", "code": "130124"}, {"id": "690", "name": "行唐县", "code": "130125"}, {
            "id": "691",
            "name": "灵寿县",
            "code": "130126"
        }, {"id": "692", "name": "高邑县", "code": "130127"}, {"id": "693", "name": "深泽县", "code": "130128"}, {
            "id": "694",
            "name": "赞皇县",
            "code": "130129"
        }, {"id": "695", "name": "无极县", "code": "130130"}, {"id": "696", "name": "平山县", "code": "130131"}, {
            "id": "697",
            "name": "元氏县",
            "code": "130132"
        }, {"id": "698", "name": "赵县县", "code": "130133"}, {"id": "699", "name": "辛集市", "code": "130181"}, {
            "id": "700",
            "name": "藁城市",
            "code": "130182"
        }, {"id": "701", "name": "晋州市", "code": "130183"}, {"id": "702", "name": "新乐市", "code": "130184"}, {
            "id": "703",
            "name": "鹿泉市",
            "code": "130185"
        }]
    }, {
        "id": "107",
        "name": "唐山市",
        "code": "130200",
        "area": [{"id": "704", "name": "路南区", "code": "130202"}, {
            "id": "705",
            "name": "路北区",
            "code": "130203"
        }, {"id": "706", "name": "古冶区", "code": "130204"}, {"id": "707", "name": "开平区", "code": "130205"}, {
            "id": "708",
            "name": "丰南区",
            "code": "130207"
        }, {"id": "709", "name": "丰润区", "code": "130208"}, {"id": "710", "name": "滦县", "code": "130223"}, {
            "id": "711",
            "name": "滦南县",
            "code": "130224"
        }, {"id": "712", "name": "乐亭县", "code": "130225"}, {"id": "713", "name": "迁西县", "code": "130227"}, {
            "id": "714",
            "name": "玉田县",
            "code": "130229"
        }, {"id": "715", "name": "曹妃甸区", "code": "130230"}, {
            "id": "716",
            "name": "遵化市",
            "code": "130281"
        }, {"id": "717", "name": "迁安市", "code": "130283"}]
    }, {
        "id": "108",
        "name": "秦皇岛市",
        "code": "130300",
        "area": [{"id": "718", "name": "海港区", "code": "130302"}, {
            "id": "719",
            "name": "山海关区",
            "code": "130303"
        }, {"id": "720", "name": "北戴河区", "code": "130304"}, {
            "id": "721",
            "name": "青龙满族自治县",
            "code": "130321"
        }, {"id": "722", "name": "昌黎县", "code": "130322"}, {"id": "723", "name": "抚宁县", "code": "130323"}, {
            "id": "724",
            "name": "卢龙县",
            "code": "130324"
        }]
    }, {
        "id": "109",
        "name": "邯郸市",
        "code": "130400",
        "area": [{"id": "725", "name": "邯山区", "code": "130402"}, {
            "id": "726",
            "name": "丛台区",
            "code": "130403"
        }, {"id": "727", "name": "复兴区", "code": "130404"}, {
            "id": "728",
            "name": "峰峰矿区",
            "code": "130406"
        }, {"id": "729", "name": "邯郸县", "code": "130421"}, {"id": "730", "name": "临漳县", "code": "130423"}, {
            "id": "731",
            "name": "成安县",
            "code": "130424"
        }, {"id": "732", "name": "大名县", "code": "130425"}, {"id": "733", "name": "涉县县", "code": "130426"}, {
            "id": "734",
            "name": "磁县县",
            "code": "130427"
        }, {"id": "735", "name": "肥乡县", "code": "130428"}, {"id": "736", "name": "永年县", "code": "130429"}, {
            "id": "737",
            "name": "邱县县",
            "code": "130430"
        }, {"id": "738", "name": "鸡泽县", "code": "130431"}, {"id": "739", "name": "广平县", "code": "130432"}, {
            "id": "740",
            "name": "馆陶县",
            "code": "130433"
        }, {"id": "741", "name": "魏县", "code": "130434"}, {"id": "742", "name": "曲周县", "code": "130435"}, {
            "id": "743",
            "name": "武安市",
            "code": "130481"
        }]
    }, {
        "id": "110",
        "name": "邢台市",
        "code": "130500",
        "area": [{"id": "744", "name": "桥东区", "code": "130502"}, {
            "id": "745",
            "name": "桥西区",
            "code": "130503"
        }, {"id": "746", "name": "邢台县", "code": "130521"}, {"id": "747", "name": "临城县", "code": "130522"}, {
            "id": "748",
            "name": "内丘县",
            "code": "130523"
        }, {"id": "749", "name": "柏乡县", "code": "130524"}, {"id": "750", "name": "隆尧县", "code": "130525"}, {
            "id": "751",
            "name": "任县",
            "code": "130526"
        }, {"id": "752", "name": "南和县", "code": "130527"}, {"id": "753", "name": "宁晋县", "code": "130528"}, {
            "id": "754",
            "name": "巨鹿县",
            "code": "130529"
        }, {"id": "755", "name": "新河县", "code": "130530"}, {"id": "756", "name": "广宗县", "code": "130531"}, {
            "id": "757",
            "name": "平乡县",
            "code": "130532"
        }, {"id": "758", "name": "威县", "code": "130533"}, {"id": "759", "name": "清河县", "code": "130534"}, {
            "id": "760",
            "name": "临西县",
            "code": "130535"
        }, {"id": "761", "name": "南宫县", "code": "130581"}, {"id": "762", "name": "沙河县", "code": "130582"}]
    }, {
        "id": "111",
        "name": "保定市",
        "code": "130600",
        "area": [{"id": "763", "name": "新市区", "code": "130602"}, {
            "id": "764",
            "name": "北市区",
            "code": "130603"
        }, {"id": "765", "name": "南市区", "code": "130604"}, {"id": "766", "name": "满城县", "code": "130621"}, {
            "id": "767",
            "name": "清苑县",
            "code": "130622"
        }, {"id": "768", "name": "涞水县", "code": "130623"}, {"id": "769", "name": "阜平县", "code": "130624"}, {
            "id": "770",
            "name": "徐水县",
            "code": "130625"
        }, {"id": "771", "name": "定兴县", "code": "130626"}, {"id": "772", "name": "唐县", "code": "130627"}, {
            "id": "773",
            "name": "高阳县",
            "code": "130628"
        }, {"id": "774", "name": "容城县", "code": "130629"}, {"id": "775", "name": "涞源县", "code": "130630"}, {
            "id": "776",
            "name": "望都县",
            "code": "130631"
        }, {"id": "777", "name": "安新县", "code": "130632"}, {"id": "778", "name": "易县", "code": "130633"}, {
            "id": "779",
            "name": "曲阳县",
            "code": "130634"
        }, {"id": "780", "name": "蠡县县", "code": "130635"}, {"id": "781", "name": "顺平县", "code": "130636"}, {
            "id": "782",
            "name": "博野县",
            "code": "130637"
        }, {"id": "783", "name": "雄县", "code": "130638"}, {"id": "784", "name": "涿州市", "code": "130681"}, {
            "id": "785",
            "name": "定州市",
            "code": "130682"
        }, {"id": "786", "name": "安国市", "code": "130683"}]
    }, {
        "id": "112",
        "name": "张家口市",
        "code": "130700",
        "area": [{"id": "787", "name": "高碑店市", "code": "130684"}, {
            "id": "788",
            "name": "桥东区",
            "code": "130702"
        }, {"id": "789", "name": "桥西区", "code": "130703"}, {"id": "790", "name": "宣化区", "code": "130705"}, {
            "id": "791",
            "name": "下花园区",
            "code": "130706"
        }, {"id": "792", "name": "宣化县", "code": "130721"}, {"id": "793", "name": "张北县", "code": "130722"}, {
            "id": "794",
            "name": "康保县",
            "code": "130723"
        }, {"id": "795", "name": "沽源县", "code": "130724"}, {"id": "796", "name": "尚义县", "code": "130725"}, {
            "id": "797",
            "name": "蔚县",
            "code": "130726"
        }, {"id": "798", "name": "阳原县", "code": "130727"}, {"id": "799", "name": "怀安县", "code": "130728"}, {
            "id": "800",
            "name": "万全县",
            "code": "130729"
        }, {"id": "801", "name": "怀来县", "code": "130730"}, {"id": "802", "name": "涿鹿县", "code": "130731"}, {
            "id": "803",
            "name": "赤城县",
            "code": "130732"
        }, {"id": "804", "name": "崇礼县", "code": "130733"}]
    }, {
        "id": "113",
        "name": "承德市",
        "code": "130800",
        "area": [{"id": "805", "name": "双桥区", "code": "130802"}, {
            "id": "806",
            "name": "双滦区",
            "code": "130803"
        }, {"id": "807", "name": "鹰手营子矿区", "code": "130804"}, {
            "id": "808",
            "name": "承德县",
            "code": "130821"
        }, {"id": "809", "name": "兴隆县", "code": "130822"}, {"id": "810", "name": "平泉县", "code": "130823"}, {
            "id": "811",
            "name": "滦平县",
            "code": "130824"
        }, {"id": "812", "name": "隆化县", "code": "130825"}, {
            "id": "813",
            "name": "丰宁满族自治县",
            "code": "130826"
        }, {"id": "814", "name": "宽城满族自治县", "code": "130827"}, {"id": "815", "name": "围场满族蒙古族自治县", "code": "130828"}]
    }, {
        "id": "114",
        "name": "沧州市",
        "code": "130900",
        "area": [{"id": "816", "name": "新华区", "code": "130902"}, {
            "id": "817",
            "name": "运河区",
            "code": "130903"
        }, {"id": "818", "name": "沧县", "code": "130921"}, {"id": "819", "name": "青县", "code": "130922"}, {
            "id": "820",
            "name": "东光县",
            "code": "130923"
        }, {"id": "821", "name": "海兴县", "code": "130924"}, {"id": "822", "name": "盐山县", "code": "130925"}, {
            "id": "823",
            "name": "肃宁县",
            "code": "130926"
        }, {"id": "824", "name": "南皮县", "code": "130927"}, {"id": "825", "name": "吴桥县", "code": "130928"}, {
            "id": "826",
            "name": "献县",
            "code": "130929"
        }, {"id": "827", "name": "孟村回族自治县", "code": "130930"}, {
            "id": "828",
            "name": "泊头市",
            "code": "130981"
        }, {"id": "829", "name": "任丘市", "code": "130982"}, {"id": "830", "name": "黄骅市", "code": "130983"}, {
            "id": "831",
            "name": "河间市",
            "code": "130984"
        }]
    }, {
        "id": "115",
        "name": "廊坊市",
        "code": "131000",
        "area": [{"id": "832", "name": "安次区", "code": "131002"}, {
            "id": "833",
            "name": "广阳区",
            "code": "131003"
        }, {"id": "834", "name": "固安县", "code": "131022"}, {"id": "835", "name": "永清县", "code": "131023"}, {
            "id": "836",
            "name": "香河县",
            "code": "131024"
        }, {"id": "837", "name": "大城县", "code": "131025"}, {"id": "838", "name": "文安县", "code": "131026"}, {
            "id": "839",
            "name": "大厂回族自治县",
            "code": "131028"
        }, {"id": "840", "name": "霸州市", "code": "131081"}, {"id": "841", "name": "三河市", "code": "131082"}]
    }, {
        "id": "116",
        "name": "衡水市",
        "code": "131100",
        "area": [{"id": "842", "name": "桃城区", "code": "131102"}, {
            "id": "843",
            "name": "枣强县",
            "code": "131121"
        }, {"id": "844", "name": "武邑县", "code": "131122"}, {"id": "845", "name": "武强县", "code": "131123"}, {
            "id": "846",
            "name": "饶阳县",
            "code": "131124"
        }, {"id": "847", "name": "安平县", "code": "131125"}, {"id": "848", "name": "故城县", "code": "131126"}, {
            "id": "849",
            "name": "景县",
            "code": "131127"
        }, {"id": "850", "name": "阜城县", "code": "131128"}, {"id": "851", "name": "冀州市", "code": "131181"}, {
            "id": "852",
            "name": "深州市",
            "code": "131182"
        }]
    }]
}, {
    "id": "4",
    "name": "山西省",
    "code": "140000",
    "city": [{
        "id": "269",
        "name": "太原市",
        "code": "140100",
        "area": [{"id": "2055", "name": "小店区", "code": "140105"}, {
            "id": "2056",
            "name": "迎泽区",
            "code": "140106"
        }, {"id": "2057", "name": "杏花岭区", "code": "140107"}, {
            "id": "2058",
            "name": "尖草坪区",
            "code": "140108"
        }, {"id": "2059", "name": "万柏林区", "code": "140109"}, {
            "id": "2060",
            "name": "晋源区",
            "code": "140110"
        }, {"id": "2061", "name": "清徐县", "code": "140121"}, {
            "id": "2062",
            "name": "阳曲县",
            "code": "140122"
        }, {"id": "2063", "name": "娄烦县", "code": "140123"}, {"id": "2064", "name": "古交市", "code": "140181"}]
    }, {
        "id": "270",
        "name": "大同市",
        "code": "140200",
        "area": [{"id": "2065", "name": "城区", "code": "140202"}, {
            "id": "2066",
            "name": "矿区",
            "code": "140203"
        }, {"id": "2067", "name": "南郊区", "code": "140211"}, {
            "id": "2068",
            "name": "新荣区",
            "code": "140212"
        }, {"id": "2069", "name": "阳高县", "code": "140221"}, {
            "id": "2070",
            "name": "天镇县",
            "code": "140222"
        }, {"id": "2071", "name": "广灵县", "code": "140223"}, {
            "id": "2072",
            "name": "灵丘县",
            "code": "140224"
        }, {"id": "2073", "name": "浑源县", "code": "140225"}, {
            "id": "2074",
            "name": "左云县",
            "code": "140226"
        }, {"id": "2075", "name": "大同县", "code": "140227"}]
    }, {
        "id": "271",
        "name": "阳泉市",
        "code": "140300",
        "area": [{"id": "2076", "name": "城区", "code": "140302"}, {
            "id": "2077",
            "name": "矿区",
            "code": "140303"
        }, {"id": "2078", "name": "郊区", "code": "140311"}, {
            "id": "2079",
            "name": "平定县",
            "code": "140321"
        }, {"id": "2080", "name": "盂县", "code": "140322"}]
    }, {
        "id": "272",
        "name": "长治市",
        "code": "140400",
        "area": [{"id": "2081", "name": "长治县", "code": "140421"}, {
            "id": "2082",
            "name": "襄垣县",
            "code": "140423"
        }, {"id": "2083", "name": "屯留县", "code": "140424"}, {
            "id": "2084",
            "name": "平顺县",
            "code": "140425"
        }, {"id": "2085", "name": "黎城县", "code": "140426"}, {
            "id": "2086",
            "name": "壶关县",
            "code": "140427"
        }, {"id": "2087", "name": "长子县", "code": "140428"}, {
            "id": "2088",
            "name": "武乡县",
            "code": "140429"
        }, {"id": "2089", "name": "沁县", "code": "140430"}, {
            "id": "2090",
            "name": "沁源县",
            "code": "140431"
        }, {"id": "2091", "name": "潞城市", "code": "140481"}, {
            "id": "2092",
            "name": "城区",
            "code": "140482"
        }, {"id": "2093", "name": "郊区", "code": "140483"}]
    }, {
        "id": "273",
        "name": "晋城市",
        "code": "140500",
        "area": [{"id": "2094", "name": "城区", "code": "140502"}, {
            "id": "2095",
            "name": "沁水县",
            "code": "140521"
        }, {"id": "2096", "name": "阳城县", "code": "140522"}, {
            "id": "2097",
            "name": "陵川县",
            "code": "140524"
        }, {"id": "2098", "name": "泽州县", "code": "140525"}, {"id": "2099", "name": "高平市", "code": "140581"}]
    }, {
        "id": "274",
        "name": "朔州市",
        "code": "140600",
        "area": [{"id": "2100", "name": "朔城区", "code": "140602"}, {
            "id": "2101",
            "name": "平鲁区",
            "code": "140603"
        }, {"id": "2102", "name": "山阴县", "code": "140621"}, {
            "id": "2103",
            "name": "应县",
            "code": "140622"
        }, {"id": "2104", "name": "右玉县", "code": "140623"}, {"id": "2105", "name": "怀仁县", "code": "140624"}]
    }, {
        "id": "275",
        "name": "晋中市",
        "code": "140700",
        "area": [{"id": "2106", "name": "榆次区", "code": "140702"}, {
            "id": "2107",
            "name": "榆社县",
            "code": "140721"
        }, {"id": "2108", "name": "左权县", "code": "140722"}, {
            "id": "2109",
            "name": "和顺县",
            "code": "140723"
        }, {"id": "2110", "name": "昔阳县", "code": "140724"}, {
            "id": "2111",
            "name": "寿阳县",
            "code": "140725"
        }, {"id": "2112", "name": "太谷县", "code": "140726"}, {
            "id": "2113",
            "name": "祁县",
            "code": "140727"
        }, {"id": "2114", "name": "平遥县", "code": "140728"}, {
            "id": "2115",
            "name": "灵石县",
            "code": "140729"
        }, {"id": "2116", "name": "介休市", "code": "140781"}]
    }, {
        "id": "276",
        "name": "运城市",
        "code": "140800",
        "area": [{"id": "2117", "name": "盐湖区", "code": "140802"}, {
            "id": "2118",
            "name": "临猗县",
            "code": "140821"
        }, {"id": "2119", "name": "万荣县", "code": "140822"}, {
            "id": "2120",
            "name": "闻喜县",
            "code": "140823"
        }, {"id": "2121", "name": "稷山县", "code": "140824"}, {
            "id": "2122",
            "name": "新绛县",
            "code": "140825"
        }, {"id": "2123", "name": "绛县", "code": "140826"}, {
            "id": "2124",
            "name": "垣曲县",
            "code": "140827"
        }, {"id": "2125", "name": "夏县", "code": "140828"}, {
            "id": "2126",
            "name": "平陆县",
            "code": "140829"
        }, {"id": "2127", "name": "芮城县", "code": "140830"}, {
            "id": "2128",
            "name": "永济市",
            "code": "140881"
        }, {"id": "2129", "name": "河津市", "code": "140882"}]
    }, {
        "id": "277",
        "name": "忻州市",
        "code": "140900",
        "area": [{"id": "2130", "name": "忻府区", "code": "140902"}, {
            "id": "2131",
            "name": "定襄县",
            "code": "140921"
        }, {"id": "2132", "name": "五台县", "code": "140922"}, {
            "id": "2133",
            "name": "代县",
            "code": "140923"
        }, {"id": "2134", "name": "繁峙县", "code": "140924"}, {
            "id": "2135",
            "name": "宁武县",
            "code": "140925"
        }, {"id": "2136", "name": "静乐县", "code": "140926"}, {
            "id": "2137",
            "name": "神池县",
            "code": "140927"
        }, {"id": "2138", "name": "五寨县", "code": "140928"}, {
            "id": "2139",
            "name": "岢岚县",
            "code": "140929"
        }, {"id": "2140", "name": "河曲县", "code": "140930"}, {
            "id": "2141",
            "name": "保德县",
            "code": "140931"
        }, {"id": "2142", "name": "偏关县", "code": "140932"}, {"id": "2143", "name": "原平市", "code": "140981"}]
    }, {
        "id": "278",
        "name": "临汾市",
        "code": "141000",
        "area": [{"id": "2144", "name": "尧都区", "code": "141002"}, {
            "id": "2145",
            "name": "曲沃县",
            "code": "141021"
        }, {"id": "2146", "name": "翼城县", "code": "141022"}, {
            "id": "2147",
            "name": "襄汾县",
            "code": "141023"
        }, {"id": "2148", "name": "洪洞县", "code": "141024"}, {
            "id": "2149",
            "name": "古县",
            "code": "141025"
        }, {"id": "2150", "name": "安泽县", "code": "141026"}, {
            "id": "2151",
            "name": "浮山县",
            "code": "141027"
        }, {"id": "2152", "name": "吉县", "code": "141028"}, {
            "id": "2153",
            "name": "乡宁县",
            "code": "141029"
        }, {"id": "2154", "name": "大宁县", "code": "141030"}, {
            "id": "2155",
            "name": "隰县",
            "code": "141031"
        }, {"id": "2156", "name": "永和县", "code": "141032"}, {
            "id": "2157",
            "name": "蒲县",
            "code": "141033"
        }, {"id": "2158", "name": "汾西县", "code": "141034"}, {
            "id": "2159",
            "name": "侯马市",
            "code": "141081"
        }, {"id": "2160", "name": "霍州市", "code": "141082"}]
    }, {
        "id": "279",
        "name": "吕梁市",
        "code": "141100",
        "area": [{"id": "2161", "name": "离石区", "code": "141102"}, {
            "id": "2162",
            "name": "文水县",
            "code": "141121"
        }, {"id": "2163", "name": "交城县", "code": "141122"}, {
            "id": "2164",
            "name": "兴县",
            "code": "141123"
        }, {"id": "2165", "name": "临县县", "code": "141124"}, {
            "id": "2166",
            "name": "柳林县",
            "code": "141125"
        }, {"id": "2167", "name": "石楼县", "code": "141126"}, {
            "id": "2168",
            "name": "岚县",
            "code": "141127"
        }, {"id": "2169", "name": "方山县", "code": "141128"}, {
            "id": "2170",
            "name": "中阳县",
            "code": "141129"
        }, {"id": "2171", "name": "交口县", "code": "141130"}, {
            "id": "2172",
            "name": "孝义市",
            "code": "141181"
        }, {"id": "2173", "name": "汾阳市", "code": "141182"}]
    }]
}, {
    "id": "5",
    "name": "内蒙古自治区",
    "code": "150000",
    "city": [{
        "id": "226",
        "name": "呼和浩特市",
        "code": "150100",
        "area": [{"id": "1730", "name": "新城区", "code": "150102"}, {
            "id": "1731",
            "name": "回民区",
            "code": "150103"
        }, {"id": "1732", "name": "玉泉区", "code": "150104"}, {
            "id": "1733",
            "name": "赛罕区",
            "code": "150105"
        }, {"id": "1734", "name": "土默特左旗", "code": "150121"}, {
            "id": "1735",
            "name": "托克托县",
            "code": "150122"
        }, {"id": "1736", "name": "和林格尔县", "code": "150123"}, {
            "id": "1737",
            "name": "清水河县",
            "code": "150124"
        }, {"id": "1738", "name": "武川县", "code": "150125"}]
    }, {
        "id": "227",
        "name": "包头市",
        "code": "150200",
        "area": [{"id": "1739", "name": "东河区", "code": "150202"}, {
            "id": "1740",
            "name": "昆都仑区",
            "code": "150203"
        }, {"id": "1741", "name": "青山区", "code": "150204"}, {
            "id": "1742",
            "name": "石拐区",
            "code": "150205"
        }, {"id": "1743", "name": "白云矿区", "code": "150206"}, {
            "id": "1744",
            "name": "九原区",
            "code": "150207"
        }, {"id": "1745", "name": "土默特右旗", "code": "150221"}, {
            "id": "1746",
            "name": "固阳县",
            "code": "150222"
        }, {"id": "1747", "name": "达尔罕茂明安联合旗", "code": "150223"}]
    }, {
        "id": "228",
        "name": "乌海市",
        "code": "150300",
        "area": [{"id": "1748", "name": "海勃湾区", "code": "150302"}, {
            "id": "1749",
            "name": "海南区",
            "code": "150303"
        }, {"id": "1750", "name": "乌达区", "code": "150304"}]
    }, {
        "id": "229",
        "name": "赤峰市",
        "code": "150400",
        "area": [{"id": "1751", "name": "红山区", "code": "150402"}, {
            "id": "1752",
            "name": "元宝山区",
            "code": "150403"
        }, {"id": "1753", "name": "松山区", "code": "150404"}, {
            "id": "1754",
            "name": "阿鲁科尔沁旗",
            "code": "150421"
        }, {"id": "1755", "name": "巴林左旗", "code": "150422"}, {
            "id": "1756",
            "name": "巴林右旗",
            "code": "150423"
        }, {"id": "1757", "name": "林西县", "code": "150424"}, {
            "id": "1758",
            "name": "克什克腾旗",
            "code": "150425"
        }, {"id": "1759", "name": "翁牛特旗", "code": "150426"}, {
            "id": "1760",
            "name": "喀喇沁旗",
            "code": "150428"
        }, {"id": "1761", "name": "宁城县", "code": "150429"}, {"id": "1762", "name": "敖汉旗", "code": "150430"}]
    }, {
        "id": "230",
        "name": "通辽市",
        "code": "150500",
        "area": [{"id": "1763", "name": "科尔沁区", "code": "150502"}, {
            "id": "1764",
            "name": "科尔沁左翼中旗",
            "code": "150521"
        }, {"id": "1765", "name": "科尔沁左翼后旗", "code": "150522"}, {
            "id": "1766",
            "name": "开鲁县",
            "code": "150523"
        }, {"id": "1767", "name": "库伦旗", "code": "150524"}, {
            "id": "1768",
            "name": "奈曼旗",
            "code": "150525"
        }, {"id": "1769", "name": "扎鲁特旗", "code": "150526"}, {"id": "1770", "name": "霍林郭勒市", "code": "150581"}]
    }, {
        "id": "231",
        "name": "鄂尔多斯市",
        "code": "150600",
        "area": [{"id": "1771", "name": "东胜区", "code": "150602"}, {
            "id": "1772",
            "name": "达拉特旗",
            "code": "150621"
        }, {"id": "1773", "name": "准格尔旗", "code": "150622"}, {
            "id": "1774",
            "name": "鄂托克前旗",
            "code": "150623"
        }, {"id": "1775", "name": "鄂托克旗", "code": "150624"}, {
            "id": "1776",
            "name": "杭锦旗",
            "code": "150625"
        }, {"id": "1777", "name": "乌审旗", "code": "150626"}, {"id": "1778", "name": "伊金霍洛旗", "code": "150627"}]
    }, {
        "id": "232",
        "name": "呼伦贝尔市",
        "code": "150700",
        "area": [{"id": "1779", "name": "海拉尔区", "code": "150702"}, {
            "id": "1780",
            "name": "扎赉诺尔区",
            "code": "150703"
        }, {"id": "1781", "name": "阿荣旗", "code": "150721"}, {
            "id": "1782",
            "name": "莫力达瓦达翰尔族自治旗",
            "code": "150722"
        }, {"id": "1783", "name": "鄂伦春自治旗", "code": "150723"}, {
            "id": "1784",
            "name": "鄂温克自治旗",
            "code": "150724"
        }, {"id": "1785", "name": "陈巴尔虎自治旗", "code": "150725"}, {
            "id": "1786",
            "name": "新巴尔虎左旗",
            "code": "150726"
        }, {"id": "1787", "name": "新巴尔虎右旗", "code": "150727"}, {
            "id": "1788",
            "name": "满洲里市",
            "code": "150781"
        }, {"id": "1789", "name": "牙克石市", "code": "150782"}, {
            "id": "1790",
            "name": "扎兰屯市",
            "code": "150783"
        }, {"id": "1791", "name": "额尔古纳市", "code": "150784"}, {"id": "1792", "name": "根河市", "code": "150785"}]
    }, {
        "id": "233",
        "name": "巴彦淖尔市",
        "code": "150800",
        "area": [{"id": "1793", "name": "临河区", "code": "150802"}, {
            "id": "1794",
            "name": "五原县",
            "code": "150821"
        }, {"id": "1795", "name": "磴口县", "code": "150822"}, {
            "id": "1796",
            "name": "乌拉特前旗",
            "code": "150823"
        }, {"id": "1797", "name": "乌拉特中旗", "code": "150824"}, {
            "id": "1798",
            "name": "乌拉特后旗",
            "code": "150825"
        }, {"id": "1799", "name": "杭锦后旗", "code": "150826"}]
    }, {
        "id": "234",
        "name": "乌兰察布市",
        "code": "150900",
        "area": [{"id": "1800", "name": "集宁区", "code": "150902"}, {
            "id": "1801",
            "name": "卓资县",
            "code": "150921"
        }, {"id": "1802", "name": "化德县", "code": "150922"}, {
            "id": "1803",
            "name": "商都县",
            "code": "150923"
        }, {"id": "1804", "name": "兴和县", "code": "150924"}, {
            "id": "1805",
            "name": "凉城县",
            "code": "150925"
        }, {"id": "1806", "name": "察哈尔右翼前旗", "code": "150926"}, {
            "id": "1807",
            "name": "察哈尔右翼中旗",
            "code": "150927"
        }, {"id": "1808", "name": "察哈尔右翼后旗", "code": "150928"}, {
            "id": "1809",
            "name": "四子王旗",
            "code": "150929"
        }, {"id": "1810", "name": "丰镇市", "code": "150981"}]
    }, {
        "id": "235",
        "name": "兴安盟",
        "code": "152200",
        "area": [{"id": "1811", "name": "乌兰浩特市", "code": "152201"}, {
            "id": "1812",
            "name": "阿尔山市",
            "code": "152202"
        }, {"id": "1813", "name": "科尔沁右翼前旗", "code": "152221"}, {
            "id": "1814",
            "name": "科尔沁右翼中旗",
            "code": "152222"
        }, {"id": "1815", "name": "扎赉特旗", "code": "152223"}, {"id": "1816", "name": "突泉县", "code": "152224"}]
    }, {
        "id": "236",
        "name": "锡林郭勒盟",
        "code": "152500",
        "area": [{"id": "1817", "name": "二连浩特市", "code": "152501"}, {
            "id": "1818",
            "name": "锡林浩特市",
            "code": "152502"
        }, {"id": "1819", "name": "阿巴嘎旗", "code": "152522"}, {
            "id": "1820",
            "name": "苏尼特左旗",
            "code": "152523"
        }, {"id": "1821", "name": "苏尼特右旗", "code": "152524"}, {
            "id": "1822",
            "name": "东乌珠穆沁旗",
            "code": "152525"
        }, {"id": "1823", "name": "西乌珠穆沁旗", "code": "152526"}, {
            "id": "1824",
            "name": "太仆寺旗",
            "code": "152527"
        }, {"id": "1825", "name": "镶黄旗", "code": "152528"}, {
            "id": "1826",
            "name": "正镶白旗",
            "code": "152529"
        }, {"id": "1827", "name": "正蓝旗", "code": "152530"}, {"id": "1828", "name": "多伦县", "code": "152531"}]
    }, {
        "id": "237",
        "name": "阿拉善盟",
        "code": "152900",
        "area": [{"id": "1829", "name": "阿拉善左旗", "code": "152921"}, {
            "id": "1830",
            "name": "阿拉善右旗",
            "code": "152922"
        }, {"id": "1831", "name": "额济纳旗", "code": "152923"}]
    }]
}, {
    "id": "6",
    "name": "辽宁省",
    "code": "210000",
    "city": [{
        "id": "212",
        "name": "沈阳市",
        "code": "210100",
        "area": [{"id": "1630", "name": "和平区", "code": "210102"}, {
            "id": "1631",
            "name": "沈河区",
            "code": "210103"
        }, {"id": "1632", "name": "大东区", "code": "210104"}, {
            "id": "1633",
            "name": "皇姑区",
            "code": "210105"
        }, {"id": "1634", "name": "铁西区", "code": "210106"}, {
            "id": "1635",
            "name": "苏家屯区",
            "code": "210111"
        }, {"id": "1636", "name": "浑南区", "code": "210112"}, {
            "id": "1637",
            "name": "于洪区",
            "code": "210114"
        }, {"id": "1638", "name": "辽中县", "code": "210122"}, {
            "id": "1639",
            "name": "康平县",
            "code": "210123"
        }, {"id": "1640", "name": "法库县", "code": "210124"}, {
            "id": "1641",
            "name": "新民县",
            "code": "210181"
        }, {"id": "1642", "name": "沈北新区", "code": "210184"}]
    }, {
        "id": "213",
        "name": "大连市",
        "code": "210200",
        "area": [{"id": "1643", "name": "中山区", "code": "210202"}, {
            "id": "1644",
            "name": "西岗区",
            "code": "210203"
        }, {"id": "1645", "name": "沙河口区", "code": "210204"}, {
            "id": "1646",
            "name": "甘井子区",
            "code": "210211"
        }, {"id": "1647", "name": "旅顺口区", "code": "210212"}, {
            "id": "1648",
            "name": "金州区",
            "code": "210213"
        }, {"id": "1649", "name": "长海县", "code": "210224"}, {
            "id": "1650",
            "name": "瓦房店市",
            "code": "210281"
        }, {"id": "1651", "name": "普兰店市", "code": "210282"}, {"id": "1652", "name": "庄河市", "code": "210283"}]
    }, {
        "id": "214",
        "name": "鞍山市",
        "code": "210300",
        "area": [{"id": "1653", "name": "铁东区", "code": "210302"}, {
            "id": "1654",
            "name": "铁西区",
            "code": "210303"
        }, {"id": "1655", "name": "立山区", "code": "210304"}, {
            "id": "1656",
            "name": "千山区",
            "code": "210311"
        }, {"id": "1657", "name": "台安县", "code": "210321"}, {
            "id": "1658",
            "name": "岫岩满族自治县",
            "code": "210323"
        }, {"id": "1659", "name": "海城市", "code": "210381"}]
    }, {
        "id": "215",
        "name": "抚顺市",
        "code": "210400",
        "area": [{"id": "1660", "name": "新抚区", "code": "210402"}, {
            "id": "1661",
            "name": "东洲区",
            "code": "210403"
        }, {"id": "1662", "name": "望花区", "code": "210404"}, {
            "id": "1663",
            "name": "顺城区",
            "code": "210411"
        }, {"id": "1664", "name": "抚顺县", "code": "210421"}, {
            "id": "1665",
            "name": "新宾满族自治县",
            "code": "210422"
        }, {"id": "1666", "name": "清原满族自治县", "code": "210423"}]
    }, {
        "id": "216",
        "name": "本溪市",
        "code": "210500",
        "area": [{"id": "1667", "name": "平山区", "code": "210502"}, {
            "id": "1668",
            "name": "溪湖区",
            "code": "210503"
        }, {"id": "1669", "name": "明山区", "code": "210504"}, {
            "id": "1670",
            "name": "南芬区",
            "code": "210505"
        }, {"id": "1671", "name": "本溪满族自治县", "code": "210521"}, {"id": "1672", "name": "桓仁满族自治县", "code": "210522"}]
    }, {
        "id": "217",
        "name": "丹东市",
        "code": "210600",
        "area": [{"id": "1673", "name": "元宝区", "code": "210602"}, {
            "id": "1674",
            "name": "振兴区",
            "code": "210603"
        }, {"id": "1675", "name": "振安区", "code": "210604"}, {
            "id": "1676",
            "name": "宽甸满族自治县",
            "code": "210624"
        }, {"id": "1677", "name": "东港市", "code": "210681"}, {"id": "1678", "name": "凤城市", "code": "210682"}]
    }, {
        "id": "218",
        "name": "锦州市",
        "code": "210700",
        "area": [{"id": "1679", "name": "古塔区", "code": "210702"}, {
            "id": "1680",
            "name": "凌河区",
            "code": "210703"
        }, {"id": "1681", "name": "太和区", "code": "210711"}, {
            "id": "1682",
            "name": "黑山县",
            "code": "210726"
        }, {"id": "1683", "name": "义县", "code": "210727"}, {
            "id": "1684",
            "name": "凌海市",
            "code": "210781"
        }, {"id": "1685", "name": "北镇市", "code": "210782"}]
    }, {
        "id": "219",
        "name": "营口市",
        "code": "210800",
        "area": [{"id": "1686", "name": "站前区", "code": "210802"}, {
            "id": "1687",
            "name": "西市区",
            "code": "210803"
        }, {"id": "1688", "name": "鲅鱼圈区", "code": "210804"}, {
            "id": "1689",
            "name": "老边区",
            "code": "210811"
        }, {"id": "1690", "name": "盖州市", "code": "210881"}, {"id": "1691", "name": "大石桥市", "code": "210882"}]
    }, {
        "id": "220",
        "name": "阜新市",
        "code": "210900",
        "area": [{"id": "1692", "name": "海州区", "code": "210902"}, {
            "id": "1693",
            "name": "新邱区",
            "code": "210903"
        }, {"id": "1694", "name": "太平区", "code": "210904"}, {
            "id": "1695",
            "name": "清河门区",
            "code": "210905"
        }, {"id": "1696", "name": "细河区", "code": "210911"}, {
            "id": "1697",
            "name": "阜新蒙古族自治县",
            "code": "210921"
        }, {"id": "1698", "name": "彰武县", "code": "210922"}]
    }, {
        "id": "221",
        "name": "辽阳市",
        "code": "211000",
        "area": [{"id": "1699", "name": "白塔区", "code": "211002"}, {
            "id": "1700",
            "name": "文圣区",
            "code": "211003"
        }, {"id": "1701", "name": "宏伟区", "code": "211004"}, {
            "id": "1702",
            "name": "弓长岭区",
            "code": "211005"
        }, {"id": "1703", "name": "太子河区", "code": "211011"}, {
            "id": "1704",
            "name": "辽阳县",
            "code": "211021"
        }, {"id": "1705", "name": "灯塔市", "code": "211081"}]
    }, {
        "id": "222",
        "name": "盘锦市",
        "code": "211100",
        "area": [{"id": "1706", "name": "双台子区", "code": "211102"}, {
            "id": "1707",
            "name": "兴隆台区",
            "code": "211103"
        }, {"id": "1708", "name": "大洼县", "code": "211121"}, {"id": "1709", "name": "盘山县", "code": "211122"}]
    }, {
        "id": "223",
        "name": "铁岭市",
        "code": "211200",
        "area": [{"id": "1710", "name": "银州区", "code": "211202"}, {
            "id": "1711",
            "name": "清河区",
            "code": "211204"
        }, {"id": "1712", "name": "铁岭县", "code": "211221"}, {
            "id": "1713",
            "name": "西丰县",
            "code": "211223"
        }, {"id": "1714", "name": "昌图县", "code": "211224"}, {
            "id": "1715",
            "name": "调兵山市",
            "code": "211281"
        }, {"id": "1716", "name": "开原市", "code": "211282"}]
    }, {
        "id": "224",
        "name": "朝阳市",
        "code": "211300",
        "area": [{"id": "1717", "name": "双塔区", "code": "211302"}, {
            "id": "1718",
            "name": "龙城区",
            "code": "211303"
        }, {"id": "1719", "name": "朝阳县", "code": "211321"}, {
            "id": "1720",
            "name": "建平县",
            "code": "211322"
        }, {"id": "1721", "name": "喀左县", "code": "211324"}, {
            "id": "1722",
            "name": "北票市",
            "code": "211381"
        }, {"id": "1723", "name": "凌源市", "code": "211382"}]
    }, {
        "id": "225",
        "name": "葫芦岛市",
        "code": "211400",
        "area": [{"id": "1724", "name": "连山区", "code": "211402"}, {
            "id": "1725",
            "name": "龙港区",
            "code": "211403"
        }, {"id": "1726", "name": "南票区", "code": "211404"}, {
            "id": "1727",
            "name": "绥中县",
            "code": "211421"
        }, {"id": "1728", "name": "建昌县", "code": "211422"}, {"id": "1729", "name": "兴城市", "code": "211481"}]
    }]
}, {
    "id": "7",
    "name": "吉林省",
    "code": "220000",
    "city": [{
        "id": "203",
        "name": "长春市",
        "code": "220100",
        "area": [{"id": "1570", "name": "南关区", "code": "220102"}, {
            "id": "1571",
            "name": "宽城区",
            "code": "220103"
        }, {"id": "1572", "name": "朝阳区", "code": "220104"}, {
            "id": "1573",
            "name": "二道区",
            "code": "220105"
        }, {"id": "1574", "name": "绿园区", "code": "220106"}, {
            "id": "1575",
            "name": "双阳区",
            "code": "220112"
        }, {"id": "1576", "name": "农安县", "code": "220122"}, {
            "id": "1577",
            "name": "九台市",
            "code": "220181"
        }, {"id": "1578", "name": "榆树市", "code": "220182"}, {"id": "1579", "name": "德惠市", "code": "220183"}]
    }, {
        "id": "204",
        "name": "吉林市",
        "code": "220200",
        "area": [{"id": "1580", "name": "昌邑区", "code": "220202"}, {
            "id": "1581",
            "name": "龙潭区",
            "code": "220203"
        }, {"id": "1582", "name": "船营区", "code": "220204"}, {
            "id": "1583",
            "name": "丰满区",
            "code": "220211"
        }, {"id": "1584", "name": "永吉县", "code": "220221"}, {
            "id": "1585",
            "name": "蛟河市",
            "code": "220281"
        }, {"id": "1586", "name": "桦甸市", "code": "220282"}, {
            "id": "1587",
            "name": "舒兰市",
            "code": "220283"
        }, {"id": "1588", "name": "磐石市", "code": "220284"}]
    }, {
        "id": "205",
        "name": "四平市",
        "code": "220300",
        "area": [{"id": "1589", "name": "铁西区", "code": "220302"}, {
            "id": "1590",
            "name": "铁东区",
            "code": "220303"
        }, {"id": "1591", "name": "梨树县", "code": "220322"}, {
            "id": "1592",
            "name": "伊通满族自治县",
            "code": "220323"
        }, {"id": "1593", "name": "公主岭市", "code": "220381"}, {"id": "1594", "name": "双辽市", "code": "220382"}]
    }, {
        "id": "206",
        "name": "辽源市",
        "code": "220400",
        "area": [{"id": "1595", "name": "龙山区", "code": "220402"}, {
            "id": "1596",
            "name": "西安区",
            "code": "220403"
        }, {"id": "1597", "name": "东丰县", "code": "220421"}, {"id": "1598", "name": "东辽县", "code": "220422"}]
    }, {
        "id": "207",
        "name": "通化市",
        "code": "220500",
        "area": [{"id": "1599", "name": "东昌区", "code": "220502"}, {
            "id": "1600",
            "name": "二道江区",
            "code": "220503"
        }, {"id": "1601", "name": "通化县", "code": "220521"}, {
            "id": "1602",
            "name": "辉南县",
            "code": "220523"
        }, {"id": "1603", "name": "柳河县", "code": "220524"}, {
            "id": "1604",
            "name": "梅河口市",
            "code": "220581"
        }, {"id": "1605", "name": "集安市", "code": "220582"}]
    }, {
        "id": "208",
        "name": "白山市",
        "code": "220600",
        "area": [{"id": "1606", "name": "浑江区", "code": "220602"}, {
            "id": "1607",
            "name": "抚松县",
            "code": "220621"
        }, {"id": "1608", "name": "靖宇县", "code": "220622"}, {
            "id": "1609",
            "name": "长白朝鲜族自治县",
            "code": "220623"
        }, {"id": "1610", "name": "江源区", "code": "220625"}, {"id": "1611", "name": "临江市", "code": "220681"}]
    }, {
        "id": "209",
        "name": "松原市",
        "code": "220700",
        "area": [{"id": "1612", "name": "宁江区", "code": "220702"}, {
            "id": "1613",
            "name": "前郭尔罗斯蒙古族自治县",
            "code": "220721"
        }, {"id": "1614", "name": "长岭县", "code": "220722"}, {
            "id": "1615",
            "name": "乾安县",
            "code": "220723"
        }, {"id": "1616", "name": "扶余县", "code": "220724"}]
    }, {
        "id": "210",
        "name": "白城市",
        "code": "220800",
        "area": [{"id": "1617", "name": "洮北区", "code": "220802"}, {
            "id": "1618",
            "name": "镇赉县",
            "code": "220821"
        }, {"id": "1619", "name": "通榆县", "code": "220822"}, {
            "id": "1620",
            "name": "洮南市",
            "code": "220881"
        }, {"id": "1621", "name": "大安市", "code": "220882"}]
    }, {
        "id": "211",
        "name": "延边朝鲜族自治州",
        "code": "222400",
        "area": [{"id": "1622", "name": "延吉市", "code": "222401"}, {
            "id": "1623",
            "name": "图们市",
            "code": "222402"
        }, {"id": "1624", "name": "敦化市", "code": "222403"}, {
            "id": "1625",
            "name": "珲春市",
            "code": "222404"
        }, {"id": "1626", "name": "龙井市", "code": "222405"}, {
            "id": "1627",
            "name": "和龙市",
            "code": "222406"
        }, {"id": "1628", "name": "汪清县", "code": "222424"}, {"id": "1629", "name": "安图县", "code": "222426"}]
    }]
}, {
    "id": "8",
    "name": "黑龙江省",
    "code": "230000",
    "city": [{
        "id": "117",
        "name": "哈尔滨市",
        "code": "230100",
        "area": [{"id": "853", "name": "道里区", "code": "230102"}, {
            "id": "854",
            "name": "南岗区",
            "code": "230103"
        }, {"id": "855", "name": "道外区", "code": "230104"}, {"id": "856", "name": "香坊区", "code": "230106"}, {
            "id": "857",
            "name": "平房区",
            "code": "230108"
        }, {"id": "858", "name": "松北区", "code": "230109"}, {"id": "859", "name": "呼兰区", "code": "230111"}, {
            "id": "860",
            "name": "依兰区",
            "code": "230123"
        }, {"id": "861", "name": "方正县", "code": "230124"}, {"id": "862", "name": "宾县", "code": "230125"}, {
            "id": "863",
            "name": "巴彦县",
            "code": "230126"
        }, {"id": "864", "name": "木兰县", "code": "230127"}, {"id": "865", "name": "通河县", "code": "230128"}, {
            "id": "866",
            "name": "延寿县",
            "code": "230129"
        }, {"id": "867", "name": "阿城市", "code": "230181"}, {"id": "868", "name": "双城市", "code": "230182"}, {
            "id": "869",
            "name": "尚志市",
            "code": "230183"
        }, {"id": "870", "name": "五常市", "code": "230184"}]
    }, {
        "id": "118",
        "name": "齐齐哈尔市",
        "code": "230200",
        "area": [{"id": "871", "name": "龙沙区", "code": "230202"}, {
            "id": "872",
            "name": "建华区",
            "code": "230203"
        }, {"id": "873", "name": "铁锋区", "code": "230204"}, {
            "id": "874",
            "name": "昂昂溪区",
            "code": "230205"
        }, {"id": "875", "name": "富拉尔基区", "code": "230206"}, {
            "id": "876",
            "name": "碾子山区",
            "code": "230207"
        }, {"id": "877", "name": "梅里斯达斡尔族区", "code": "230208"}, {
            "id": "878",
            "name": "龙江县",
            "code": "230221"
        }, {"id": "879", "name": "依安县", "code": "230223"}, {"id": "880", "name": "泰来县", "code": "230224"}, {
            "id": "881",
            "name": "甘南县",
            "code": "230225"
        }, {"id": "882", "name": "富裕县", "code": "230227"}, {"id": "883", "name": "克山县", "code": "230229"}, {
            "id": "884",
            "name": "克东县",
            "code": "230230"
        }, {"id": "885", "name": "拜泉县", "code": "230231"}, {"id": "886", "name": "讷河县", "code": "230281"}]
    }, {
        "id": "119",
        "name": "鸡西市",
        "code": "230300",
        "area": [{"id": "887", "name": "鸡冠区", "code": "230302"}, {
            "id": "888",
            "name": "恒山区",
            "code": "230303"
        }, {"id": "889", "name": "滴道区", "code": "230304"}, {"id": "890", "name": "梨树区", "code": "230305"}, {
            "id": "891",
            "name": "城子河区",
            "code": "230306"
        }, {"id": "892", "name": "麻山区", "code": "230307"}, {"id": "893", "name": "鸡东县", "code": "230321"}, {
            "id": "894",
            "name": "虎林市",
            "code": "230381"
        }, {"id": "895", "name": "密山市", "code": "230382"}]
    }, {
        "id": "120",
        "name": "鹤岗市",
        "code": "230400",
        "area": [{"id": "896", "name": "向阳区", "code": "230402"}, {
            "id": "897",
            "name": "工农区",
            "code": "230403"
        }, {"id": "898", "name": "南山区", "code": "230404"}, {"id": "899", "name": "兴安区", "code": "230405"}, {
            "id": "900",
            "name": "东山区",
            "code": "230406"
        }, {"id": "901", "name": "兴山区", "code": "230407"}, {"id": "902", "name": "萝北县", "code": "230421"}, {
            "id": "903",
            "name": "绥滨县",
            "code": "230422"
        }]
    }, {
        "id": "121",
        "name": "双鸭山市",
        "code": "230500",
        "area": [{"id": "904", "name": "尖山区", "code": "230502"}, {
            "id": "905",
            "name": "岭东区",
            "code": "230503"
        }, {"id": "906", "name": "四方台区", "code": "230505"}, {
            "id": "907",
            "name": "宝山区",
            "code": "230506"
        }, {"id": "908", "name": "集贤县", "code": "230521"}, {"id": "909", "name": "友谊县", "code": "230522"}, {
            "id": "910",
            "name": "宝清县",
            "code": "230523"
        }, {"id": "911", "name": "饶河县", "code": "230524"}]
    }, {
        "id": "122",
        "name": "大庆市",
        "code": "230600",
        "area": [{"id": "912", "name": "萨尔图区", "code": "230602"}, {
            "id": "913",
            "name": "龙凤区",
            "code": "230603"
        }, {"id": "914", "name": "让胡路区", "code": "230604"}, {
            "id": "915",
            "name": "红岗区",
            "code": "230605"
        }, {"id": "916", "name": "大同区", "code": "230606"}, {"id": "917", "name": "肇州县", "code": "230621"}, {
            "id": "918",
            "name": "肇源县",
            "code": "230622"
        }, {"id": "919", "name": "林甸县", "code": "230623"}, {"id": "920", "name": "杜尔伯特蒙古族自治县", "code": "230624"}]
    }, {
        "id": "123",
        "name": "伊春市",
        "code": "230700",
        "area": [{"id": "921", "name": "伊春区", "code": "230702"}, {
            "id": "922",
            "name": "南岔区",
            "code": "230703"
        }, {"id": "923", "name": "友好区", "code": "230704"}, {"id": "924", "name": "西林区", "code": "230705"}, {
            "id": "925",
            "name": "翠峦区",
            "code": "230706"
        }, {"id": "926", "name": "新青区", "code": "230707"}, {"id": "927", "name": "美溪区", "code": "230708"}, {
            "id": "928",
            "name": "金山屯区",
            "code": "230709"
        }, {"id": "929", "name": "五营区", "code": "230710"}, {
            "id": "930",
            "name": "乌马河区",
            "code": "230711"
        }, {"id": "931", "name": "汤旺河区", "code": "230712"}, {
            "id": "932",
            "name": "带岭区",
            "code": "230713"
        }, {"id": "933", "name": "乌伊岭区", "code": "230714"}, {
            "id": "934",
            "name": "红星区",
            "code": "230715"
        }, {"id": "935", "name": "上甘岭区", "code": "230716"}, {
            "id": "936",
            "name": "嘉荫县",
            "code": "230722"
        }, {"id": "937", "name": "铁力市", "code": "230781"}]
    }, {
        "id": "124",
        "name": "佳木斯市",
        "code": "230800",
        "area": [{"id": "938", "name": "向阳区", "code": "230803"}, {
            "id": "939",
            "name": "前进区",
            "code": "230804"
        }, {"id": "940", "name": "东风区", "code": "230805"}, {"id": "941", "name": "郊区", "code": "230811"}, {
            "id": "942",
            "name": "桦南县",
            "code": "230822"
        }, {"id": "943", "name": "桦川县", "code": "230826"}, {"id": "944", "name": "汤原县", "code": "230828"}, {
            "id": "945",
            "name": "抚远县",
            "code": "230833"
        }, {"id": "946", "name": "同江市", "code": "230881"}, {"id": "947", "name": "富锦市", "code": "230882"}]
    }, {
        "id": "125",
        "name": "七台河市",
        "code": "230900",
        "area": [{"id": "948", "name": "新兴区", "code": "230902"}, {
            "id": "949",
            "name": "桃山区",
            "code": "230903"
        }, {"id": "950", "name": "茄子河区", "code": "230904"}, {"id": "951", "name": "勃利县", "code": "230921"}]
    }, {
        "id": "126",
        "name": "牡丹江市",
        "code": "231000",
        "area": [{"id": "952", "name": "东安区", "code": "231002"}, {
            "id": "953",
            "name": "阳明区",
            "code": "231003"
        }, {"id": "954", "name": "爱民区", "code": "231004"}, {"id": "955", "name": "西安区", "code": "231005"}, {
            "id": "956",
            "name": "东宁县",
            "code": "231024"
        }, {"id": "957", "name": "林口县", "code": "231025"}, {
            "id": "958",
            "name": "绥芬河市",
            "code": "231081"
        }, {"id": "959", "name": "海林市", "code": "231083"}, {"id": "960", "name": "宁安市", "code": "231084"}, {
            "id": "961",
            "name": "穆棱市",
            "code": "231085"
        }]
    }, {
        "id": "127",
        "name": "黑河市",
        "code": "231100",
        "area": [{"id": "962", "name": "爱辉区", "code": "231102"}, {
            "id": "963",
            "name": "嫩江县",
            "code": "231121"
        }, {"id": "964", "name": "逊克县", "code": "231123"}, {"id": "965", "name": "孙吴县", "code": "231124"}, {
            "id": "966",
            "name": "北安市",
            "code": "231181"
        }, {"id": "967", "name": "五大连池市", "code": "231182"}]
    }, {
        "id": "128",
        "name": "绥化市",
        "code": "231200",
        "area": [{"id": "968", "name": "北林区", "code": "231202"}, {
            "id": "969",
            "name": "望奎县",
            "code": "231221"
        }, {"id": "970", "name": "兰西县", "code": "231222"}, {"id": "971", "name": "青冈县", "code": "231223"}, {
            "id": "972",
            "name": "庆安县",
            "code": "231224"
        }, {"id": "973", "name": "明水县", "code": "231225"}, {"id": "974", "name": "绥棱县", "code": "231226"}, {
            "id": "975",
            "name": "安达市",
            "code": "231281"
        }, {"id": "976", "name": "肇东市", "code": "231282"}, {"id": "977", "name": "海伦市", "code": "231283"}]
    }, {
        "id": "129",
        "name": "大兴安岭地区",
        "code": "232700",
        "area": [{"id": "978", "name": "松岭县", "code": "232702"}, {
            "id": "979",
            "name": "呼玛县",
            "code": "232721"
        }, {"id": "980", "name": "塔河县", "code": "232722"}, {"id": "981", "name": "漠河县", "code": "232723"}, {
            "id": "982",
            "name": "加格达奇区",
            "code": "232724"
        }]
    }]
}, {
    "id": "9",
    "name": "上海市",
    "code": "310000",
    "city": [{
        "id": "268",
        "name": "上海市",
        "code": "310100",
        "area": [{"id": "2038", "name": "黄浦区", "code": "310101"}, {
            "id": "2039",
            "name": "徐汇区",
            "code": "310104"
        }, {"id": "2040", "name": "长宁区", "code": "310105"}, {
            "id": "2041",
            "name": "静安区",
            "code": "310106"
        }, {"id": "2042", "name": "普陀区", "code": "310107"}, {
            "id": "2043",
            "name": "虹口区",
            "code": "310109"
        }, {"id": "2044", "name": "闸北区", "code": "310109"}, {
            "id": "2045",
            "name": "杨浦区",
            "code": "310110"
        }, {"id": "2046", "name": "闵行区", "code": "310112"}, {
            "id": "2047",
            "name": "宝山区",
            "code": "310113"
        }, {"id": "2048", "name": "嘉定区", "code": "310114"}, {
            "id": "2049",
            "name": "浦东区",
            "code": "310115"
        }, {"id": "2050", "name": "金山区", "code": "310116"}, {
            "id": "2051",
            "name": "松江区",
            "code": "310117"
        }, {"id": "2052", "name": "青浦区", "code": "310118"}, {
            "id": "2053",
            "name": "奉贤区",
            "code": "310120"
        }, {"id": "2054", "name": "崇明区", "code": "310230"}]
    }]
}, {
    "id": "10",
    "name": "江苏省",
    "code": "320000",
    "city": [{
        "id": "179",
        "name": "南京市",
        "code": "320100",
        "area": [{"id": "1367", "name": "玄武区", "code": "320102"}, {
            "id": "1368",
            "name": "白下区",
            "code": "320103"
        }, {"id": "1369", "name": "秦淮区", "code": "320104"}, {
            "id": "1370",
            "name": "建邺区",
            "code": "320105"
        }, {"id": "1371", "name": "鼓楼区", "code": "320106"}, {
            "id": "1372",
            "name": "下关区",
            "code": "320107"
        }, {"id": "1373", "name": "浦口区", "code": "320111"}, {
            "id": "1374",
            "name": "栖霞区",
            "code": "320113"
        }, {"id": "1375", "name": "雨花台区", "code": "320114"}, {
            "id": "1376",
            "name": "江宁区",
            "code": "320115"
        }, {"id": "1377", "name": "六合区", "code": "320116"}, {
            "id": "1378",
            "name": "溧水县",
            "code": "320124"
        }, {"id": "1379", "name": "高淳县", "code": "320125"}]
    }, {
        "id": "180",
        "name": "无锡市",
        "code": "320200",
        "area": [{"id": "1380", "name": "崇安区", "code": "320202"}, {
            "id": "1381",
            "name": "南长区",
            "code": "320203"
        }, {"id": "1382", "name": "北塘区", "code": "320204"}, {
            "id": "1383",
            "name": "锡山区",
            "code": "320205"
        }, {"id": "1384", "name": "惠山区", "code": "320206"}, {
            "id": "1385",
            "name": "滨湖区",
            "code": "320211"
        }, {"id": "1386", "name": "梁溪区", "code": "320213"}, {
            "id": "1387",
            "name": "新吴区",
            "code": "320214"
        }, {"id": "1388", "name": "江阴区", "code": "320281"}, {"id": "1389", "name": "宜兴区", "code": "320282"}]
    }, {
        "id": "181",
        "name": "徐州市",
        "code": "320300",
        "area": [{"id": "1390", "name": "鼓楼区", "code": "320302"}, {
            "id": "1391",
            "name": "云龙区",
            "code": "320303"
        }, {"id": "1392", "name": "贾汪区", "code": "320305"}, {
            "id": "1393",
            "name": "泉山区",
            "code": "320311"
        }, {"id": "1394", "name": "丰县", "code": "320321"}, {
            "id": "1395",
            "name": "沛县",
            "code": "320322"
        }, {"id": "1396", "name": "铜山区", "code": "320323"}, {
            "id": "1397",
            "name": "睢宁市",
            "code": "320324"
        }, {"id": "1398", "name": "新沂市", "code": "320381"}, {"id": "1399", "name": "邳州市", "code": "320382"}]
    }, {
        "id": "182",
        "name": "常州市",
        "code": "320400",
        "area": [{"id": "1400", "name": "天宁区", "code": "320402"}, {
            "id": "1401",
            "name": "钟楼区",
            "code": "320404"
        }, {"id": "1402", "name": "戚墅堰区", "code": "320405"}, {
            "id": "1403",
            "name": "新北区",
            "code": "320411"
        }, {"id": "1404", "name": "武进区", "code": "320412"}, {
            "id": "1405",
            "name": "溧阳区",
            "code": "320481"
        }, {"id": "1406", "name": "金坛市", "code": "320482"}]
    }, {
        "id": "183",
        "name": "苏州市",
        "code": "320500",
        "area": [{"id": "1407", "name": "虎丘区", "code": "320505"}, {
            "id": "1408",
            "name": "吴中区",
            "code": "320506"
        }, {"id": "1409", "name": "相城区", "code": "320507"}, {
            "id": "1410",
            "name": "姑苏区",
            "code": "320508"
        }, {"id": "1411", "name": "常熟市", "code": "320581"}, {
            "id": "1412",
            "name": "张家港市",
            "code": "320582"
        }, {"id": "1413", "name": "昆山市", "code": "320583"}, {
            "id": "1414",
            "name": "吴江区",
            "code": "320584"
        }, {"id": "1415", "name": "太仓市", "code": "320585"}]
    }, {
        "id": "184",
        "name": "南通市",
        "code": "320600",
        "area": [{"id": "1416", "name": "崇川区", "code": "320602"}, {
            "id": "1417",
            "name": "港闸区",
            "code": "320611"
        }, {"id": "1418", "name": "通州区", "code": "320612"}, {
            "id": "1419",
            "name": "海安县",
            "code": "320621"
        }, {"id": "1420", "name": "如东县", "code": "320623"}, {
            "id": "1421",
            "name": "启东市",
            "code": "320681"
        }, {"id": "1422", "name": "如皋市", "code": "320682"}, {"id": "1423", "name": "海门市", "code": "320684"}]
    }, {
        "id": "185",
        "name": "连云港市",
        "code": "320700",
        "area": [{"id": "1424", "name": "连云区", "code": "320703"}, {
            "id": "1425",
            "name": "新浦区",
            "code": "320705"
        }, {"id": "1426", "name": "海州区", "code": "320706"}, {
            "id": "1427",
            "name": "赣榆县",
            "code": "320721"
        }, {"id": "1428", "name": "东海县", "code": "320722"}, {
            "id": "1429",
            "name": "灌云县",
            "code": "320723"
        }, {"id": "1430", "name": "灌南县", "code": "320724"}]
    }, {
        "id": "186",
        "name": "淮安市",
        "code": "320800",
        "area": [{"id": "1431", "name": "清江浦区", "code": "320802"}, {
            "id": "1432",
            "name": "淮安区",
            "code": "320803"
        }, {"id": "1433", "name": "淮阴区", "code": "320804"}, {
            "id": "1434",
            "name": "涟水区",
            "code": "320826"
        }, {"id": "1435", "name": "洪泽县", "code": "320829"}, {"id": "1436", "name": "盱眙县", "code": "320830"}]
    }, {
        "id": "187",
        "name": "盐城市",
        "code": "320900",
        "area": [{"id": "1437", "name": "金湖县", "code": "320831"}, {
            "id": "1438",
            "name": "亭湖区",
            "code": "320902"
        }, {"id": "1439", "name": "盐都区", "code": "320903"}, {
            "id": "1440",
            "name": "响水县",
            "code": "320921"
        }, {"id": "1441", "name": "滨海县", "code": "320922"}, {
            "id": "1442",
            "name": "阜宁县",
            "code": "320923"
        }, {"id": "1443", "name": "射阳县", "code": "320924"}, {
            "id": "1444",
            "name": "建湖县",
            "code": "320925"
        }, {"id": "1445", "name": "东台市", "code": "320981"}, {"id": "1446", "name": "大丰市", "code": "320982"}]
    }, {
        "id": "188",
        "name": "扬州市",
        "code": "321000",
        "area": [{"id": "1447", "name": "广陵区", "code": "321002"}, {
            "id": "1448",
            "name": "邗江区",
            "code": "321003"
        }, {"id": "1449", "name": "宝应县", "code": "321023"}, {
            "id": "1450",
            "name": "仪征市",
            "code": "321081"
        }, {"id": "1451", "name": "高邮市", "code": "321084"}, {"id": "1452", "name": "江都区", "code": "321088"}]
    }, {
        "id": "189",
        "name": "镇江市",
        "code": "321100",
        "area": [{"id": "1453", "name": "京口区", "code": "321102"}, {
            "id": "1454",
            "name": "润州区",
            "code": "321111"
        }, {"id": "1455", "name": "丹徒区", "code": "321112"}, {
            "id": "1456",
            "name": "丹阳市",
            "code": "321181"
        }, {"id": "1457", "name": "扬中市", "code": "321182"}, {"id": "1458", "name": "句容市", "code": "321183"}]
    }, {
        "id": "190",
        "name": "泰州市",
        "code": "321200",
        "area": [{"id": "1459", "name": "海陵区", "code": "321202"}, {
            "id": "1460",
            "name": "高港区",
            "code": "321203"
        }, {"id": "1461", "name": "兴化市", "code": "321281"}, {
            "id": "1462",
            "name": "靖江市",
            "code": "321282"
        }, {"id": "1463", "name": "泰兴市", "code": "321283"}, {"id": "1464", "name": "姜堰市", "code": "321284"}]
    }, {
        "id": "191",
        "name": "宿迁市",
        "code": "321300",
        "area": [{"id": "1465", "name": "宿城区", "code": "321302"}, {
            "id": "1466",
            "name": "宿豫区",
            "code": "321311"
        }, {"id": "1467", "name": "沭阳县", "code": "321322"}, {
            "id": "1468",
            "name": "泗阳县",
            "code": "321323"
        }, {"id": "1469", "name": "泗洪县", "code": "321324"}]
    }]
}, {
    "id": "11",
    "name": "浙江省",
    "code": "330000",
    "city": [{
        "id": "357",
        "name": "杭州市",
        "code": "330100",
        "area": [{"id": "2792", "name": "上城区", "code": "330102"}, {
            "id": "2793",
            "name": "下城区",
            "code": "330103"
        }, {"id": "2794", "name": "江干区", "code": "330104"}, {
            "id": "2795",
            "name": "拱墅区",
            "code": "330105"
        }, {"id": "2796", "name": "西湖区", "code": "330106"}, {
            "id": "2797",
            "name": "滨江区",
            "code": "330108"
        }, {"id": "2798", "name": "萧山区", "code": "330109"}, {
            "id": "2799",
            "name": "余杭区",
            "code": "330110"
        }, {"id": "2800", "name": "桐庐县", "code": "330122"}, {
            "id": "2801",
            "name": "淳安县",
            "code": "330127"
        }, {"id": "2802", "name": "建德市", "code": "330182"}, {
            "id": "2803",
            "name": "富阳市",
            "code": "330183"
        }, {"id": "2804", "name": "临安市", "code": "330185"}]
    }, {
        "id": "358",
        "name": "宁波市",
        "code": "330200",
        "area": [{"id": "2805", "name": "海曙区", "code": "330203"}, {
            "id": "2806",
            "name": "江东区",
            "code": "330204"
        }, {"id": "2807", "name": "江北区", "code": "330205"}, {
            "id": "2808",
            "name": "北仑区",
            "code": "330206"
        }, {"id": "2809", "name": "镇海区", "code": "330211"}, {
            "id": "2810",
            "name": "鄞州区",
            "code": "330212"
        }, {"id": "2811", "name": "象山县", "code": "330225"}, {
            "id": "2812",
            "name": "宁海县",
            "code": "330226"
        }, {"id": "2813", "name": "余姚市", "code": "330281"}, {
            "id": "2814",
            "name": "慈溪市",
            "code": "330282"
        }, {"id": "2815", "name": "奉化市", "code": "330283"}]
    }, {
        "id": "359",
        "name": "温州市",
        "code": "330300",
        "area": [{"id": "2816", "name": "鹿城区", "code": "330302"}, {
            "id": "2817",
            "name": "龙湾区",
            "code": "330303"
        }, {"id": "2818", "name": "瓯海区", "code": "330304"}, {
            "id": "2819",
            "name": "洞头县",
            "code": "330322"
        }, {"id": "2820", "name": "永嘉县", "code": "330324"}, {
            "id": "2821",
            "name": "平阳县",
            "code": "330326"
        }, {"id": "2822", "name": "苍南县", "code": "330327"}, {
            "id": "2823",
            "name": "文成县",
            "code": "330328"
        }, {"id": "2824", "name": "泰顺县", "code": "330329"}, {
            "id": "2825",
            "name": "瑞安市",
            "code": "330381"
        }, {"id": "2826", "name": "乐清市", "code": "330382"}]
    }, {
        "id": "360",
        "name": "嘉兴市",
        "code": "330400",
        "area": [{"id": "2827", "name": "南湖区", "code": "330402"}, {
            "id": "2828",
            "name": "秀洲区",
            "code": "330411"
        }, {"id": "2829", "name": "嘉善县", "code": "330421"}, {
            "id": "2830",
            "name": "海盐县",
            "code": "330424"
        }, {"id": "2831", "name": "海宁市", "code": "330481"}, {
            "id": "2832",
            "name": "平湖市",
            "code": "330482"
        }, {"id": "2833", "name": "桐乡市", "code": "330483"}]
    }, {
        "id": "361",
        "name": "湖州市",
        "code": "330500",
        "area": [{"id": "2834", "name": "吴兴区", "code": "330502"}, {
            "id": "2835",
            "name": "南浔区",
            "code": "330503"
        }, {"id": "2836", "name": "德清县", "code": "330521"}, {
            "id": "2837",
            "name": "长兴县",
            "code": "330522"
        }, {"id": "2838", "name": "安吉县", "code": "330523"}]
    }, {
        "id": "362",
        "name": "绍兴市",
        "code": "330600",
        "area": [{"id": "2839", "name": "越城区", "code": "330602"}, {
            "id": "2840",
            "name": "柯桥区",
            "code": "330621"
        }, {"id": "2841", "name": "绍兴县", "code": "330621"}, {
            "id": "2842",
            "name": "新昌县",
            "code": "330624"
        }, {"id": "2843", "name": "诸暨市", "code": "330681"}, {
            "id": "2844",
            "name": "上虞市",
            "code": "330682"
        }, {"id": "2845", "name": "嵊州市", "code": "330683"}]
    }, {
        "id": "363",
        "name": "金华市",
        "code": "330700",
        "area": [{"id": "2846", "name": "婺城区", "code": "330702"}, {
            "id": "2847",
            "name": "金东区",
            "code": "330703"
        }, {"id": "2848", "name": "武义县", "code": "330723"}, {
            "id": "2849",
            "name": "浦江县",
            "code": "330726"
        }, {"id": "2850", "name": "磐安县", "code": "330727"}, {
            "id": "2851",
            "name": "兰溪市",
            "code": "330781"
        }, {"id": "2852", "name": "义乌市", "code": "330782"}, {
            "id": "2853",
            "name": "东阳市",
            "code": "330783"
        }, {"id": "2854", "name": "永康市", "code": "330784"}]
    }, {
        "id": "364",
        "name": "衢州市",
        "code": "330800",
        "area": [{"id": "2855", "name": "柯城区", "code": "330802"}, {
            "id": "2856",
            "name": "衢江区",
            "code": "330803"
        }, {"id": "2857", "name": "常山县", "code": "330822"}, {
            "id": "2858",
            "name": "开化县",
            "code": "330824"
        }, {"id": "2859", "name": "龙游县", "code": "330825"}, {"id": "2860", "name": "江山市", "code": "330881"}]
    }, {
        "id": "365",
        "name": "舟山市",
        "code": "330900",
        "area": [{"id": "2861", "name": "定海区", "code": "330902"}, {
            "id": "2862",
            "name": "普陀区",
            "code": "330903"
        }, {"id": "2863", "name": "岱山县", "code": "330921"}, {"id": "2864", "name": "嵊泗县", "code": "330922"}]
    }, {
        "id": "366",
        "name": "台州市",
        "code": "331000",
        "area": [{"id": "2865", "name": "椒江区", "code": "331002"}, {
            "id": "2866",
            "name": "黄岩区",
            "code": "331003"
        }, {"id": "2867", "name": "路桥区", "code": "331004"}, {
            "id": "2868",
            "name": "玉环县",
            "code": "331021"
        }, {"id": "2869", "name": "三门县", "code": "331022"}, {
            "id": "2870",
            "name": "天台县",
            "code": "331023"
        }, {"id": "2871", "name": "仙居县", "code": "331024"}, {
            "id": "2872",
            "name": "温岭市",
            "code": "331081"
        }, {"id": "2873", "name": "临海市", "code": "331082"}]
    }, {
        "id": "367",
        "name": "丽水市",
        "code": "331100",
        "area": [{"id": "2874", "name": "莲都区", "code": "331102"}, {
            "id": "2875",
            "name": "青田县",
            "code": "331121"
        }, {"id": "2876", "name": "缙云县", "code": "331122"}, {
            "id": "2877",
            "name": "遂昌县",
            "code": "331123"
        }, {"id": "2878", "name": "松阳县", "code": "331124"}, {
            "id": "2879",
            "name": "云和县",
            "code": "331125"
        }, {"id": "2880", "name": "庆元县", "code": "331126"}, {
            "id": "2881",
            "name": "景宁畲族自治县",
            "code": "331127"
        }, {"id": "2882", "name": "龙泉县", "code": "331181"}]
    }]
}, {
    "id": "12",
    "name": "安徽省",
    "code": "340000",
    "city": [{
        "id": "2",
        "name": "合肥市",
        "code": "340100",
        "area": [{"id": "1", "name": "瑶海区", "code": "340102"}, {"id": "2", "name": "庐阳区", "code": "340103"}, {
            "id": "3",
            "name": "蜀山区",
            "code": "340104"
        }, {"id": "4", "name": "包河区", "code": "340111"}, {"id": "5", "name": "长丰县", "code": "340121"}, {
            "id": "6",
            "name": "肥东县",
            "code": "340122"
        }, {"id": "7", "name": "肥西县", "code": "340123"}, {"id": "8", "name": "巢湖市", "code": "341400"}, {
            "id": "9",
            "name": "庐江县",
            "code": "341421"
        }]
    }, {
        "id": "3",
        "name": "芜湖市",
        "code": "340200",
        "area": [{"id": "10", "name": "镜湖区", "code": "340202"}, {
            "id": "11",
            "name": "弋江区",
            "code": "340203"
        }, {"id": "12", "name": "鸠江区", "code": "340207"}, {"id": "13", "name": "三山区", "code": "340208"}, {
            "id": "14",
            "name": "芜湖县",
            "code": "340221"
        }, {"id": "15", "name": "繁昌县", "code": "340222"}, {"id": "16", "name": "南陵县", "code": "340223"}, {
            "id": "17",
            "name": "无为县",
            "code": "341422"
        }]
    }, {
        "id": "4",
        "name": "蚌埠市",
        "code": "340300",
        "area": [{"id": "18", "name": "龙子湖区", "code": "340302"}, {
            "id": "19",
            "name": "蚌山区",
            "code": "340303"
        }, {"id": "20", "name": "禹会区", "code": "340304"}, {"id": "21", "name": "淮上区", "code": "340311"}, {
            "id": "22",
            "name": "怀远县",
            "code": "340321"
        }, {"id": "23", "name": "五河县", "code": "340322"}, {"id": "24", "name": "固镇县", "code": "340323"}]
    }, {
        "id": "5",
        "name": "淮南市",
        "code": "340400",
        "area": [{"id": "25", "name": "大通区", "code": "340402"}, {
            "id": "26",
            "name": "田家庵区",
            "code": "340403"
        }, {"id": "27", "name": "谢家集区", "code": "340404"}, {"id": "28", "name": "八公山区", "code": "340405"}, {
            "id": "29",
            "name": "潘集区",
            "code": "340406"
        }, {"id": "30", "name": "凤台县", "code": "340421"}, {"id": "31", "name": "寿县", "code": "340499"}]
    }, {
        "id": "6",
        "name": "马鞍山市",
        "code": "340500",
        "area": [{"id": "32", "name": "花山区", "code": "340503"}, {
            "id": "33",
            "name": "雨山区",
            "code": "340504"
        }, {"id": "34", "name": "博望区", "code": "340506"}, {"id": "35", "name": "当涂县", "code": "340521"}, {
            "id": "36",
            "name": "含山县",
            "code": "341423"
        }, {"id": "37", "name": "和县", "code": "341424"}]
    }, {
        "id": "7",
        "name": "淮北市",
        "code": "340600",
        "area": [{"id": "38", "name": "杜集区", "code": "340602"}, {
            "id": "39",
            "name": "相山区",
            "code": "340603"
        }, {"id": "40", "name": "烈山区", "code": "340604"}, {"id": "41", "name": "濉溪县", "code": "340621"}]
    }, {
        "id": "8",
        "name": "铜陵市",
        "code": "340700",
        "area": [{"id": "42", "name": "狮子山区", "code": "340703"}, {
            "id": "43",
            "name": "铜官山区",
            "code": "340705"
        }, {"id": "44", "name": "郊区", "code": "340711"}, {"id": "45", "name": "义安区", "code": "340721"}, {
            "id": "46",
            "name": "铜陵县",
            "code": "340721"
        }, {"id": "47", "name": "枞阳县", "code": "340799"}]
    }, {
        "id": "9",
        "name": "安庆市",
        "code": "340800",
        "area": [{"id": "48", "name": "迎江区", "code": "340802"}, {
            "id": "49",
            "name": "大观区",
            "code": "340803"
        }, {"id": "50", "name": "宜秀区", "code": "340811"}, {"id": "51", "name": "怀宁县", "code": "340822"}, {
            "id": "52",
            "name": "潜山县",
            "code": "340824"
        }, {"id": "53", "name": "太湖县", "code": "340825"}, {"id": "54", "name": "宿松县", "code": "340826"}, {
            "id": "55",
            "name": "望江县",
            "code": "340827"
        }, {"id": "56", "name": "岳西县", "code": "340828"}, {"id": "57", "name": "桐城市", "code": "340881"}]
    }, {
        "id": "10",
        "name": "黄山市",
        "code": "341000",
        "area": [{"id": "58", "name": "屯溪区", "code": "341002"}, {
            "id": "59",
            "name": "黄山区",
            "code": "341003"
        }, {"id": "60", "name": "徽州区", "code": "341004"}, {"id": "61", "name": "歙县县", "code": "341021"}, {
            "id": "62",
            "name": "休宁县",
            "code": "341022"
        }, {"id": "63", "name": "黟县", "code": "341023"}, {"id": "64", "name": "祁门县", "code": "341024"}]
    }, {
        "id": "11",
        "name": "滁州市",
        "code": "341100",
        "area": [{"id": "65", "name": "琅琊区", "code": "341102"}, {
            "id": "66",
            "name": "南谯区",
            "code": "341103"
        }, {"id": "67", "name": "来安县", "code": "341122"}, {"id": "68", "name": "全椒县", "code": "341124"}, {
            "id": "69",
            "name": "定远县",
            "code": "341125"
        }, {"id": "70", "name": "凤阳县", "code": "341126"}, {"id": "71", "name": "天长市", "code": "341181"}, {
            "id": "72",
            "name": "明光市",
            "code": "341182"
        }]
    }, {
        "id": "12",
        "name": "阜阳市",
        "code": "341200",
        "area": [{"id": "73", "name": "颍州区", "code": "341202"}, {
            "id": "74",
            "name": "颍东区",
            "code": "341203"
        }, {"id": "75", "name": "颍泉区", "code": "341204"}, {"id": "76", "name": "临泉县", "code": "341221"}, {
            "id": "77",
            "name": "太和县",
            "code": "341222"
        }, {"id": "78", "name": "阜南县", "code": "341225"}, {"id": "79", "name": "颍上县", "code": "341226"}, {
            "id": "80",
            "name": "界首市",
            "code": "341282"
        }]
    }, {
        "id": "13",
        "name": "宿州市",
        "code": "341300",
        "area": [{"id": "81", "name": "埇桥区", "code": "341302"}, {
            "id": "82",
            "name": "砀山县",
            "code": "341321"
        }, {"id": "83", "name": "萧县", "code": "341322"}, {"id": "84", "name": "灵璧县", "code": "341323"}, {
            "id": "85",
            "name": "泗县",
            "code": "341324"
        }]
    }, {
        "id": "14",
        "name": "六安市",
        "code": "341500",
        "area": [{"id": "86", "name": "金安区", "code": "341502"}, {
            "id": "87",
            "name": "裕安区",
            "code": "341503"
        }, {"id": "88", "name": "叶集区", "code": "341504"}, {"id": "89", "name": "霍邱县", "code": "341522"}, {
            "id": "90",
            "name": "舒城县",
            "code": "341523"
        }, {"id": "91", "name": "金寨县", "code": "341524"}, {"id": "92", "name": "霍山县", "code": "341525"}]
    }, {
        "id": "15",
        "name": "亳州市",
        "code": "341600",
        "area": [{"id": "93", "name": "谯城区", "code": "341602"}, {
            "id": "94",
            "name": "涡阳县",
            "code": "341621"
        }, {"id": "95", "name": "蒙城县", "code": "341622"}, {"id": "96", "name": "利辛县", "code": "341623"}]
    }, {
        "id": "16",
        "name": "池州市",
        "code": "341700",
        "area": [{"id": "97", "name": "贵池区", "code": "341702"}, {
            "id": "98",
            "name": "东至县",
            "code": "341721"
        }, {"id": "99", "name": "石台县", "code": "341722"}, {"id": "100", "name": "青阳县", "code": "341723"}]
    }, {
        "id": "17",
        "name": "宣城市",
        "code": "341800",
        "area": [{"id": "101", "name": "宣州区", "code": "341802"}, {
            "id": "102",
            "name": "郎溪县",
            "code": "341821"
        }, {"id": "103", "name": "广德县", "code": "341822"}, {"id": "104", "name": "泾县", "code": "341823"}, {
            "id": "105",
            "name": "绩溪县",
            "code": "341824"
        }, {"id": "106", "name": "旌德县", "code": "341825"}, {"id": "107", "name": "宁国市", "code": "341881"}]
    }]
}, {
    "id": "13",
    "name": "福建省",
    "code": "350000",
    "city": [{
        "id": "20",
        "name": "福州市",
        "code": "350100",
        "area": [{"id": "163", "name": "鼓楼区", "code": "350102"}, {
            "id": "164",
            "name": "台江区",
            "code": "350103"
        }, {"id": "165", "name": "仓山区", "code": "350104"}, {"id": "166", "name": "马尾区", "code": "350105"}, {
            "id": "167",
            "name": "晋安区",
            "code": "350111"
        }, {"id": "168", "name": "闽侯县", "code": "350121"}, {"id": "169", "name": "连江县", "code": "350122"}, {
            "id": "170",
            "name": "罗源县",
            "code": "350123"
        }, {"id": "171", "name": "闽清县", "code": "350124"}, {"id": "172", "name": "永泰县", "code": "350125"}, {
            "id": "173",
            "name": "平潭县",
            "code": "350128"
        }, {"id": "174", "name": "福清市", "code": "350181"}, {"id": "175", "name": "长乐市", "code": "350182"}]
    }, {
        "id": "21",
        "name": "厦门市",
        "code": "350200",
        "area": [{"id": "176", "name": "思明区", "code": "350203"}, {
            "id": "177",
            "name": "海沧区",
            "code": "350205"
        }, {"id": "178", "name": "湖里区", "code": "350206"}, {"id": "179", "name": "集美区", "code": "350211"}, {
            "id": "180",
            "name": "同安区",
            "code": "350212"
        }, {"id": "181", "name": "翔安区", "code": "350213"}]
    }, {
        "id": "22",
        "name": "莆田市",
        "code": "350300",
        "area": [{"id": "182", "name": "城厢区", "code": "350302"}, {
            "id": "183",
            "name": "涵江区",
            "code": "350303"
        }, {"id": "184", "name": "荔城区", "code": "350304"}, {"id": "185", "name": "秀屿区", "code": "350305"}, {
            "id": "186",
            "name": "仙游县",
            "code": "350322"
        }]
    }, {
        "id": "23",
        "name": "三明市",
        "code": "350400",
        "area": [{"id": "187", "name": "梅列区", "code": "350402"}, {
            "id": "188",
            "name": "三元区",
            "code": "350403"
        }, {"id": "189", "name": "明溪县", "code": "350421"}, {"id": "190", "name": "清流县", "code": "350423"}, {
            "id": "191",
            "name": "宁化县",
            "code": "350424"
        }, {"id": "192", "name": "大田县", "code": "350425"}, {"id": "193", "name": "尤溪县", "code": "350426"}, {
            "id": "194",
            "name": "沙县",
            "code": "350427"
        }, {"id": "195", "name": "将乐县", "code": "350428"}, {"id": "196", "name": "泰宁县", "code": "350429"}, {
            "id": "197",
            "name": "建宁县",
            "code": "350430"
        }, {"id": "198", "name": "永安市", "code": "350481"}]
    }, {
        "id": "24",
        "name": "泉州市",
        "code": "350500",
        "area": [{"id": "199", "name": "鲤城区", "code": "350502"}, {
            "id": "200",
            "name": "丰泽区",
            "code": "350503"
        }, {"id": "201", "name": "洛江区", "code": "350504"}, {"id": "202", "name": "泉港区", "code": "350505"}, {
            "id": "203",
            "name": "惠安县",
            "code": "350521"
        }, {"id": "204", "name": "安溪县", "code": "350524"}, {"id": "205", "name": "永春县", "code": "350525"}, {
            "id": "206",
            "name": "德化县",
            "code": "350526"
        }, {"id": "207", "name": "金门县", "code": "350527"}, {"id": "208", "name": "石狮市", "code": "350581"}, {
            "id": "209",
            "name": "晋江市",
            "code": "350582"
        }, {"id": "210", "name": "南安市", "code": "350583"}]
    }, {
        "id": "25",
        "name": "漳州市",
        "code": "350600",
        "area": [{"id": "211", "name": "芗城区", "code": "350602"}, {
            "id": "212",
            "name": "龙文区",
            "code": "350603"
        }, {"id": "213", "name": "云霄县", "code": "350622"}, {"id": "214", "name": "漳浦县", "code": "350623"}, {
            "id": "215",
            "name": "诏安县",
            "code": "350624"
        }, {"id": "216", "name": "长泰县", "code": "350625"}, {"id": "217", "name": "东山县", "code": "350626"}, {
            "id": "218",
            "name": "南靖县",
            "code": "350627"
        }, {"id": "219", "name": "平和县", "code": "350628"}, {"id": "220", "name": "华安县", "code": "350629"}, {
            "id": "221",
            "name": "龙海市",
            "code": "350681"
        }]
    }, {
        "id": "26",
        "name": "南平市",
        "code": "350700",
        "area": [{"id": "222", "name": "延平区", "code": "350702"}, {
            "id": "223",
            "name": "顺昌县",
            "code": "350721"
        }, {"id": "224", "name": "浦城县", "code": "350722"}, {"id": "225", "name": "光泽县", "code": "350723"}, {
            "id": "226",
            "name": "松溪县",
            "code": "350724"
        }, {"id": "227", "name": "政和县", "code": "350725"}, {"id": "228", "name": "邵武市", "code": "350781"}, {
            "id": "229",
            "name": "武夷山市",
            "code": "350782"
        }, {"id": "230", "name": "建瓯市", "code": "350783"}, {"id": "231", "name": "建阳市", "code": "350784"}]
    }, {
        "id": "27",
        "name": "龙岩市",
        "code": "350800",
        "area": [{"id": "232", "name": "新罗区", "code": "350802"}, {
            "id": "233",
            "name": "长汀县",
            "code": "350821"
        }, {"id": "234", "name": "永定县", "code": "350822"}, {"id": "235", "name": "上杭县", "code": "350823"}, {
            "id": "236",
            "name": "武平县",
            "code": "350824"
        }, {"id": "237", "name": "连城县", "code": "350825"}, {"id": "238", "name": "漳平市", "code": "350881"}]
    }, {
        "id": "28",
        "name": "宁德市",
        "code": "350900",
        "area": [{"id": "239", "name": "蕉城区", "code": "350902"}, {
            "id": "240",
            "name": "霞浦县",
            "code": "350921"
        }, {"id": "241", "name": "古田县", "code": "350922"}, {"id": "242", "name": "屏南县", "code": "350923"}, {
            "id": "243",
            "name": "寿宁县",
            "code": "350924"
        }, {"id": "244", "name": "周宁县", "code": "350925"}, {"id": "245", "name": "柘荣县", "code": "350926"}, {
            "id": "246",
            "name": "福安市",
            "code": "350981"
        }, {"id": "247", "name": "福鼎市", "code": "350982"}]
    }]
}, {
    "id": "14",
    "name": "江西省",
    "code": "360000",
    "city": [{
        "id": "192",
        "name": "南昌市",
        "code": "360100",
        "area": [{"id": "1470", "name": "东湖区", "code": "360102"}, {
            "id": "1471",
            "name": "西湖区",
            "code": "360103"
        }, {"id": "1472", "name": "青云谱区", "code": "360104"}, {
            "id": "1473",
            "name": "湾里区",
            "code": "360105"
        }, {"id": "1474", "name": "青山湖区", "code": "360111"}, {
            "id": "1475",
            "name": "南昌县",
            "code": "360121"
        }, {"id": "1476", "name": "新建县", "code": "360122"}, {
            "id": "1477",
            "name": "安义县",
            "code": "360123"
        }, {"id": "1478", "name": "进贤县", "code": "360124"}]
    }, {
        "id": "193",
        "name": "景德镇市",
        "code": "360200",
        "area": [{"id": "1479", "name": "昌江区", "code": "360202"}, {
            "id": "1480",
            "name": "珠山区",
            "code": "360203"
        }, {"id": "1481", "name": "浮梁县", "code": "360222"}, {"id": "1482", "name": "乐平市", "code": "360281"}]
    }, {
        "id": "194",
        "name": "萍乡市",
        "code": "360300",
        "area": [{"id": "1483", "name": "安源区", "code": "360302"}, {
            "id": "1484",
            "name": "湘东区",
            "code": "360313"
        }, {"id": "1485", "name": "莲花县", "code": "360321"}, {
            "id": "1486",
            "name": "上栗县",
            "code": "360322"
        }, {"id": "1487", "name": "芦溪县", "code": "360323"}]
    }, {
        "id": "195",
        "name": "九江市",
        "code": "360400",
        "area": [{"id": "1488", "name": "庐山区", "code": "360402"}, {
            "id": "1489",
            "name": "浔阳区",
            "code": "360403"
        }, {"id": "1490", "name": "九江县", "code": "360421"}, {
            "id": "1491",
            "name": "武宁县",
            "code": "360423"
        }, {"id": "1492", "name": "修水县", "code": "360424"}, {
            "id": "1493",
            "name": "永修县",
            "code": "360425"
        }, {"id": "1494", "name": "德安县", "code": "360426"}, {
            "id": "1495",
            "name": "星子县",
            "code": "360427"
        }, {"id": "1496", "name": "都昌县", "code": "360428"}, {
            "id": "1497",
            "name": "湖口县",
            "code": "360429"
        }, {"id": "1498", "name": "彭泽县", "code": "360430"}, {
            "id": "1499",
            "name": "瑞昌市",
            "code": "360481"
        }, {"id": "1500", "name": "共青城市", "code": "360483"}]
    }, {
        "id": "196",
        "name": "新余市",
        "code": "360500",
        "area": [{"id": "1501", "name": "渝水区", "code": "360502"}, {"id": "1502", "name": "分宜县", "code": "360521"}]
    }, {
        "id": "197",
        "name": "鹰潭市",
        "code": "360600",
        "area": [{"id": "1503", "name": "月湖区", "code": "360602"}, {
            "id": "1504",
            "name": "余江县",
            "code": "360622"
        }, {"id": "1505", "name": "贵溪市", "code": "360681"}]
    }, {
        "id": "198",
        "name": "赣州市",
        "code": "360700",
        "area": [{"id": "1506", "name": "章贡区", "code": "360702"}, {
            "id": "1507",
            "name": "赣县",
            "code": "360721"
        }, {"id": "1508", "name": "信丰县", "code": "360722"}, {
            "id": "1509",
            "name": "大余县",
            "code": "360723"
        }, {"id": "1510", "name": "上犹县", "code": "360724"}, {
            "id": "1511",
            "name": "崇义县",
            "code": "360725"
        }, {"id": "1512", "name": "安远县", "code": "360726"}, {
            "id": "1513",
            "name": "龙南县",
            "code": "360727"
        }, {"id": "1514", "name": "定南县", "code": "360728"}, {
            "id": "1515",
            "name": "全南县",
            "code": "360729"
        }, {"id": "1516", "name": "宁都县", "code": "360730"}, {
            "id": "1517",
            "name": "于都县",
            "code": "360731"
        }, {"id": "1518", "name": "兴国县", "code": "360732"}, {
            "id": "1519",
            "name": "会昌县",
            "code": "360733"
        }, {"id": "1520", "name": "寻乌县", "code": "360734"}, {
            "id": "1521",
            "name": "石城县",
            "code": "360735"
        }, {"id": "1522", "name": "瑞金市", "code": "360781"}, {"id": "1523", "name": "南康市", "code": "360782"}]
    }, {
        "id": "199",
        "name": "吉安市",
        "code": "360800",
        "area": [{"id": "1524", "name": "吉州区", "code": "360802"}, {
            "id": "1525",
            "name": "青原区",
            "code": "360803"
        }, {"id": "1526", "name": "吉安县", "code": "360821"}, {
            "id": "1527",
            "name": "吉水县",
            "code": "360822"
        }, {"id": "1528", "name": "峡江县", "code": "360823"}, {
            "id": "1529",
            "name": "新干县",
            "code": "360824"
        }, {"id": "1530", "name": "永丰县", "code": "360825"}, {
            "id": "1531",
            "name": "泰和县",
            "code": "360826"
        }, {"id": "1532", "name": "遂川县", "code": "360827"}, {
            "id": "1533",
            "name": "万安县",
            "code": "360828"
        }, {"id": "1534", "name": "安福县", "code": "360829"}, {
            "id": "1535",
            "name": "永新县",
            "code": "360830"
        }, {"id": "1536", "name": "井冈山市", "code": "360881"}]
    }, {
        "id": "200",
        "name": "宜春市",
        "code": "360900",
        "area": [{"id": "1537", "name": "袁州区", "code": "360902"}, {
            "id": "1538",
            "name": "奉新县",
            "code": "360921"
        }, {"id": "1539", "name": "万载县", "code": "360922"}, {
            "id": "1540",
            "name": "上高县",
            "code": "360923"
        }, {"id": "1541", "name": "宜丰县", "code": "360924"}, {
            "id": "1542",
            "name": "靖安县",
            "code": "360925"
        }, {"id": "1543", "name": "铜鼓县", "code": "360926"}, {
            "id": "1544",
            "name": "丰城市",
            "code": "360981"
        }, {"id": "1545", "name": "樟树市", "code": "360982"}, {"id": "1546", "name": "高安市", "code": "360983"}]
    }, {
        "id": "201",
        "name": "抚州市",
        "code": "361000",
        "area": [{"id": "1547", "name": "临川区", "code": "361002"}, {
            "id": "1548",
            "name": "南城县",
            "code": "361021"
        }, {"id": "1549", "name": "黎川县", "code": "361022"}, {
            "id": "1550",
            "name": "南丰县",
            "code": "361023"
        }, {"id": "1551", "name": "崇仁县", "code": "361024"}, {
            "id": "1552",
            "name": "乐安县",
            "code": "361025"
        }, {"id": "1553", "name": "宜黄县", "code": "361026"}, {
            "id": "1554",
            "name": "金溪县",
            "code": "361027"
        }, {"id": "1555", "name": "资溪县", "code": "361028"}, {
            "id": "1556",
            "name": "东乡县",
            "code": "361029"
        }, {"id": "1557", "name": "广昌县", "code": "361030"}]
    }, {
        "id": "202",
        "name": "上饶市",
        "code": "361100",
        "area": [{"id": "1558", "name": "信州区", "code": "361102"}, {
            "id": "1559",
            "name": "上饶县",
            "code": "361121"
        }, {"id": "1560", "name": "广丰县", "code": "361122"}, {
            "id": "1561",
            "name": "玉山县",
            "code": "361123"
        }, {"id": "1562", "name": "铅山县", "code": "361124"}, {
            "id": "1563",
            "name": "横峰县",
            "code": "361125"
        }, {"id": "1564", "name": "弋阳县", "code": "361126"}, {
            "id": "1565",
            "name": "余干县",
            "code": "361127"
        }, {"id": "1566", "name": "鄱阳县", "code": "361128"}, {
            "id": "1567",
            "name": "万年县",
            "code": "361129"
        }, {"id": "1568", "name": "婺源县", "code": "361130"}, {"id": "1569", "name": "德兴市", "code": "361181"}]
    }]
}, {
    "id": "15",
    "name": "山东省",
    "code": "370000",
    "city": [{
        "id": "251",
        "name": "济南市",
        "code": "370100",
        "area": [{"id": "1897", "name": "历下区", "code": "370102"}, {
            "id": "1898",
            "name": "市中区",
            "code": "370103"
        }, {"id": "1899", "name": "槐荫区", "code": "370104"}, {
            "id": "1900",
            "name": "天桥区",
            "code": "370105"
        }, {"id": "1901", "name": "历城区", "code": "370112"}, {
            "id": "1902",
            "name": "长清区",
            "code": "370113"
        }, {"id": "1903", "name": "平阴县", "code": "370124"}, {
            "id": "1904",
            "name": "济阳县",
            "code": "370125"
        }, {"id": "1905", "name": "商河县", "code": "370126"}, {"id": "1906", "name": "章丘市", "code": "370181"}]
    }, {
        "id": "252",
        "name": "青岛市",
        "code": "370200",
        "area": [{"id": "1907", "name": "市南区", "code": "370202"}, {
            "id": "1908",
            "name": "市北区",
            "code": "370203"
        }, {"id": "1909", "name": "黄岛区", "code": "370211"}, {
            "id": "1910",
            "name": "崂山区",
            "code": "370212"
        }, {"id": "1911", "name": "四方区", "code": "370212"}, {
            "id": "1912",
            "name": "李沧区",
            "code": "370213"
        }, {"id": "1913", "name": "城阳区", "code": "370214"}, {
            "id": "1914",
            "name": "胶州市",
            "code": "370281"
        }, {"id": "1915", "name": "即墨市", "code": "370282"}, {
            "id": "1916",
            "name": "平度市",
            "code": "370283"
        }, {"id": "1917", "name": "莱西市", "code": "370285"}, {"id": "1918", "name": "胶南市", "code": "370285"}]
    }, {
        "id": "253",
        "name": "淄博市",
        "code": "370300",
        "area": [{"id": "1919", "name": "淄川区", "code": "370302"}, {
            "id": "1920",
            "name": "张店区",
            "code": "370303"
        }, {"id": "1921", "name": "博山区", "code": "370304"}, {
            "id": "1922",
            "name": "临淄区",
            "code": "370305"
        }, {"id": "1923", "name": "周村区", "code": "370306"}, {
            "id": "1924",
            "name": "桓台县",
            "code": "370321"
        }, {"id": "1925", "name": "高青县", "code": "370322"}, {"id": "1926", "name": "沂源县", "code": "370323"}]
    }, {
        "id": "254",
        "name": "枣庄市",
        "code": "370400",
        "area": [{"id": "1927", "name": "市中区", "code": "370402"}, {
            "id": "1928",
            "name": "薛城区",
            "code": "370403"
        }, {"id": "1929", "name": "峄城区", "code": "370404"}, {
            "id": "1930",
            "name": "台儿庄区",
            "code": "370405"
        }, {"id": "1931", "name": "山亭区", "code": "370406"}, {"id": "1932", "name": "滕州市", "code": "370481"}]
    }, {
        "id": "255",
        "name": "东营市",
        "code": "370500",
        "area": [{"id": "1933", "name": "东营区", "code": "370502"}, {
            "id": "1934",
            "name": "河口区",
            "code": "370503"
        }, {"id": "1935", "name": "垦利县", "code": "370521"}, {
            "id": "1936",
            "name": "利津县",
            "code": "370522"
        }, {"id": "1937", "name": "广饶县", "code": "370523"}]
    }, {
        "id": "256",
        "name": "烟台市",
        "code": "370600",
        "area": [{"id": "1938", "name": "芝罘区", "code": "370602"}, {
            "id": "1939",
            "name": "福山区",
            "code": "370611"
        }, {"id": "1940", "name": "牟平区", "code": "370612"}, {
            "id": "1941",
            "name": "莱山区",
            "code": "370613"
        }, {"id": "1942", "name": "长岛县", "code": "370634"}, {
            "id": "1943",
            "name": "龙口市",
            "code": "370681"
        }, {"id": "1944", "name": "莱阳市", "code": "370682"}, {
            "id": "1945",
            "name": "莱州市",
            "code": "370683"
        }, {"id": "1946", "name": "蓬莱市", "code": "370684"}, {
            "id": "1947",
            "name": "招远市",
            "code": "370685"
        }, {"id": "1948", "name": "栖霞市", "code": "370686"}, {"id": "1949", "name": "海阳市", "code": "370687"}]
    }, {
        "id": "257",
        "name": "潍坊市",
        "code": "370700",
        "area": [{"id": "1950", "name": "潍城区", "code": "370702"}, {
            "id": "1951",
            "name": "寒亭区",
            "code": "370703"
        }, {"id": "1952", "name": "坊子区", "code": "370704"}, {
            "id": "1953",
            "name": "奎文区",
            "code": "370705"
        }, {"id": "1954", "name": "临朐县", "code": "370724"}, {
            "id": "1955",
            "name": "昌乐县",
            "code": "370725"
        }, {"id": "1956", "name": "青州市", "code": "370781"}, {
            "id": "1957",
            "name": "诸城市",
            "code": "370782"
        }, {"id": "1958", "name": "寿光市", "code": "370783"}, {
            "id": "1959",
            "name": "安丘市",
            "code": "370784"
        }, {"id": "1960", "name": "高密市", "code": "370785"}, {"id": "1961", "name": "昌邑市", "code": "370786"}]
    }, {
        "id": "258",
        "name": "济宁市",
        "code": "370800",
        "area": [{"id": "1962", "name": "市中区", "code": "370802"}, {
            "id": "1963",
            "name": "任城区",
            "code": "370811"
        }, {"id": "1964", "name": "微山区", "code": "370826"}, {
            "id": "1965",
            "name": "鱼台区",
            "code": "370827"
        }, {"id": "1966", "name": "金乡县", "code": "370828"}, {
            "id": "1967",
            "name": "嘉祥县",
            "code": "370829"
        }, {"id": "1968", "name": "汶上县", "code": "370830"}, {
            "id": "1969",
            "name": "泗水县",
            "code": "370831"
        }, {"id": "1970", "name": "梁山县", "code": "370832"}, {
            "id": "1971",
            "name": "曲阜市",
            "code": "370881"
        }, {"id": "1972", "name": "兖州市", "code": "370882"}, {"id": "1973", "name": "邹城市", "code": "370883"}]
    }, {
        "id": "259",
        "name": "泰安市",
        "code": "370900",
        "area": [{"id": "1974", "name": "泰山区", "code": "370902"}, {
            "id": "1975",
            "name": "岱岳区",
            "code": "370903"
        }, {"id": "1976", "name": "宁阳县", "code": "370921"}, {
            "id": "1977",
            "name": "东平县",
            "code": "370923"
        }, {"id": "1978", "name": "新泰市", "code": "370982"}, {"id": "1979", "name": "肥城市", "code": "370983"}]
    }, {
        "id": "260",
        "name": "威海市",
        "code": "371000",
        "area": [{"id": "1980", "name": "环翠去", "code": "371002"}, {
            "id": "1981",
            "name": "文登市",
            "code": "371081"
        }, {"id": "1982", "name": "荣成市", "code": "371082"}, {"id": "1983", "name": "乳山市", "code": "371083"}]
    }, {
        "id": "261",
        "name": "日照市",
        "code": "371100",
        "area": [{"id": "1984", "name": "东港区", "code": "371102"}, {
            "id": "1985",
            "name": "岚山区",
            "code": "371103"
        }, {"id": "1986", "name": "五莲县", "code": "371121"}, {"id": "1987", "name": "莒县", "code": "371122"}]
    }, {
        "id": "262",
        "name": "莱芜市",
        "code": "371200",
        "area": [{"id": "1988", "name": "莱城区", "code": "371202"}, {"id": "1989", "name": "钢城区", "code": "371203"}]
    }, {
        "id": "263",
        "name": "临沂市",
        "code": "371300",
        "area": [{"id": "1990", "name": "兰山区", "code": "371302"}, {
            "id": "1991",
            "name": "罗庄区",
            "code": "371311"
        }, {"id": "1992", "name": "河东区", "code": "371312"}, {
            "id": "1993",
            "name": "沂南县",
            "code": "371321"
        }, {"id": "1994", "name": "郯城县", "code": "371322"}, {
            "id": "1995",
            "name": "沂水县",
            "code": "371323"
        }, {"id": "1996", "name": "兰陵县", "code": "371324"}, {
            "id": "1998",
            "name": "费县",
            "code": "371325"
        }, {"id": "1999", "name": "平邑县", "code": "371326"}, {
            "id": "2000",
            "name": "莒南县",
            "code": "371327"
        }, {"id": "2001", "name": "蒙阴县", "code": "371328"}, {"id": "2002", "name": "临沭县", "code": "371329"}]
    }, {
        "id": "264",
        "name": "德州市",
        "code": "371400",
        "area": [{"id": "2003", "name": "德城区", "code": "371402"}, {
            "id": "2004",
            "name": "陵城县",
            "code": "371421"
        }, {"id": "2005", "name": "宁津县", "code": "371422"}, {
            "id": "2006",
            "name": "庆云县",
            "code": "371423"
        }, {"id": "2007", "name": "临邑县", "code": "371424"}, {
            "id": "2008",
            "name": "齐河县",
            "code": "371425"
        }, {"id": "2009", "name": "平原县", "code": "371426"}, {
            "id": "2010",
            "name": "夏津县",
            "code": "371427"
        }, {"id": "2011", "name": "武城县", "code": "371428"}, {
            "id": "2012",
            "name": "乐陵市",
            "code": "371481"
        }, {"id": "2013", "name": "禹城市", "code": "371482"}]
    }, {
        "id": "265",
        "name": "聊城市",
        "code": "371500",
        "area": [{"id": "2014", "name": "东昌府区", "code": "371502"}, {
            "id": "2015",
            "name": "阳谷县",
            "code": "371521"
        }, {"id": "2016", "name": "莘县", "code": "371522"}, {
            "id": "2017",
            "name": "茌平县",
            "code": "371523"
        }, {"id": "2018", "name": "东阿县", "code": "371524"}, {
            "id": "2019",
            "name": "冠县",
            "code": "371525"
        }, {"id": "2020", "name": "高唐县", "code": "371526"}, {"id": "2021", "name": "临清县", "code": "371581"}]
    }, {
        "id": "266",
        "name": "滨州市",
        "code": "371600",
        "area": [{"id": "2022", "name": "滨城区", "code": "371602"}, {
            "id": "2023",
            "name": "惠民县",
            "code": "371621"
        }, {"id": "2024", "name": "阳信县", "code": "371622"}, {
            "id": "2025",
            "name": "无棣县",
            "code": "371623"
        }, {"id": "2026", "name": "沾化县", "code": "371624"}, {
            "id": "2027",
            "name": "博兴县",
            "code": "371625"
        }, {"id": "2028", "name": "邹平县", "code": "371626"}]
    }, {
        "id": "267",
        "name": "菏泽市",
        "code": "371700",
        "area": [{"id": "2029", "name": "牡丹区", "code": "371702"}, {
            "id": "2030",
            "name": "曹县",
            "code": "371721"
        }, {"id": "2031", "name": "单县", "code": "371722"}, {
            "id": "2032",
            "name": "成武县",
            "code": "371723"
        }, {"id": "2033", "name": "巨野县", "code": "371724"}, {
            "id": "2034",
            "name": "郓城县",
            "code": "371725"
        }, {"id": "2035", "name": "鄄城县", "code": "371726"}, {
            "id": "2036",
            "name": "定陶县",
            "code": "371727"
        }, {"id": "2037", "name": "东明县", "code": "371728"}]
    }]
}, {
    "id": "16",
    "name": "河南省",
    "code": "410000",
    "city": [{
        "id": "130",
        "name": "郑州市",
        "code": "410100",
        "area": [{"id": "983", "name": "中原区", "code": "410102"}, {
            "id": "984",
            "name": "二七区",
            "code": "410103"
        }, {"id": "985", "name": "管城回族区", "code": "410104"}, {
            "id": "986",
            "name": "金水区",
            "code": "410105"
        }, {"id": "987", "name": "上街区", "code": "410106"}, {"id": "988", "name": "惠济区", "code": "410108"}, {
            "id": "989",
            "name": "中牟县",
            "code": "410122"
        }, {"id": "990", "name": "巩义市", "code": "410181"}, {"id": "991", "name": "荥阳市", "code": "410182"}, {
            "id": "992",
            "name": "新密市",
            "code": "410183"
        }, {"id": "993", "name": "新郑市", "code": "410184"}, {"id": "994", "name": "登封市", "code": "410185"}]
    }, {
        "id": "131",
        "name": "开封市",
        "code": "410200",
        "area": [{"id": "995", "name": "龙亭区", "code": "410202"}, {
            "id": "996",
            "name": "顺河回族区",
            "code": "410203"
        }, {"id": "997", "name": "鼓楼区", "code": "410204"}, {
            "id": "998",
            "name": "禹王台区",
            "code": "410205"
        }, {"id": "999", "name": "金明区", "code": "410211"}, {
            "id": "1000",
            "name": "杞县",
            "code": "410221"
        }, {"id": "1001", "name": "通许县", "code": "410222"}, {
            "id": "1002",
            "name": "尉氏县",
            "code": "410223"
        }, {"id": "1003", "name": "祥符县", "code": "410224"}, {"id": "1004", "name": "兰考县", "code": "410225"}]
    }, {
        "id": "132",
        "name": "洛阳市",
        "code": "410300",
        "area": [{"id": "1005", "name": "老城区", "code": "410302"}, {
            "id": "1006",
            "name": "西工区",
            "code": "410303"
        }, {"id": "1007", "name": "瀍河回族区", "code": "410304"}, {
            "id": "1008",
            "name": "涧西区",
            "code": "410305"
        }, {"id": "1009", "name": "吉利区", "code": "410306"}, {
            "id": "1010",
            "name": "洛龙区",
            "code": "410307"
        }, {"id": "1011", "name": "孟津县", "code": "410322"}, {
            "id": "1012",
            "name": "新安县",
            "code": "410323"
        }, {"id": "1013", "name": "栾川县", "code": "410324"}, {
            "id": "1014",
            "name": "嵩县",
            "code": "410325"
        }, {"id": "1015", "name": "汝阳县", "code": "410326"}, {
            "id": "1016",
            "name": "宜阳县",
            "code": "410327"
        }, {"id": "1017", "name": "洛宁县", "code": "410328"}, {
            "id": "1018",
            "name": "伊川县",
            "code": "410329"
        }, {"id": "1019", "name": "偃师市", "code": "410381"}]
    }, {
        "id": "133",
        "name": "平顶山市",
        "code": "410400",
        "area": [{"id": "1020", "name": "新华区", "code": "410402"}, {
            "id": "1021",
            "name": "卫东区",
            "code": "410403"
        }, {"id": "1022", "name": "石龙区", "code": "410404"}, {
            "id": "1023",
            "name": "湛河区",
            "code": "410411"
        }, {"id": "1024", "name": "宝丰县", "code": "410421"}, {
            "id": "1025",
            "name": "叶县",
            "code": "410422"
        }, {"id": "1026", "name": "鲁山县", "code": "410423"}, {
            "id": "1027",
            "name": "郏县",
            "code": "410425"
        }, {"id": "1028", "name": "舞钢市", "code": "410481"}, {"id": "1029", "name": "汝州市", "code": "410482"}]
    }, {
        "id": "134",
        "name": "安阳市",
        "code": "410500",
        "area": [{"id": "1030", "name": "文峰区", "code": "410502"}, {
            "id": "1031",
            "name": "北关区",
            "code": "410503"
        }, {"id": "1032", "name": "殷都区", "code": "410505"}, {
            "id": "1033",
            "name": "龙安区",
            "code": "410506"
        }, {"id": "1034", "name": "安阳县", "code": "410522"}, {
            "id": "1035",
            "name": "汤阴县",
            "code": "410523"
        }, {"id": "1036", "name": "滑县", "code": "410526"}, {
            "id": "1037",
            "name": "内黄县",
            "code": "410527"
        }, {"id": "1038", "name": "林州市", "code": "410581"}]
    }, {
        "id": "135",
        "name": "鹤壁市",
        "code": "410600",
        "area": [{"id": "1039", "name": "鹤山区", "code": "410602"}, {
            "id": "1040",
            "name": "山城区",
            "code": "410603"
        }, {"id": "1041", "name": "淇滨区", "code": "410611"}, {
            "id": "1042",
            "name": "浚县",
            "code": "410621"
        }, {"id": "1043", "name": "淇县", "code": "410622"}]
    }, {
        "id": "136",
        "name": "新乡市",
        "code": "410700",
        "area": [{"id": "1044", "name": "红旗区", "code": "410702"}, {
            "id": "1045",
            "name": "卫滨区",
            "code": "410703"
        }, {"id": "1046", "name": "凤泉区", "code": "410704"}, {
            "id": "1047",
            "name": "牧野区",
            "code": "410711"
        }, {"id": "1048", "name": "新乡县", "code": "410721"}, {
            "id": "1049",
            "name": "获嘉县",
            "code": "410724"
        }, {"id": "1050", "name": "原阳县", "code": "410725"}, {
            "id": "1051",
            "name": "延津县",
            "code": "410726"
        }, {"id": "1052", "name": "封丘县", "code": "410727"}, {
            "id": "1053",
            "name": "长垣县",
            "code": "410728"
        }, {"id": "1054", "name": "卫辉市", "code": "410781"}, {"id": "1055", "name": "辉县市", "code": "410782"}]
    }, {
        "id": "137",
        "name": "焦作市",
        "code": "410800",
        "area": [{"id": "1056", "name": "解放区", "code": "410802"}, {
            "id": "1057",
            "name": "中站区",
            "code": "410803"
        }, {"id": "1058", "name": "马村区", "code": "410804"}, {
            "id": "1059",
            "name": "山阳区",
            "code": "410811"
        }, {"id": "1060", "name": "修武县", "code": "410821"}, {
            "id": "1061",
            "name": "博爱县",
            "code": "410822"
        }, {"id": "1062", "name": "武陟县", "code": "410823"}, {
            "id": "1063",
            "name": "温县",
            "code": "410825"
        }, {"id": "1064", "name": "沁阳市", "code": "410882"}, {"id": "1065", "name": "孟州市", "code": "410883"}]
    }, {
        "id": "138",
        "name": "济源市",
        "code": "410881",
        "area": [{"id": "1066", "name": "济源市", "code": "410881"}]
    }, {
        "id": "139",
        "name": "濮阳市",
        "code": "410900",
        "area": [{"id": "1067", "name": "华龙区", "code": "410902"}, {
            "id": "1068",
            "name": "清丰县",
            "code": "410922"
        }, {"id": "1069", "name": "南乐县", "code": "410923"}, {
            "id": "1070",
            "name": "范县",
            "code": "410926"
        }, {"id": "1071", "name": "台前县", "code": "410927"}, {"id": "1072", "name": "濮阳县", "code": "410928"}]
    }, {
        "id": "140",
        "name": "许昌市",
        "code": "411000",
        "area": [{"id": "1073", "name": "魏都区", "code": "411002"}, {
            "id": "1074",
            "name": "许昌县",
            "code": "411023"
        }, {"id": "1075", "name": "鄢陵县", "code": "411024"}, {
            "id": "1076",
            "name": "襄城县",
            "code": "411025"
        }, {"id": "1077", "name": "禹州市", "code": "411081"}, {"id": "1078", "name": "长葛市", "code": "411082"}]
    }, {
        "id": "141",
        "name": "漯河市",
        "code": "411100",
        "area": [{"id": "1079", "name": "源汇区", "code": "411102"}, {
            "id": "1080",
            "name": "郾城区",
            "code": "411103"
        }, {"id": "1081", "name": "召陵区", "code": "411104"}, {
            "id": "1082",
            "name": "舞阳县",
            "code": "411121"
        }, {"id": "1083", "name": "临颍县", "code": "411122"}]
    }, {
        "id": "142",
        "name": "三门峡市",
        "code": "411200",
        "area": [{"id": "1084", "name": "湖滨区", "code": "411202"}, {
            "id": "1085",
            "name": "渑池县",
            "code": "411221"
        }, {"id": "1086", "name": "陕州区", "code": "411222"}, {
            "id": "1087",
            "name": "卢氏县",
            "code": "411224"
        }, {"id": "1088", "name": "义马市", "code": "411281"}, {"id": "1089", "name": "灵宝市", "code": "411282"}]
    }, {
        "id": "143",
        "name": "南阳市",
        "code": "411300",
        "area": [{"id": "1090", "name": "宛城区", "code": "411302"}, {
            "id": "1091",
            "name": "卧龙区",
            "code": "411303"
        }, {"id": "1092", "name": "南召县", "code": "411321"}, {
            "id": "1093",
            "name": "方城县",
            "code": "411322"
        }, {"id": "1094", "name": "西峡县", "code": "411323"}, {
            "id": "1095",
            "name": "镇平县",
            "code": "411324"
        }, {"id": "1096", "name": "内乡县", "code": "411325"}, {
            "id": "1097",
            "name": "淅川县",
            "code": "411326"
        }, {"id": "1098", "name": "社旗县", "code": "411327"}, {
            "id": "1099",
            "name": "唐河县",
            "code": "411328"
        }, {"id": "1100", "name": "新野县", "code": "411329"}, {
            "id": "1101",
            "name": "桐柏县",
            "code": "411330"
        }, {"id": "1102", "name": "邓州市", "code": "411381"}]
    }, {
        "id": "144",
        "name": "商丘市",
        "code": "411400",
        "area": [{"id": "1103", "name": "梁园区", "code": "411402"}, {
            "id": "1104",
            "name": "睢阳区",
            "code": "411403"
        }, {"id": "1105", "name": "民权县", "code": "411421"}, {
            "id": "1106",
            "name": "睢县",
            "code": "411422"
        }, {"id": "1107", "name": "宁陵县", "code": "411423"}, {
            "id": "1108",
            "name": "柘城县",
            "code": "411424"
        }, {"id": "1109", "name": "虞城县", "code": "411425"}, {
            "id": "1110",
            "name": "夏邑县",
            "code": "411426"
        }, {"id": "1111", "name": "永城市", "code": "411481"}]
    }, {
        "id": "145",
        "name": "信阳市",
        "code": "411500",
        "area": [{"id": "1112", "name": "浉河区", "code": "411502"}, {
            "id": "1113",
            "name": "平桥区",
            "code": ""
        }, {"id": "1114", "name": "罗山县", "code": "411521"}, {
            "id": "1115",
            "name": "光山县",
            "code": "411522"
        }, {"id": "1116", "name": "新县", "code": "411523"}, {
            "id": "1117",
            "name": "商城县",
            "code": "411524"
        }, {"id": "1118", "name": "固始县", "code": "411525"}, {
            "id": "1119",
            "name": "潢川县",
            "code": "411526"
        }, {"id": "1120", "name": "淮滨县", "code": "411527"}, {"id": "1121", "name": "息县", "code": "411528"}]
    }, {
        "id": "146",
        "name": "周口市",
        "code": "411600",
        "area": [{"id": "1122", "name": "川汇区", "code": "411602"}, {
            "id": "1123",
            "name": "扶沟县",
            "code": "411621"
        }, {"id": "1124", "name": "西华县", "code": "411622"}, {
            "id": "1125",
            "name": "商水县",
            "code": "411623"
        }, {"id": "1126", "name": "沈丘县", "code": "411624"}, {
            "id": "1127",
            "name": "郸城县",
            "code": "411625"
        }, {"id": "1128", "name": "淮阳县", "code": "411626"}, {
            "id": "1129",
            "name": "太康县",
            "code": "411627"
        }, {"id": "1130", "name": "鹿邑县", "code": "411628"}, {"id": "1131", "name": "项城市", "code": "411681"}]
    }, {
        "id": "147",
        "name": "驻马店市",
        "code": "411700",
        "area": [{"id": "1132", "name": "驿城区", "code": "411702"}, {
            "id": "1133",
            "name": "西平县",
            "code": "411721"
        }, {"id": "1134", "name": "上蔡县", "code": "411722"}, {
            "id": "1135",
            "name": "平舆县",
            "code": "411723"
        }, {"id": "1136", "name": "正阳县", "code": "411724"}, {
            "id": "1137",
            "name": "确山县",
            "code": "411725"
        }, {"id": "1138", "name": "泌阳县", "code": "411726"}, {
            "id": "1139",
            "name": "汝南县",
            "code": "411727"
        }, {"id": "1140", "name": "遂平县", "code": "411728"}, {"id": "1141", "name": "新蔡县", "code": "411729"}]
    }]
}, {
    "id": "17",
    "name": "湖北省",
    "code": "420000",
    "city": [{
        "id": "148",
        "name": "武汉市",
        "code": "420100",
        "area": [{"id": "1142", "name": "江岸区", "code": "420102"}, {
            "id": "1143",
            "name": "江汉区",
            "code": "420103"
        }, {"id": "1144", "name": "硚口区", "code": "420104"}, {
            "id": "1145",
            "name": "汉阳区",
            "code": "420105"
        }, {"id": "1146", "name": "武昌区", "code": "420106"}, {
            "id": "1147",
            "name": "青山区",
            "code": "420107"
        }, {"id": "1148", "name": "洪山区", "code": "420111"}, {
            "id": "1149",
            "name": "东西湖区",
            "code": "420112"
        }, {"id": "1150", "name": "汉南区", "code": "420113"}, {
            "id": "1151",
            "name": "蔡甸区",
            "code": "420114"
        }, {"id": "1152", "name": "江夏区", "code": "420115"}, {
            "id": "1153",
            "name": "黄陂区",
            "code": "420116"
        }, {"id": "1154", "name": "新洲区", "code": "420117"}]
    }, {
        "id": "149",
        "name": "黄石市",
        "code": "420200",
        "area": [{"id": "1155", "name": "黄石港区", "code": "420202"}, {
            "id": "1156",
            "name": "西塞山区",
            "code": "420203"
        }, {"id": "1157", "name": "下陆区", "code": "420204"}, {
            "id": "1158",
            "name": "铁山区",
            "code": "420205"
        }, {"id": "1159", "name": "阳新县", "code": "420222"}, {"id": "1160", "name": "大冶市", "code": "420281"}]
    }, {
        "id": "150",
        "name": "十堰市",
        "code": "420300",
        "area": [{"id": "1161", "name": "茅箭区", "code": "420302"}, {
            "id": "1162",
            "name": "张湾区",
            "code": "420303"
        }, {"id": "1163", "name": "郧阳区", "code": "420321"}, {
            "id": "1164",
            "name": "郧西县",
            "code": "420322"
        }, {"id": "1165", "name": "竹山县", "code": "420323"}, {
            "id": "1166",
            "name": "竹溪县",
            "code": "420324"
        }, {"id": "1167", "name": "房县", "code": "420325"}, {"id": "1168", "name": "丹江口市", "code": "420381"}]
    }, {
        "id": "151",
        "name": "宜昌市",
        "code": "420500",
        "area": [{"id": "1169", "name": "西陵区", "code": "420502"}, {
            "id": "1170",
            "name": "伍家岗区",
            "code": "420503"
        }, {"id": "1171", "name": "点军区", "code": "420504"}, {
            "id": "1172",
            "name": "猇亭区",
            "code": "420505"
        }, {"id": "1173", "name": "夷陵区", "code": "420506"}, {
            "id": "1174",
            "name": "远安县",
            "code": "420525"
        }, {"id": "1175", "name": "兴山县", "code": "420526"}, {
            "id": "1176",
            "name": "秭归县",
            "code": "420527"
        }, {"id": "1177", "name": "长阳土家族自治县", "code": "420528"}, {
            "id": "1178",
            "name": "五峰土家族自治县",
            "code": "420529"
        }, {"id": "1179", "name": "宜都市", "code": "420581"}, {
            "id": "1180",
            "name": "当阳市",
            "code": "420582"
        }, {"id": "1181", "name": "枝江市", "code": "420583"}]
    }, {
        "id": "152",
        "name": "襄阳市",
        "code": "420600",
        "area": [{"id": "1182", "name": "襄城区", "code": "420602"}, {
            "id": "1183",
            "name": "樊城区",
            "code": "420606"
        }, {"id": "1184", "name": "襄州区", "code": "420607"}, {
            "id": "1185",
            "name": "南漳县",
            "code": "420624"
        }, {"id": "1186", "name": "谷城县", "code": "420625"}, {
            "id": "1187",
            "name": "保康县",
            "code": "420626"
        }, {"id": "1188", "name": "老河口市", "code": "420682"}, {
            "id": "1189",
            "name": "枣阳市",
            "code": "420683"
        }, {"id": "1190", "name": "宜城市", "code": "420684"}]
    }, {
        "id": "153",
        "name": "鄂州市",
        "code": "420700",
        "area": [{"id": "1191", "name": "梁子湖区", "code": "420702"}, {
            "id": "1192",
            "name": "华容区",
            "code": "420703"
        }, {"id": "1193", "name": "鄂城区", "code": "420704"}]
    }, {
        "id": "154",
        "name": "荆门市",
        "code": "420800",
        "area": [{"id": "1194", "name": "东宝区", "code": "420802"}, {
            "id": "1195",
            "name": "掇刀区",
            "code": "420804"
        }, {"id": "1196", "name": "京山县", "code": "420821"}, {
            "id": "1197",
            "name": "沙洋县",
            "code": "420822"
        }, {"id": "1198", "name": "钟祥市", "code": "420881"}]
    }, {
        "id": "155",
        "name": "孝感市",
        "code": "420900",
        "area": [{"id": "1199", "name": "孝南区", "code": "420902"}, {
            "id": "1200",
            "name": "孝昌县",
            "code": "420921"
        }, {"id": "1201", "name": "大悟县", "code": "420922"}, {
            "id": "1202",
            "name": "云梦县",
            "code": "420923"
        }, {"id": "1203", "name": "应城市", "code": "420981"}, {
            "id": "1204",
            "name": "安陆市",
            "code": "420982"
        }, {"id": "1205", "name": "汉川市", "code": "420984"}]
    }, {
        "id": "156",
        "name": "荆州市",
        "code": "421000",
        "area": [{"id": "1206", "name": "沙市区", "code": "421002"}, {
            "id": "1207",
            "name": "荆州区",
            "code": "421003"
        }, {"id": "1208", "name": "公安县", "code": "421022"}, {
            "id": "1209",
            "name": "监利县",
            "code": "421023"
        }, {"id": "1210", "name": "江陵县", "code": "421024"}, {
            "id": "1211",
            "name": "石首市",
            "code": "421081"
        }, {"id": "1212", "name": "洪湖市", "code": "421083"}, {"id": "1213", "name": "松滋市", "code": "421087"}]
    }, {
        "id": "157",
        "name": "黄冈市",
        "code": "421100",
        "area": [{"id": "1214", "name": "黄州区", "code": "421102"}, {
            "id": "1215",
            "name": "团风县",
            "code": "421121"
        }, {"id": "1216", "name": "红安县", "code": "421122"}, {
            "id": "1217",
            "name": "罗田县",
            "code": "421123"
        }, {"id": "1218", "name": "英山县", "code": "421124"}, {
            "id": "1219",
            "name": "浠水县",
            "code": "421125"
        }, {"id": "1220", "name": "蕲春县", "code": "421126"}, {
            "id": "1221",
            "name": "黄梅县",
            "code": "421127"
        }, {"id": "1222", "name": "麻城市", "code": "421181"}, {"id": "1223", "name": "武穴市", "code": "421182"}]
    }, {
        "id": "158",
        "name": "咸宁市",
        "code": "421200",
        "area": [{"id": "1224", "name": "咸安区", "code": "421202"}, {
            "id": "1225",
            "name": "嘉鱼县",
            "code": "421221"
        }, {"id": "1226", "name": "通城县", "code": "421222"}, {
            "id": "1227",
            "name": "崇阳县",
            "code": "421223"
        }, {"id": "1228", "name": "通山县", "code": "421224"}, {"id": "1229", "name": "赤壁市", "code": "421281"}]
    }, {
        "id": "159",
        "name": "随州市",
        "code": "421300",
        "area": [{"id": "1230", "name": "曾都区", "code": "421302"}, {
            "id": "1231",
            "name": "随县",
            "code": "421321"
        }, {"id": "1232", "name": "广水市", "code": "421381"}]
    }, {
        "id": "160",
        "name": "恩施土家苗族自治州",
        "code": "422800",
        "area": [{"id": "1233", "name": "恩施市", "code": "422801"}, {
            "id": "1234",
            "name": "利川市",
            "code": "422802"
        }, {"id": "1235", "name": "建始县", "code": "422822"}, {
            "id": "1236",
            "name": "巴东县",
            "code": "422823"
        }, {"id": "1237", "name": "宣恩县", "code": "422825"}, {
            "id": "1238",
            "name": "咸丰县",
            "code": "422826"
        }, {"id": "1239", "name": "来凤县", "code": "422827"}, {"id": "1240", "name": "鹤峰县", "code": "422828"}]
    }, {
        "id": "161",
        "name": "仙桃市",
        "code": "429004",
        "area": [{"id": "1241", "name": "仙桃市", "code": "429004"}]
    }, {
        "id": "162",
        "name": "潜江市",
        "code": "429005",
        "area": [{"id": "1242", "name": "潜江市", "code": "429005"}]
    }, {
        "id": "163",
        "name": "天门市",
        "code": "429006",
        "area": [{"id": "1243", "name": "天门市", "code": "429006"}]
    }, {"id": "164", "name": "神农架林区", "code": "429021", "area": [{"id": "1244", "name": "神农架林区", "code": "429021"}]}]
}, {
    "id": "18",
    "name": "湖南省",
    "code": "430000",
    "city": [{
        "id": "165",
        "name": "长沙市",
        "code": "430100",
        "area": [{"id": "1245", "name": "芙蓉区", "code": "430102"}, {
            "id": "1246",
            "name": "天心区",
            "code": "430103"
        }, {"id": "1247", "name": "岳麓区", "code": "430104"}, {
            "id": "1248",
            "name": "开福区",
            "code": "430105"
        }, {"id": "1249", "name": "雨花区", "code": "430111"}, {
            "id": "1250",
            "name": "长沙县",
            "code": "430121"
        }, {"id": "1251", "name": "望城区", "code": "430122"}, {
            "id": "1252",
            "name": "宁乡县",
            "code": "430124"
        }, {"id": "1253", "name": "浏阳市", "code": "430181"}]
    }, {
        "id": "166",
        "name": "株洲市",
        "code": "430200",
        "area": [{"id": "1254", "name": "荷塘区", "code": "430202"}, {
            "id": "1255",
            "name": "芦淞区",
            "code": "430203"
        }, {"id": "1256", "name": "石峰区", "code": "430204"}, {
            "id": "1257",
            "name": "天元区",
            "code": "430211"
        }, {"id": "1258", "name": "株洲县", "code": "430221"}, {
            "id": "1259",
            "name": "攸县",
            "code": "430223"
        }, {"id": "1260", "name": "茶陵县", "code": "430224"}, {
            "id": "1261",
            "name": "炎陵县",
            "code": "430225"
        }, {"id": "1262", "name": "醴陵市", "code": "430281"}]
    }, {
        "id": "167",
        "name": "湘潭市",
        "code": "430300",
        "area": [{"id": "1263", "name": "雨湖区", "code": "430302"}, {
            "id": "1264",
            "name": "岳塘区",
            "code": "430304"
        }, {"id": "1265", "name": "湘潭县", "code": "430321"}, {
            "id": "1266",
            "name": "湘乡市",
            "code": "430381"
        }, {"id": "1267", "name": "韶山市", "code": "430382"}]
    }, {
        "id": "168",
        "name": "衡阳市",
        "code": "430400",
        "area": [{"id": "1268", "name": "珠晖区", "code": "430405"}, {
            "id": "1269",
            "name": "雁峰区",
            "code": "430406"
        }, {"id": "1270", "name": "石鼓区", "code": "430407"}, {
            "id": "1271",
            "name": "蒸湘区",
            "code": "430408"
        }, {"id": "1272", "name": "南岳区", "code": "430412"}, {
            "id": "1273",
            "name": "衡阳县",
            "code": "430421"
        }, {"id": "1274", "name": "衡南县", "code": "430422"}, {
            "id": "1275",
            "name": "衡山县",
            "code": "430423"
        }, {"id": "1276", "name": "衡东县", "code": "430424"}, {
            "id": "1277",
            "name": "祁东县",
            "code": "430426"
        }, {"id": "1278", "name": "耒阳市", "code": "430481"}, {"id": "1279", "name": "常宁市", "code": "430482"}]
    }, {
        "id": "169",
        "name": "邵阳市",
        "code": "430500",
        "area": [{"id": "1280", "name": "双清区", "code": "430502"}, {
            "id": "1281",
            "name": "大祥区",
            "code": "430503"
        }, {"id": "1282", "name": "北塔区", "code": "430511"}, {
            "id": "1283",
            "name": "邵东县",
            "code": "430521"
        }, {"id": "1284", "name": "新邵县", "code": "430522"}, {
            "id": "1285",
            "name": "邵阳县",
            "code": "430523"
        }, {"id": "1286", "name": "隆回县", "code": "430524"}, {
            "id": "1287",
            "name": "洞口县",
            "code": "430525"
        }, {"id": "1288", "name": "绥宁县", "code": "430527"}, {
            "id": "1289",
            "name": "新宁县",
            "code": "430528"
        }, {"id": "1290", "name": "城步苗族自治县", "code": "430529"}, {"id": "1291", "name": "武冈市", "code": "430581"}]
    }, {
        "id": "170",
        "name": "岳阳市",
        "code": "430600",
        "area": [{"id": "1292", "name": "岳阳楼区", "code": "430602"}, {
            "id": "1293",
            "name": "云溪区",
            "code": "430603"
        }, {"id": "1294", "name": "君山区", "code": "430611"}, {
            "id": "1295",
            "name": "岳阳县",
            "code": "430621"
        }, {"id": "1296", "name": "华容县", "code": "430623"}, {
            "id": "1297",
            "name": "湘阴县",
            "code": "430624"
        }, {"id": "1298", "name": "平江县", "code": "430626"}, {
            "id": "1299",
            "name": "汨罗市",
            "code": "430681"
        }, {"id": "1300", "name": "临湘市", "code": "430682"}]
    }, {
        "id": "171",
        "name": "常德市",
        "code": "430700",
        "area": [{"id": "1301", "name": "武陵区", "code": "430702"}, {
            "id": "1302",
            "name": "鼎城区",
            "code": "430703"
        }, {"id": "1303", "name": "安乡县", "code": "430721"}, {
            "id": "1304",
            "name": "汉寿县",
            "code": "430722"
        }, {"id": "1305", "name": "澧县", "code": "430723"}, {
            "id": "1306",
            "name": "临澧县",
            "code": "430724"
        }, {"id": "1307", "name": "桃源县", "code": "430725"}, {
            "id": "1308",
            "name": "石门县",
            "code": "430726"
        }, {"id": "1309", "name": "津市市", "code": "430781"}]
    }, {
        "id": "172",
        "name": "张家界市",
        "code": "430800",
        "area": [{"id": "1310", "name": "永定区", "code": "430802"}, {
            "id": "1311",
            "name": "武陵源区",
            "code": "430811"
        }, {"id": "1312", "name": "慈利县", "code": "430821"}, {"id": "1313", "name": "桑植县", "code": "430822"}]
    }, {
        "id": "173",
        "name": "益阳市",
        "code": "430900",
        "area": [{"id": "1314", "name": "资阳区", "code": "430902"}, {
            "id": "1315",
            "name": "赫山区",
            "code": "430903"
        }, {"id": "1316", "name": "南县", "code": "430921"}, {
            "id": "1317",
            "name": "桃江县",
            "code": "430922"
        }, {"id": "1318", "name": "安化县", "code": "430923"}, {"id": "1319", "name": "沅江市", "code": "430981"}]
    }, {
        "id": "174",
        "name": "郴州市",
        "code": "431000",
        "area": [{"id": "1320", "name": "北湖区", "code": "431002"}, {
            "id": "1321",
            "name": "苏仙区",
            "code": "431003"
        }, {"id": "1322", "name": "桂阳县", "code": "431021"}, {
            "id": "1323",
            "name": "宜章县",
            "code": "431022"
        }, {"id": "1324", "name": "永兴县", "code": "431023"}, {
            "id": "1325",
            "name": "嘉禾县",
            "code": "431024"
        }, {"id": "1326", "name": "临武县", "code": "431025"}, {
            "id": "1327",
            "name": "汝城县",
            "code": "431026"
        }, {"id": "1328", "name": "桂东县", "code": "431027"}, {
            "id": "1329",
            "name": "安仁县",
            "code": "431028"
        }, {"id": "1330", "name": "资兴市", "code": "431081"}]
    }, {
        "id": "175",
        "name": "永州市",
        "code": "431100",
        "area": [{"id": "1331", "name": "零陵区", "code": "431102"}, {
            "id": "1332",
            "name": "冷水滩区",
            "code": "431103"
        }, {"id": "1333", "name": "祁阳县", "code": "431121"}, {
            "id": "1334",
            "name": "东安县",
            "code": "431122"
        }, {"id": "1335", "name": "双牌县", "code": "431123"}, {
            "id": "1336",
            "name": "道县",
            "code": "431124"
        }, {"id": "1337", "name": "江永县", "code": "431125"}, {
            "id": "1338",
            "name": "宁远县",
            "code": "431126"
        }, {"id": "1339", "name": "蓝山县", "code": "431127"}, {
            "id": "1340",
            "name": "新田县",
            "code": "431128"
        }, {"id": "1341", "name": "江华瑶族自治县", "code": "431129"}]
    }, {
        "id": "176",
        "name": "怀化市",
        "code": "431200",
        "area": [{"id": "1342", "name": "鹤城区", "code": "431202"}, {
            "id": "1343",
            "name": "中方县",
            "code": "431221"
        }, {"id": "1344", "name": "沅陵县", "code": "431222"}, {
            "id": "1345",
            "name": "辰溪县",
            "code": "431223"
        }, {"id": "1346", "name": "溆浦县", "code": "431224"}, {
            "id": "1347",
            "name": "会同县",
            "code": "431225"
        }, {"id": "1348", "name": "麻阳苗族自治县", "code": "431226"}, {
            "id": "1349",
            "name": "新晃侗族自治县",
            "code": "431227"
        }, {"id": "1350", "name": "芷江侗族自治县", "code": "431228"}, {
            "id": "1351",
            "name": "靖州侗族苗族自治县",
            "code": "431229"
        }, {"id": "1352", "name": "通道侗族自治县", "code": "431230"}, {"id": "1353", "name": "洪江市", "code": "431281"}]
    }, {
        "id": "177",
        "name": "娄底市",
        "code": "431300",
        "area": [{"id": "1354", "name": "娄星区", "code": "431302"}, {
            "id": "1355",
            "name": "双峰县",
            "code": "431321"
        }, {"id": "1356", "name": "新化县", "code": "431322"}, {
            "id": "1357",
            "name": "冷水江市",
            "code": "431381"
        }, {"id": "1358", "name": "涟源市", "code": "431382"}]
    }, {
        "id": "178",
        "name": "湘西土家苗族自治州",
        "code": "433100",
        "area": [{"id": "1359", "name": "吉首市", "code": "433101"}, {
            "id": "1360",
            "name": "泸溪县",
            "code": "433122"
        }, {"id": "1361", "name": "凤凰县", "code": "433123"}, {
            "id": "1362",
            "name": "花垣县",
            "code": "433124"
        }, {"id": "1363", "name": "保靖县", "code": "433125"}, {
            "id": "1364",
            "name": "古丈县",
            "code": "433126"
        }, {"id": "1365", "name": "永顺县", "code": "433127"}, {"id": "1366", "name": "龙山县", "code": "433130"}]
    }]
}, {
    "id": "19",
    "name": "广东省",
    "code": "440000",
    "city": [{
        "id": "43",
        "name": "广州市",
        "code": "440100",
        "area": [{"id": "335", "name": "荔湾区", "code": "440103"}, {
            "id": "336",
            "name": "越秀区",
            "code": "440104"
        }, {"id": "337", "name": "海珠区", "code": "440105"}, {"id": "338", "name": "天河区", "code": "440106"}, {
            "id": "339",
            "name": "白云区",
            "code": "440111"
        }, {"id": "340", "name": "黄埔区", "code": "440112"}, {"id": "341", "name": "番禺区", "code": "440113"}, {
            "id": "342",
            "name": "花都区",
            "code": "440114"
        }, {"id": "343", "name": "南沙区", "code": "440115"}, {"id": "344", "name": "萝岗区", "code": "440116"}, {
            "id": "345",
            "name": "增城市",
            "code": "440183"
        }, {"id": "346", "name": "从化市", "code": "440184"}]
    }, {
        "id": "44",
        "name": "韶关市",
        "code": "440200",
        "area": [{"id": "347", "name": "武江区", "code": "440203"}, {
            "id": "348",
            "name": "浈江区",
            "code": "440204"
        }, {"id": "349", "name": "曲江区", "code": "440205"}, {"id": "350", "name": "始兴县", "code": "440222"}, {
            "id": "351",
            "name": "仁化县",
            "code": "440224"
        }, {"id": "352", "name": "翁源县", "code": "440229"}, {
            "id": "353",
            "name": "乳源瑶族自治县",
            "code": "440232"
        }, {"id": "354", "name": "新丰县", "code": "440233"}, {"id": "355", "name": "乐昌县", "code": "440281"}, {
            "id": "356",
            "name": "南雄市",
            "code": "440282"
        }]
    }, {
        "id": "45",
        "name": "深圳市",
        "code": "440300",
        "area": [{"id": "357", "name": "罗湖区", "code": "440303"}, {
            "id": "358",
            "name": "福田区",
            "code": "440304"
        }, {"id": "359", "name": "南山区", "code": "440305"}, {"id": "360", "name": "宝安区", "code": "440306"}, {
            "id": "361",
            "name": "龙岗区",
            "code": "440307"
        }, {"id": "362", "name": "盐田区", "code": "440308"}]
    }, {
        "id": "46",
        "name": "珠海市",
        "code": "440400",
        "area": [{"id": "363", "name": "香洲区", "code": "440402"}, {
            "id": "364",
            "name": "斗门区",
            "code": "440403"
        }, {"id": "365", "name": "金湾区", "code": "440404"}]
    }, {
        "id": "47",
        "name": "汕头市",
        "code": "440500",
        "area": [{"id": "366", "name": "龙湖区", "code": "440507"}, {
            "id": "367",
            "name": "金平区",
            "code": "440511"
        }, {"id": "368", "name": "濠江区", "code": "440512"}, {"id": "369", "name": "潮阳区", "code": "440513"}, {
            "id": "370",
            "name": "潮南区",
            "code": "440514"
        }, {"id": "371", "name": "澄海区", "code": "440515"}, {"id": "372", "name": "南澳县", "code": "440523"}]
    }, {
        "id": "48",
        "name": "佛山市",
        "code": "440600",
        "area": [{"id": "373", "name": "禅城区", "code": "440604"}, {
            "id": "374",
            "name": "南海区",
            "code": "440605"
        }, {"id": "375", "name": "顺德区", "code": "440606"}, {"id": "376", "name": "三水区", "code": "440607"}, {
            "id": "377",
            "name": "高明区",
            "code": "440608"
        }]
    }, {
        "id": "49",
        "name": "江门市",
        "code": "440700",
        "area": [{"id": "378", "name": "蓬江区", "code": "440703"}, {
            "id": "379",
            "name": "江海区",
            "code": "440704"
        }, {"id": "380", "name": "新会区", "code": "440705"}, {"id": "381", "name": "台山市", "code": "440781"}, {
            "id": "382",
            "name": "开平市",
            "code": "440783"
        }, {"id": "383", "name": "鹤山市", "code": "440784"}, {"id": "384", "name": "恩平市", "code": "440785"}]
    }, {
        "id": "50",
        "name": "湛江市",
        "code": "440800",
        "area": [{"id": "385", "name": "赤坎区", "code": "440802"}, {
            "id": "386",
            "name": "霞山区",
            "code": "440803"
        }, {"id": "387", "name": "坡头区", "code": "440804"}, {"id": "388", "name": "麻章区", "code": "440811"}, {
            "id": "389",
            "name": "遂溪县",
            "code": "440823"
        }, {"id": "390", "name": "徐闻县", "code": "440825"}, {"id": "391", "name": "廉江市", "code": "440881"}, {
            "id": "392",
            "name": "雷州市",
            "code": "440882"
        }, {"id": "393", "name": "吴川市", "code": "440883"}]
    }, {
        "id": "51",
        "name": "茂名市",
        "code": "440900",
        "area": [{"id": "394", "name": "茂南区", "code": "440902"}, {
            "id": "395",
            "name": "茂港区",
            "code": "440903"
        }, {"id": "396", "name": "电白县", "code": "440903"}, {"id": "397", "name": "高州市", "code": "440981"}, {
            "id": "398",
            "name": "化州市",
            "code": "440982"
        }, {"id": "399", "name": "信宜市", "code": "440983"}]
    }, {
        "id": "52",
        "name": "肇庆市",
        "code": "441200",
        "area": [{"id": "400", "name": "端州区", "code": "441202"}, {
            "id": "401",
            "name": "鼎湖区",
            "code": "441203"
        }, {"id": "402", "name": "广宁县", "code": "441223"}, {"id": "403", "name": "怀集县", "code": "441224"}, {
            "id": "404",
            "name": "封开县",
            "code": "441225"
        }, {"id": "405", "name": "德庆县", "code": "441226"}, {"id": "406", "name": "高要市", "code": "441283"}, {
            "id": "407",
            "name": "四会市",
            "code": "441284"
        }]
    }, {
        "id": "53",
        "name": "惠州市",
        "code": "441300",
        "area": [{"id": "408", "name": "惠城区", "code": "441302"}, {
            "id": "409",
            "name": "惠阳区",
            "code": "441303"
        }, {"id": "410", "name": "博罗县", "code": "441322"}, {"id": "411", "name": "惠东县", "code": "441323"}, {
            "id": "412",
            "name": "龙门县",
            "code": "441324"
        }]
    }, {
        "id": "54",
        "name": "梅州市",
        "code": "441400",
        "area": [{"id": "413", "name": "梅江区", "code": "441402"}, {
            "id": "414",
            "name": "梅县",
            "code": "441421"
        }, {"id": "415", "name": "大埔县", "code": "441422"}, {"id": "416", "name": "丰顺县", "code": "441423"}, {
            "id": "417",
            "name": "五华县",
            "code": "441424"
        }, {"id": "418", "name": "平远县", "code": "441426"}, {"id": "419", "name": "蕉岭县", "code": "441427"}, {
            "id": "420",
            "name": "兴宁市",
            "code": "441481"
        }]
    }, {
        "id": "55",
        "name": "汕尾市",
        "code": "441500",
        "area": [{"id": "421", "name": "城区", "code": "441502"}, {
            "id": "422",
            "name": "海丰县",
            "code": "441521"
        }, {"id": "423", "name": "陆河县", "code": "441523"}, {"id": "424", "name": "陆丰市", "code": "441581"}]
    }, {
        "id": "56",
        "name": "河源市",
        "code": "441600",
        "area": [{"id": "425", "name": "源城区", "code": "441602"}, {
            "id": "426",
            "name": "紫金县",
            "code": "441621"
        }, {"id": "427", "name": "龙川县", "code": "441622"}, {"id": "428", "name": "连平县", "code": "441623"}, {
            "id": "429",
            "name": "和平县",
            "code": "441624"
        }, {"id": "430", "name": "东源县", "code": "441625"}]
    }, {
        "id": "57",
        "name": "阳江市",
        "code": "441700",
        "area": [{"id": "431", "name": "江城区", "code": "441702"}, {
            "id": "432",
            "name": "阳西县",
            "code": "441721"
        }, {"id": "433", "name": "阳东县", "code": "441723"}, {"id": "434", "name": "阳春市", "code": "441781"}]
    }, {
        "id": "58",
        "name": "清远市",
        "code": "441800",
        "area": [{"id": "435", "name": "清城区", "code": "441802"}, {
            "id": "436",
            "name": "佛冈县",
            "code": "441821"
        }, {"id": "437", "name": "阳山县", "code": "441823"}, {
            "id": "438",
            "name": "连山壮族瑶族自治县",
            "code": "441825"
        }, {"id": "439", "name": "连南瑶族自治县", "code": "441826"}, {
            "id": "440",
            "name": "清新县",
            "code": "441827"
        }, {"id": "441", "name": "英德县", "code": "441881"}, {"id": "442", "name": "连州县", "code": "441882"}]
    }, {
        "id": "59",
        "name": "东莞市",
        "code": "441900",
        "area": [{"id": "443", "name": "东莞市", "code": "441900"}]
    }, {
        "id": "60",
        "name": "中山市",
        "code": "442000",
        "area": [{"id": "444", "name": "中山市", "code": "442000"}]
    }, {
        "id": "61",
        "name": "潮州市",
        "code": "445100",
        "area": [{"id": "445", "name": "湘桥区", "code": "445102"}, {
            "id": "446",
            "name": "潮安县",
            "code": "445121"
        }, {"id": "447", "name": "饶平县", "code": "445122"}]
    }, {
        "id": "62",
        "name": "揭阳市",
        "code": "445200",
        "area": [{"id": "448", "name": "榕城区", "code": "445202"}, {
            "id": "449",
            "name": "揭东县",
            "code": "445221"
        }, {"id": "450", "name": "揭西县", "code": "445222"}, {"id": "451", "name": "惠来县", "code": "445224"}, {
            "id": "452",
            "name": "普宁市",
            "code": "445281"
        }]
    }, {
        "id": "63",
        "name": "云浮市",
        "code": "445300",
        "area": [{"id": "453", "name": "云城区", "code": "445302"}, {
            "id": "454",
            "name": "新兴县",
            "code": "445321"
        }, {"id": "455", "name": "郁南县", "code": "445322"}, {"id": "456", "name": "云安县", "code": "445323"}, {
            "id": "457",
            "name": "罗定市",
            "code": "445381"
        }]
    }]
}, {
    "id": "20",
    "name": "广西壮族自治区",
    "code": "450000",
    "city": [{
        "id": "64",
        "name": "南宁市",
        "code": "450100",
        "area": [{"id": "458", "name": "兴宁区", "code": "450102"}, {
            "id": "459",
            "name": "青秀区",
            "code": "450103"
        }, {"id": "460", "name": "江南区", "code": "450105"}, {
            "id": "461",
            "name": "西乡塘区",
            "code": "450107"
        }, {"id": "462", "name": "良庆区", "code": "450108"}, {"id": "463", "name": "邕宁区", "code": "450109"}, {
            "id": "464",
            "name": "武鸣县",
            "code": "450122"
        }, {"id": "465", "name": "隆安县", "code": "450123"}, {"id": "466", "name": "马山县", "code": "450124"}, {
            "id": "467",
            "name": "上林县",
            "code": "450125"
        }, {"id": "468", "name": "宾阳县", "code": "450126"}, {"id": "469", "name": "横县", "code": "450127"}]
    }, {
        "id": "65",
        "name": "柳州市",
        "code": "450200",
        "area": [{"id": "470", "name": "城中区", "code": "450202"}, {
            "id": "471",
            "name": "鱼峰区",
            "code": "450203"
        }, {"id": "472", "name": "柳南区", "code": "450204"}, {"id": "473", "name": "柳北区", "code": "450205"}, {
            "id": "474",
            "name": "柳江县",
            "code": "450221"
        }, {"id": "475", "name": "柳城县", "code": "450222"}, {"id": "476", "name": "鹿寨县", "code": "450223"}, {
            "id": "477",
            "name": "融安县",
            "code": "450224"
        }, {"id": "478", "name": "融水苗族自治县", "code": "450225"}, {"id": "479", "name": "三江侗族自治县", "code": "450226"}]
    }, {
        "id": "66",
        "name": "桂林市",
        "code": "450300",
        "area": [{"id": "480", "name": "秀峰区", "code": "450302"}, {
            "id": "481",
            "name": "叠彩区",
            "code": "450303"
        }, {"id": "482", "name": "象山区", "code": "450304"}, {"id": "483", "name": "七星区", "code": "450305"}, {
            "id": "484",
            "name": "雁山区",
            "code": "450311"
        }, {"id": "485", "name": "阳朔县", "code": "450321"}, {"id": "486", "name": "临桂县", "code": "450322"}, {
            "id": "487",
            "name": "灵川县",
            "code": "450323"
        }, {"id": "488", "name": "全州县", "code": "450324"}, {"id": "489", "name": "兴安县", "code": "450325"}, {
            "id": "490",
            "name": "永福县",
            "code": "450326"
        }, {"id": "491", "name": "灌阳县", "code": "450327"}, {
            "id": "492",
            "name": "龙胜各族自治县",
            "code": "450328"
        }, {"id": "493", "name": "资源县", "code": "450329"}, {"id": "494", "name": "平乐县", "code": "450330"}, {
            "id": "495",
            "name": "荔浦县",
            "code": "450331"
        }, {"id": "496", "name": "恭城瑶族自治县", "code": "450332"}]
    }, {
        "id": "67",
        "name": "梧州市",
        "code": "450400",
        "area": [{"id": "497", "name": "万秀区", "code": "450403"}, {
            "id": "498",
            "name": "蝶山区",
            "code": "450404"
        }, {"id": "499", "name": "长洲区", "code": "450405"}, {"id": "500", "name": "龙圩区", "code": "450406"}, {
            "id": "501",
            "name": "苍梧县",
            "code": "450421"
        }, {"id": "502", "name": "藤县县", "code": "450422"}, {"id": "503", "name": "蒙山县", "code": "450423"}, {
            "id": "504",
            "name": "岑溪县",
            "code": "450481"
        }]
    }, {
        "id": "68",
        "name": "北海市",
        "code": "450500",
        "area": [{"id": "505", "name": "海城区", "code": "450502"}, {
            "id": "506",
            "name": "银海区",
            "code": "450503"
        }, {"id": "507", "name": "铁山港区", "code": "450512"}, {"id": "508", "name": "合浦区", "code": "450521"}]
    }, {
        "id": "69",
        "name": "防城港市",
        "code": "450600",
        "area": [{"id": "509", "name": "港口区", "code": "450602"}, {
            "id": "510",
            "name": "防城区",
            "code": "450603"
        }, {"id": "511", "name": "上思县", "code": "450621"}, {"id": "512", "name": "东兴市", "code": "450681"}]
    }, {
        "id": "70",
        "name": "钦州市",
        "code": "450700",
        "area": [{"id": "513", "name": "钦南区", "code": "450702"}, {
            "id": "514",
            "name": "钦北区",
            "code": "450703"
        }, {"id": "515", "name": "灵山县", "code": "450721"}, {"id": "516", "name": "浦北县", "code": "450722"}]
    }, {
        "id": "71",
        "name": "贵港市",
        "code": "450800",
        "area": [{"id": "517", "name": "港北区", "code": "450802"}, {
            "id": "518",
            "name": "港南区",
            "code": "450803"
        }, {"id": "519", "name": "覃塘区", "code": "450804"}, {"id": "520", "name": "平南县", "code": "450821"}, {
            "id": "521",
            "name": "桂平市",
            "code": "450881"
        }]
    }, {
        "id": "72",
        "name": "玉林市",
        "code": "450900",
        "area": [{"id": "522", "name": "玉州区", "code": "450902"}, {
            "id": "523",
            "name": "福绵区",
            "code": "450903"
        }, {"id": "524", "name": "容县", "code": "450921"}, {"id": "525", "name": "陆川县", "code": "450922"}, {
            "id": "526",
            "name": "博白县",
            "code": "450923"
        }, {"id": "527", "name": "兴业县", "code": "450924"}, {"id": "528", "name": "北流市", "code": "450981"}]
    }, {
        "id": "73",
        "name": "百色市",
        "code": "451000",
        "area": [{"id": "529", "name": "右江区", "code": "451002"}, {
            "id": "530",
            "name": "田阳县",
            "code": "451021"
        }, {"id": "531", "name": "田东县", "code": "451022"}, {"id": "532", "name": "平果县", "code": "451023"}, {
            "id": "533",
            "name": "德保县",
            "code": "451024"
        }, {"id": "534", "name": "靖西县", "code": "451025"}, {"id": "535", "name": "那坡县", "code": "451026"}, {
            "id": "536",
            "name": "凌云县",
            "code": "451027"
        }, {"id": "537", "name": "乐业县", "code": "451028"}, {"id": "538", "name": "田林县", "code": "451029"}, {
            "id": "539",
            "name": "西林县",
            "code": "451030"
        }, {"id": "540", "name": "隆林各族自治县", "code": "451031"}]
    }, {
        "id": "74",
        "name": "贺州市",
        "code": "451100",
        "area": [{"id": "541", "name": "八步区", "code": "451102"}, {
            "id": "542",
            "name": "平桂县",
            "code": "451103"
        }, {"id": "543", "name": "昭平县", "code": "451121"}, {
            "id": "544",
            "name": "钟山瑶族自治县",
            "code": "451122"
        }, {"id": "545", "name": "富川瑶族自治县", "code": "451123"}]
    }, {
        "id": "75",
        "name": "河池市",
        "code": "451200",
        "area": [{"id": "546", "name": "金城江区", "code": "451202"}, {
            "id": "547",
            "name": "南丹县",
            "code": "451221"
        }, {"id": "548", "name": "天峨县", "code": "451222"}, {"id": "549", "name": "凤山县", "code": "451223"}, {
            "id": "550",
            "name": "东兰县",
            "code": "451224"
        }, {"id": "551", "name": "罗城仫佬族自治县", "code": "451225"}, {
            "id": "552",
            "name": "环江毛南族自治县",
            "code": "451226"
        }, {"id": "553", "name": "巴马瑶族自治县", "code": "451227"}, {
            "id": "554",
            "name": "都安瑶族自治县",
            "code": "451228"
        }, {"id": "555", "name": "大化瑶族自治县", "code": "451229"}, {"id": "556", "name": "宜州市", "code": "451281"}]
    }, {
        "id": "76",
        "name": "来宾市",
        "code": "451300",
        "area": [{"id": "557", "name": "兴宾区", "code": "451302"}, {
            "id": "558",
            "name": "忻城县",
            "code": "451321"
        }, {"id": "559", "name": "象州县", "code": "451322"}, {"id": "560", "name": "武宣县", "code": "451323"}, {
            "id": "561",
            "name": "金秀瑶族自治县",
            "code": "451324"
        }, {"id": "562", "name": "合山市", "code": "451381"}]
    }, {
        "id": "77",
        "name": "崇左市",
        "code": "451400",
        "area": [{"id": "563", "name": "江州区", "code": "451402"}, {
            "id": "564",
            "name": "扶绥",
            "code": "451421"
        }, {"id": "565", "name": "宁明县", "code": "451422"}, {"id": "566", "name": "龙州县", "code": "451423"}, {
            "id": "567",
            "name": "大新县",
            "code": "451424"
        }, {"id": "568", "name": "天等县", "code": "451425"}, {"id": "569", "name": "凭祥县", "code": "451481"}]
    }]
}, {
    "id": "21",
    "name": "海南省",
    "code": "460000",
    "city": [{
        "id": "87",
        "name": "海口市",
        "code": "460100",
        "area": [{"id": "659", "name": "秀英区", "code": "460105"}, {
            "id": "660",
            "name": "龙华区",
            "code": "460106"
        }, {"id": "661", "name": "琼山区", "code": "460107"}, {"id": "662", "name": "美兰区", "code": "460108"}]
    }, {
        "id": "88",
        "name": "三亚市",
        "code": "460200",
        "area": [{"id": "663", "name": "三亚市", "code": "460200"}]
    }, {
        "id": "89",
        "name": "三沙市",
        "code": "460300",
        "area": [{"id": "664", "name": "三沙市", "code": "460300"}, {
            "id": "2883",
            "name": "西沙群岛",
            "code": "460321"
        }, {"id": "2884", "name": "南沙群岛", "code": "460322"}, {"id": "2885", "name": "中沙群岛的岛礁及其海域", "code": "460323"}]
    }, {
        "id": "90",
        "name": "五指山市",
        "code": "469001",
        "area": [{"id": "665", "name": "五指山市", "code": "469001"}]
    }, {
        "id": "91",
        "name": "琼海市",
        "code": "469002",
        "area": [{"id": "666", "name": "琼海市", "code": "469002"}]
    }, {
        "id": "92",
        "name": "儋州市",
        "code": "469003",
        "area": [{"id": "667", "name": "儋州市", "code": "469003"}]
    }, {
        "id": "93",
        "name": "文昌市",
        "code": "469005",
        "area": [{"id": "668", "name": "文昌市", "code": "469005"}]
    }, {
        "id": "94",
        "name": "万宁市",
        "code": "469006",
        "area": [{"id": "669", "name": "万宁市", "code": "469006"}]
    }, {
        "id": "95",
        "name": "东方市",
        "code": "469007",
        "area": [{"id": "670", "name": "东方市", "code": "469007"}]
    }, {
        "id": "96",
        "name": "定安县",
        "code": "469025",
        "area": [{"id": "671", "name": "定安县", "code": "469025"}]
    }, {
        "id": "97",
        "name": "屯昌县",
        "code": "469026",
        "area": [{"id": "672", "name": "屯昌县", "code": "469026"}]
    }, {
        "id": "98",
        "name": "澄迈县",
        "code": "469027",
        "area": [{"id": "673", "name": "澄迈县", "code": "469027"}]
    }, {
        "id": "99",
        "name": "临高县",
        "code": "469028",
        "area": [{"id": "674", "name": "临高县", "code": "469028"}]
    }, {
        "id": "100",
        "name": "白沙黎族自治县",
        "code": "469030",
        "area": [{"id": "675", "name": "白沙黎族自治县", "code": "469030"}]
    }, {
        "id": "101",
        "name": "昌江黎族自治县",
        "code": "469031",
        "area": [{"id": "676", "name": "昌江黎族自治县", "code": "469031"}]
    }, {
        "id": "102",
        "name": "乐东黎族自治县",
        "code": "469033",
        "area": [{"id": "677", "name": "乐东黎族自治县", "code": "469033"}]
    }, {
        "id": "103",
        "name": "陵水黎族自治县",
        "code": "469034",
        "area": [{"id": "678", "name": "陵水黎族自治县", "code": "469034"}]
    }, {
        "id": "104",
        "name": "保亭黎族苗族自治县",
        "code": "469035",
        "area": [{"id": "679", "name": "保亭", "code": ""}]
    }, {"id": "105", "name": "琼中黎族苗族自治县", "code": "469036", "area": [{"id": "680", "name": "琼中", "code": ""}]}]
}, {
    "id": "22", "name": "重庆市", "code": "500000", "city": [{
        "id": "19",
        "name": "重庆市",
        "code": "500100",
        "area": [{"id": "124", "name": "万州区", "code": "500101"}, {
            "id": "125",
            "name": "涪陵区",
            "code": "500102"
        }, {"id": "126", "name": "渝中区", "code": "500103"}, {
            "id": "127",
            "name": "大渡口区",
            "code": "500104"
        }, {"id": "128", "name": "江北区", "code": "500105"}, {
            "id": "129",
            "name": "沙坪坝区",
            "code": "500106"
        }, {"id": "130", "name": "九龙坡区", "code": "500107"}, {
            "id": "131",
            "name": "南岸区",
            "code": "500108"
        }, {"id": "132", "name": "北碚区", "code": "500109"}, {"id": "133", "name": "渝北区", "code": "500112"}, {
            "id": "134",
            "name": "巴南区",
            "code": "500113"
        }, {"id": "135", "name": "黔江区", "code": "500114"}, {"id": "136", "name": "长寿区", "code": "500115"}, {
            "id": "137",
            "name": "綦江区",
            "code": "500222"
        }, {"id": "138", "name": "潼南县", "code": "500223"}, {"id": "139", "name": "铜梁县", "code": "500224"}, {
            "id": "140",
            "name": "开县",
            "code": "500224"
        }, {"id": "141", "name": "大足区", "code": "500225"}, {"id": "142", "name": "荣昌县", "code": "500226"}, {
            "id": "143",
            "name": "璧山县",
            "code": "500227"
        }, {"id": "144", "name": "梁平县", "code": "500228"}, {"id": "145", "name": "城口县", "code": "500229"}, {
            "id": "146",
            "name": "丰都县",
            "code": "500230"
        }, {"id": "147", "name": "垫江县", "code": "500231"}, {"id": "148", "name": "武隆县", "code": "500232"}, {
            "id": "149",
            "name": "忠县",
            "code": "500233"
        }, {"id": "150", "name": "开州区", "code": "500234"}, {"id": "151", "name": "云阳县", "code": "500235"}, {
            "id": "152",
            "name": "奉节县",
            "code": "500236"
        }, {"id": "153", "name": "巫山县", "code": "500237"}, {"id": "154", "name": "巫溪县", "code": "500238"}, {
            "id": "155",
            "name": "石柱土家族自治县",
            "code": "500240"
        }, {"id": "156", "name": "秀山土家族苗族自治县", "code": "500241"}, {
            "id": "157",
            "name": "酉阳土家族苗族自治县",
            "code": "500242"
        }, {"id": "158", "name": "彭水苗族土家族自治县", "code": "500243"}, {
            "id": "159",
            "name": "江津区",
            "code": "500381"
        }, {"id": "160", "name": "合川区", "code": "500382"}, {"id": "161", "name": "永川区", "code": "500383"}, {
            "id": "162",
            "name": "南川区",
            "code": "500384"
        }]
    }]
}, {
    "id": "23", "name": "四川省", "code": "510000", "city": [{
        "id": "290",
        "name": "成都市",
        "code": "510100",
        "area": [{"id": "2281", "name": "锦江区", "code": "510104"}, {
            "id": "2282",
            "name": "青羊区",
            "code": "510105"
        }, {"id": "2283", "name": "金牛区", "code": "510106"}, {
            "id": "2284",
            "name": "武侯区",
            "code": "510107"
        }, {"id": "2285", "name": "成华区", "code": "510108"}, {
            "id": "2286",
            "name": "龙泉驿区",
            "code": "510112"
        }, {"id": "2287", "name": "青白江区", "code": "510113"}, {
            "id": "2288",
            "name": "新都区",
            "code": "510114"
        }, {"id": "2289", "name": "温江区", "code": "510115"}, {
            "id": "2290",
            "name": "金堂县",
            "code": "510121"
        }, {"id": "2291", "name": "双流县", "code": "510122"}, {
            "id": "2292",
            "name": "郫县",
            "code": "510124"
        }, {"id": "2293", "name": "大邑县", "code": "510129"}, {
            "id": "2294",
            "name": "蒲江县",
            "code": "510131"
        }, {"id": "2295", "name": "新津县", "code": "510132"}, {
            "id": "2296",
            "name": "都江堰",
            "code": "510181"
        }, {"id": "2297", "name": "彭州市", "code": "510182"}, {
            "id": "2298",
            "name": "邛崃市",
            "code": "510183"
        }, {"id": "2299", "name": "崇州市", "code": "510184"}]
    }, {
        "id": "291",
        "name": "自贡市",
        "code": "510300",
        "area": [{"id": "2300", "name": "自流井区", "code": "510302"}, {
            "id": "2301",
            "name": "贡井区",
            "code": "510303"
        }, {"id": "2302", "name": "大安区", "code": "510304"}, {
            "id": "2303",
            "name": "沿滩区",
            "code": "510311"
        }, {"id": "2304", "name": "荣县", "code": "510321"}, {"id": "2305", "name": "富顺县", "code": "510322"}]
    }, {
        "id": "292",
        "name": "攀枝花市",
        "code": "510400",
        "area": [{"id": "2306", "name": "东区", "code": "510402"}, {
            "id": "2307",
            "name": "西区",
            "code": "510403"
        }, {"id": "2308", "name": "仁和区", "code": "510411"}, {
            "id": "2309",
            "name": "米易县",
            "code": "510421"
        }, {"id": "2310", "name": "盐边县", "code": "510422"}]
    }, {
        "id": "293",
        "name": "泸州市",
        "code": "510500",
        "area": [{"id": "2311", "name": "江阳区", "code": "510502"}, {
            "id": "2312",
            "name": "纳溪区",
            "code": "510503"
        }, {"id": "2313", "name": "龙马潭区", "code": "510504"}, {
            "id": "2314",
            "name": "泸县县",
            "code": "510521"
        }, {"id": "2315", "name": "合江县", "code": "510522"}, {
            "id": "2316",
            "name": "叙永县",
            "code": "510524"
        }, {"id": "2317", "name": "古蔺县", "code": "510525"}]
    }, {
        "id": "294",
        "name": "德阳市",
        "code": "510600",
        "area": [{"id": "2318", "name": "旌阳区", "code": "510603"}, {
            "id": "2319",
            "name": "中江县",
            "code": "510623"
        }, {"id": "2320", "name": "罗江县", "code": "510626"}, {
            "id": "2321",
            "name": "广汉市",
            "code": "510681"
        }, {"id": "2322", "name": "什邡市", "code": "510682"}, {"id": "2323", "name": "绵竹市", "code": "510683"}]
    }, {
        "id": "295",
        "name": "绵阳市",
        "code": "510700",
        "area": [{"id": "2324", "name": "涪城区", "code": "510703"}, {
            "id": "2325",
            "name": "游仙区",
            "code": "510704"
        }, {"id": "2326", "name": "三台县", "code": "510722"}, {
            "id": "2327",
            "name": "盐亭县",
            "code": "510723"
        }, {"id": "2328", "name": "安县", "code": "510724"}, {
            "id": "2329",
            "name": "梓潼县",
            "code": "510725"
        }, {"id": "2330", "name": "北川羌族自治县", "code": "510726"}, {
            "id": "2331",
            "name": "平武县",
            "code": "510727"
        }, {"id": "2332", "name": "江油市", "code": "510781"}]
    }, {
        "id": "296",
        "name": "广元市",
        "code": "510800",
        "area": [{"id": "2333", "name": "利州区", "code": "510802"}, {
            "id": "2334",
            "name": "昭化区",
            "code": "510811"
        }, {"id": "2335", "name": "朝天区", "code": "510812"}, {
            "id": "2336",
            "name": "旺苍县",
            "code": "510821"
        }, {"id": "2337", "name": "青川县", "code": "510822"}, {
            "id": "2338",
            "name": "剑阁县",
            "code": "510823"
        }, {"id": "2339", "name": "苍溪县", "code": "510824"}]
    }, {
        "id": "297",
        "name": "遂宁市",
        "code": "510900",
        "area": [{"id": "2340", "name": "船山区", "code": "510903"}, {
            "id": "2341",
            "name": "安居区",
            "code": "510904"
        }, {"id": "2342", "name": "蓬溪县", "code": "510921"}, {
            "id": "2343",
            "name": "射洪县",
            "code": "510922"
        }, {"id": "2344", "name": "大英县", "code": "510923"}]
    }, {
        "id": "298",
        "name": "内江市",
        "code": "511000",
        "area": [{"id": "2345", "name": "市中区", "code": "511002"}, {
            "id": "2346",
            "name": "东兴区",
            "code": "511011"
        }, {"id": "2347", "name": "威远县", "code": "511024"}, {
            "id": "2348",
            "name": "资中县",
            "code": "511025"
        }, {"id": "2349", "name": "隆昌县", "code": "511028"}]
    }, {
        "id": "299",
        "name": "乐山市",
        "code": "511100",
        "area": [{"id": "2350", "name": "市中区", "code": "511102"}, {
            "id": "2351",
            "name": "沙湾区",
            "code": "511111"
        }, {"id": "2352", "name": "五通桥区", "code": "511112"}, {
            "id": "2353",
            "name": "金口河区",
            "code": "511113"
        }, {"id": "2354", "name": "犍为县", "code": "511123"}, {
            "id": "2355",
            "name": "井研县",
            "code": "511124"
        }, {"id": "2356", "name": "夹江县", "code": "511126"}, {
            "id": "2357",
            "name": "沐川县",
            "code": "511129"
        }, {"id": "2358", "name": "峨边彝族自治县", "code": "511132"}, {
            "id": "2359",
            "name": "马边彝族自治县",
            "code": "511133"
        }, {"id": "2360", "name": "峨眉山市", "code": "511181"}]
    }, {
        "id": "300",
        "name": "南充市",
        "code": "511300",
        "area": [{"id": "2361", "name": "顺庆区", "code": "511302"}, {
            "id": "2362",
            "name": "高坪区",
            "code": "511303"
        }, {"id": "2363", "name": "嘉陵区", "code": "511304"}, {
            "id": "2364",
            "name": "南部县",
            "code": "511321"
        }, {"id": "2365", "name": "营山县", "code": "511322"}, {
            "id": "2366",
            "name": "蓬安县",
            "code": "511323"
        }, {"id": "2367", "name": "仪陇县", "code": "511324"}, {
            "id": "2368",
            "name": "西充县",
            "code": "511325"
        }, {"id": "2369", "name": "阆中市", "code": "511381"}]
    }, {
        "id": "301",
        "name": "眉山市",
        "code": "511400",
        "area": [{"id": "2370", "name": "东坡区", "code": "511402"}, {
            "id": "2371",
            "name": "仁寿县",
            "code": "511421"
        }, {"id": "2372", "name": "彭山县", "code": "511422"}, {
            "id": "2373",
            "name": "洪雅县",
            "code": "511423"
        }, {"id": "2374", "name": "丹棱县", "code": "511424"}, {"id": "2375", "name": "青神县", "code": "511425"}]
    }, {
        "id": "302",
        "name": "宜宾市",
        "code": "511500",
        "area": [{"id": "2376", "name": "翠屏区", "code": "511502"}, {
            "id": "2377",
            "name": "宜宾区",
            "code": "511521"
        }, {"id": "2378", "name": "南溪区", "code": "511522"}, {
            "id": "2379",
            "name": "江安县",
            "code": "511523"
        }, {"id": "2380", "name": "长宁县", "code": "511524"}, {
            "id": "2381",
            "name": "高县县",
            "code": "511525"
        }, {"id": "2382", "name": "珙县", "code": "511526"}, {
            "id": "2383",
            "name": "筠连县",
            "code": "511527"
        }, {"id": "2384", "name": "兴文县", "code": "511528"}, {"id": "2385", "name": "屏山县", "code": "511529"}]
    }, {
        "id": "303",
        "name": "广安市",
        "code": "511600",
        "area": [{"id": "2386", "name": "广安区", "code": "511602"}, {
            "id": "2387",
            "name": "前锋区",
            "code": "511603"
        }, {"id": "2388", "name": "岳池县", "code": "511621"}, {
            "id": "2389",
            "name": "武胜县",
            "code": "511622"
        }, {"id": "2390", "name": "邻水县", "code": "511623"}, {"id": "2391", "name": "华蓥市", "code": "511681"}]
    }, {
        "id": "304",
        "name": "达州市",
        "code": "511700",
        "area": [{"id": "2392", "name": "通川区", "code": "511702"}, {
            "id": "2393",
            "name": "达川区",
            "code": "511721"
        }, {"id": "2394", "name": "达县", "code": "511721"}, {
            "id": "2395",
            "name": "宣汉县",
            "code": "511722"
        }, {"id": "2396", "name": "开江县", "code": "511723"}, {
            "id": "2397",
            "name": "大竹县",
            "code": "511724"
        }, {"id": "2398", "name": "渠县", "code": "511725"}, {"id": "2399", "name": "万源市", "code": "511781"}]
    }, {
        "id": "305",
        "name": "雅安市",
        "code": "511800",
        "area": [{"id": "2400", "name": "雨城区", "code": "511802"}, {
            "id": "2401",
            "name": "名山区",
            "code": "511821"
        }, {"id": "2402", "name": "荥经县", "code": "511822"}, {
            "id": "2403",
            "name": "汉源县",
            "code": "511823"
        }, {"id": "2404", "name": "石棉县", "code": "511824"}, {
            "id": "2405",
            "name": "天全县",
            "code": "511825"
        }, {"id": "2406", "name": "芦山县", "code": "511826"}, {"id": "2407", "name": "宝兴县", "code": "511827"}]
    }, {
        "id": "306",
        "name": "巴中市",
        "code": "511900",
        "area": [{"id": "2408", "name": "巴州区", "code": "511902"}, {
            "id": "2409",
            "name": "恩阳区",
            "code": "511903"
        }, {"id": "2410", "name": "通江县", "code": "511921"}, {
            "id": "2411",
            "name": "南江县",
            "code": "511922"
        }, {"id": "2412", "name": "平昌县", "code": "511923"}]
    }, {
        "id": "307",
        "name": "资阳市",
        "code": "512000",
        "area": [{"id": "2413", "name": "雁江区县", "code": "512002"}, {
            "id": "2414",
            "name": "安岳县",
            "code": "512021"
        }, {"id": "2415", "name": "乐至县", "code": "512022"}, {"id": "2416", "name": "简阳市", "code": "512081"}]
    }, {
        "id": "308",
        "name": "阿坝藏族羌族自治州",
        "code": "513200",
        "area": [{"id": "2417", "name": "汶川县", "code": "513221"}, {
            "id": "2418",
            "name": "理县",
            "code": "513222"
        }, {"id": "2419", "name": "茂县", "code": "513223"}, {
            "id": "2420",
            "name": "松潘县",
            "code": "513224"
        }, {"id": "2421", "name": "九寨沟县", "code": "513225"}, {
            "id": "2422",
            "name": "金川县",
            "code": "513226"
        }, {"id": "2423", "name": "小金县", "code": "513227"}, {
            "id": "2424",
            "name": "黑水县",
            "code": "513228"
        }, {"id": "2425", "name": "马尔康县", "code": "513229"}, {
            "id": "2426",
            "name": "壤塘县",
            "code": "513230"
        }, {"id": "2427", "name": "阿坝县", "code": "513231"}, {
            "id": "2428",
            "name": "若尔盖县",
            "code": "513232"
        }, {"id": "2429", "name": "红原县", "code": "513233"}]
    }, {
        "id": "309",
        "name": "甘孜藏族自治州",
        "code": "513300",
        "area": [{"id": "2430", "name": "康定县", "code": "513321"}, {
            "id": "2431",
            "name": "泸定县",
            "code": "513322"
        }, {"id": "2432", "name": "丹巴县", "code": "513323"}, {
            "id": "2433",
            "name": "九龙县",
            "code": "513324"
        }, {"id": "2434", "name": "雅江县", "code": "513325"}, {
            "id": "2435",
            "name": "道孚县",
            "code": "513326"
        }, {"id": "2436", "name": "炉霍县", "code": "513327"}, {
            "id": "2437",
            "name": "甘孜县",
            "code": "513328"
        }, {"id": "2438", "name": "新龙县", "code": "513329"}, {
            "id": "2439",
            "name": "德格县",
            "code": "513330"
        }, {"id": "2440", "name": "白玉县", "code": "513331"}, {
            "id": "2441",
            "name": "石渠县",
            "code": "513332"
        }, {"id": "2442", "name": "色达县", "code": "513333"}, {
            "id": "2443",
            "name": "理塘县",
            "code": "513334"
        }, {"id": "2444", "name": "巴塘县", "code": "513335"}, {
            "id": "2445",
            "name": "乡城县",
            "code": "513336"
        }, {"id": "2446", "name": "稻城县", "code": "513337"}, {"id": "2447", "name": "得荣县", "code": "513338"}]
    }, {
        "id": "310",
        "name": "凉山彝族",
        "code": "513400",
        "area": [{"id": "2448", "name": "西昌市", "code": "513401"}, {
            "id": "2449",
            "name": "木里藏族自治县",
            "code": "513422"
        }, {"id": "2450", "name": "盐源县", "code": "513423"}, {
            "id": "2451",
            "name": "德昌县",
            "code": "513424"
        }, {"id": "2452", "name": "会理县", "code": "513425"}, {
            "id": "2453",
            "name": "会东县",
            "code": "513426"
        }, {"id": "2454", "name": "宁南县", "code": "513427"}, {
            "id": "2455",
            "name": "普格县",
            "code": "513428"
        }, {"id": "2456", "name": "布拖县", "code": "513429"}, {
            "id": "2457",
            "name": "金阳县",
            "code": "513430"
        }, {"id": "2458", "name": "昭觉县", "code": "513431"}, {
            "id": "2459",
            "name": "喜德县",
            "code": "513432"
        }, {"id": "2460", "name": "冕宁县", "code": "513433"}, {
            "id": "2461",
            "name": "越西县",
            "code": "513434"
        }, {"id": "2462", "name": "甘洛县", "code": "513435"}, {
            "id": "2463",
            "name": "美姑县",
            "code": "513436"
        }, {"id": "2464", "name": "雷波县", "code": "513437"}]
    }]
}, {
    "id": "24",
    "name": "贵州省",
    "code": "520000",
    "city": [{
        "id": "78",
        "name": "贵阳市",
        "code": "520100",
        "area": [{"id": "570", "name": "南明区", "code": "520102"}, {
            "id": "571",
            "name": "云岩区",
            "code": "520103"
        }, {"id": "572", "name": "花溪区", "code": "520111"}, {"id": "573", "name": "乌当区", "code": "520112"}, {
            "id": "574",
            "name": "白云区",
            "code": "520113"
        }, {"id": "575", "name": "小河区", "code": "520114"}, {"id": "576", "name": "开阳县", "code": "520121"}, {
            "id": "577",
            "name": "息烽县",
            "code": "520122"
        }, {"id": "578", "name": "修文县", "code": "520123"}, {
            "id": "579",
            "name": "观山湖市",
            "code": "520151"
        }, {"id": "580", "name": "清镇", "code": "520181"}]
    }, {
        "id": "79",
        "name": "六盘水市",
        "code": "520200",
        "area": [{"id": "581", "name": "钟山区", "code": "520201"}, {
            "id": "582",
            "name": "六枝特区",
            "code": "520203"
        }, {"id": "583", "name": "水城县", "code": "520221"}, {"id": "584", "name": "盘县", "code": "520222"}]
    }, {
        "id": "80",
        "name": "遵义市",
        "code": "520300",
        "area": [{"id": "585", "name": "红花岗区", "code": "520302"}, {
            "id": "586",
            "name": "汇川区",
            "code": "520303"
        }, {"id": "587", "name": "遵义县", "code": "520321"}, {"id": "588", "name": "桐梓县", "code": "520322"}, {
            "id": "589",
            "name": "绥阳县",
            "code": "520323"
        }, {"id": "590", "name": "正安县", "code": "520324"}, {
            "id": "591",
            "name": "道真仡佬族苗族自治县",
            "code": "520325"
        }, {"id": "592", "name": "务川仡佬族苗族自治县", "code": "520326"}, {
            "id": "593",
            "name": "凤冈县",
            "code": "520327"
        }, {"id": "594", "name": "湄潭县", "code": "520328"}, {"id": "595", "name": "余庆县", "code": "520329"}, {
            "id": "596",
            "name": "习水县",
            "code": "520330"
        }, {"id": "597", "name": "赤水市", "code": "520381"}, {"id": "598", "name": "仁怀市", "code": "520382"}]
    }, {
        "id": "81",
        "name": "安顺市",
        "code": "520400",
        "area": [{"id": "599", "name": "西秀区", "code": "520402"}, {
            "id": "600",
            "name": "平坝县",
            "code": "520421"
        }, {"id": "601", "name": "普定县", "code": "520422"}, {
            "id": "602",
            "name": "镇宁布依族苗族自治县",
            "code": "520423"
        }, {"id": "603", "name": "关岭布依族苗族自治县", "code": "520424"}, {"id": "604", "name": "紫云苗族布依族自治县", "code": "520425"}]
    }, {
        "id": "82",
        "name": "铜仁市",
        "code": "522200",
        "area": [{"id": "605", "name": "碧江区", "code": "522201"}, {
            "id": "606",
            "name": "江口区",
            "code": "522222"
        }, {"id": "607", "name": "玉屏侗族自治县", "code": "522223"}, {
            "id": "608",
            "name": "石阡县",
            "code": "522224"
        }, {"id": "609", "name": "思南县", "code": "522225"}, {
            "id": "610",
            "name": "印江土家族苗族自治县",
            "code": "522226"
        }, {"id": "611", "name": "德江县", "code": "522227"}, {
            "id": "612",
            "name": "沿河土家族自治县",
            "code": "522228"
        }, {"id": "613", "name": "松桃苗族自治县", "code": "522229"}, {"id": "614", "name": "万山区", "code": "522230"}]
    }, {
        "id": "83",
        "name": "黔西南市",
        "code": "522300",
        "area": [{"id": "615", "name": "兴义市", "code": "522301"}, {
            "id": "616",
            "name": "兴仁县",
            "code": "522322"
        }, {"id": "617", "name": "普安县", "code": "522323"}, {"id": "618", "name": "晴隆县", "code": "522324"}, {
            "id": "619",
            "name": "贞丰县",
            "code": "522325"
        }, {"id": "620", "name": "望谟县", "code": "522326"}, {"id": "621", "name": "册亨县", "code": "522327"}, {
            "id": "622",
            "name": "安龙县",
            "code": "522328"
        }]
    }, {
        "id": "84",
        "name": "毕节市",
        "code": "522400",
        "area": [{"id": "623", "name": "七星关区", "code": "522401"}, {
            "id": "624",
            "name": "大方县",
            "code": "522422"
        }, {"id": "625", "name": "黔西县", "code": "522423"}, {"id": "626", "name": "金沙县", "code": "522424"}, {
            "id": "627",
            "name": "织金县",
            "code": "522425"
        }, {"id": "628", "name": "纳雍县", "code": "522426"}, {
            "id": "629",
            "name": "威宁彝族回族苗族自治县",
            "code": "522427"
        }, {"id": "630", "name": "赫章县", "code": "522428"}]
    }, {
        "id": "85",
        "name": "黔东南市",
        "code": "522600",
        "area": [{"id": "631", "name": "凯里市", "code": "522601"}, {
            "id": "632",
            "name": "黄平县",
            "code": "522622"
        }, {"id": "633", "name": "施秉县", "code": "522623"}, {"id": "634", "name": "三穗县", "code": "522624"}, {
            "id": "635",
            "name": "镇远县",
            "code": "522625"
        }, {"id": "636", "name": "岑巩县", "code": "522626"}, {"id": "637", "name": "天柱县", "code": "522627"}, {
            "id": "638",
            "name": "锦屏县",
            "code": "522628"
        }, {"id": "639", "name": "剑河县", "code": "522629"}, {"id": "640", "name": "台江县", "code": "522630"}, {
            "id": "641",
            "name": "黎平县",
            "code": "522631"
        }, {"id": "642", "name": "榕江县", "code": "522632"}, {"id": "643", "name": "从江县", "code": "522633"}, {
            "id": "644",
            "name": "雷山县",
            "code": "522634"
        }, {"id": "645", "name": "麻江县", "code": "522635"}, {"id": "646", "name": "丹寨县", "code": "522636"}]
    }, {
        "id": "86",
        "name": "黔南市",
        "code": "522700",
        "area": [{"id": "647", "name": "都匀市", "code": "522701"}, {
            "id": "648",
            "name": "福泉市",
            "code": "522702"
        }, {"id": "649", "name": "荔波县", "code": "522722"}, {"id": "650", "name": "贵定县", "code": "522723"}, {
            "id": "651",
            "name": "瓮安县",
            "code": "522725"
        }, {"id": "652", "name": "独山县", "code": "522726"}, {"id": "653", "name": "平塘县", "code": "522727"}, {
            "id": "654",
            "name": "罗甸县",
            "code": "522728"
        }, {"id": "655", "name": "长顺县", "code": "522729"}, {"id": "656", "name": "龙里县", "code": "522730"}, {
            "id": "657",
            "name": "惠水县",
            "code": "522731"
        }, {"id": "658", "name": "三都水族自治县", "code": "522732"}]
    }]
}, {
    "id": "25",
    "name": "云南省",
    "code": "530000",
    "city": [{
        "id": "341",
        "name": "昆明市",
        "code": "530100",
        "area": [{"id": "2663", "name": "五华区", "code": "530102"}, {
            "id": "2664",
            "name": "盘龙区",
            "code": "530103"
        }, {"id": "2665", "name": "官渡区", "code": "530111"}, {
            "id": "2666",
            "name": "西山区",
            "code": "530112"
        }, {"id": "2667", "name": "东川区", "code": "530113"}, {
            "id": "2668",
            "name": "呈贡区",
            "code": "530121"
        }, {"id": "2669", "name": "晋宁县", "code": "530122"}, {
            "id": "2670",
            "name": "富民县",
            "code": "530124"
        }, {"id": "2671", "name": "宜良县", "code": "530125"}, {
            "id": "2672",
            "name": "石林彝族自治县",
            "code": "530126"
        }, {"id": "2673", "name": "嵩明县", "code": "530127"}, {
            "id": "2674",
            "name": "禄劝彝族苗族自治县",
            "code": "530128"
        }, {"id": "2675", "name": "寻甸回族彝族自治县", "code": "530129"}, {"id": "2676", "name": "安宁市", "code": "530181"}]
    }, {
        "id": "342",
        "name": "曲靖市",
        "code": "530300",
        "area": [{"id": "2677", "name": "麒麟区", "code": "530302"}, {
            "id": "2678",
            "name": "马龙县",
            "code": "530321"
        }, {"id": "2679", "name": "陆良县", "code": "530322"}, {
            "id": "2680",
            "name": "师宗县",
            "code": "530323"
        }, {"id": "2681", "name": "罗平县", "code": "530324"}, {
            "id": "2682",
            "name": "富源县",
            "code": "530325"
        }, {"id": "2683", "name": "会泽县", "code": "530326"}, {
            "id": "2684",
            "name": "沾益县",
            "code": "530328"
        }, {"id": "2685", "name": "宣威市", "code": "530381"}]
    }, {
        "id": "343",
        "name": "玉溪市",
        "code": "530400",
        "area": [{"id": "2686", "name": "红塔区", "code": "530402"}, {
            "id": "2687",
            "name": "江川县",
            "code": "530421"
        }, {"id": "2688", "name": "澄江县", "code": "530422"}, {
            "id": "2689",
            "name": "通海县",
            "code": "530423"
        }, {"id": "2690", "name": "华宁县", "code": "530424"}, {
            "id": "2691",
            "name": "易门县",
            "code": "530425"
        }, {"id": "2692", "name": "峨山彝族自治县", "code": "530426"}, {
            "id": "2693",
            "name": "新平彝族傣族自治县",
            "code": "530427"
        }, {"id": "2694", "name": "元江哈尼族彝族傣族自治县", "code": "530428"}]
    }, {
        "id": "344",
        "name": "保山市",
        "code": "530500",
        "area": [{"id": "2695", "name": "隆阳区", "code": "530502"}, {
            "id": "2696",
            "name": "施甸县",
            "code": "530521"
        }, {"id": "2697", "name": "腾冲县", "code": "530522"}, {
            "id": "2698",
            "name": "龙陵县",
            "code": "530523"
        }, {"id": "2699", "name": "昌宁县", "code": "530524"}]
    }, {
        "id": "345",
        "name": "昭通市",
        "code": "530600",
        "area": [{"id": "2700", "name": "昭阳区", "code": "530602"}, {
            "id": "2701",
            "name": "鲁甸县",
            "code": "530621"
        }, {"id": "2702", "name": "巧家县", "code": "530622"}, {
            "id": "2703",
            "name": "盐津县",
            "code": "530623"
        }, {"id": "2704", "name": "大关县", "code": "530624"}, {
            "id": "2705",
            "name": "永善县",
            "code": "530625"
        }, {"id": "2706", "name": "绥江县", "code": "530626"}, {
            "id": "2707",
            "name": "镇雄县",
            "code": "530627"
        }, {"id": "2708", "name": "彝良县", "code": "530628"}, {
            "id": "2709",
            "name": "威信县",
            "code": "530629"
        }, {"id": "2710", "name": "水富县", "code": "530630"}]
    }, {
        "id": "346",
        "name": "丽江市",
        "code": "530700",
        "area": [{"id": "2711", "name": "古城区纳西族自治县", "code": "530702"}, {
            "id": "2712",
            "name": "玉龙县",
            "code": "530721"
        }, {"id": "2713", "name": "永胜县", "code": "530722"}, {
            "id": "2714",
            "name": "华坪县",
            "code": "530723"
        }, {"id": "2715", "name": "宁蒗彝族自治县", "code": "530724"}]
    }, {
        "id": "347",
        "name": "普洱市",
        "code": "530800",
        "area": [{"id": "2716", "name": "思茅区", "code": "530802"}, {
            "id": "2717",
            "name": "宁洱哈尼族彝族自治县",
            "code": "530821"
        }, {"id": "2718", "name": "墨江哈尼族自治县", "code": "530822"}, {
            "id": "2719",
            "name": "景东彝族自治县",
            "code": "530823"
        }, {"id": "2720", "name": "景谷傣族彝族自治县", "code": "530824"}, {
            "id": "2721",
            "name": "镇沅彝族哈尼族拉祜族自治县",
            "code": "530825"
        }, {"id": "2722", "name": "江城哈尼族彝族自治县", "code": "530826"}, {
            "id": "2723",
            "name": "孟连傣族拉祜族佤族自治县",
            "code": "530827"
        }, {"id": "2724", "name": "澜沧拉祜族自治县", "code": "530828"}, {"id": "2725", "name": "西盟佤族自治县", "code": "530829"}]
    }, {
        "id": "348",
        "name": "临沧市",
        "code": "530900",
        "area": [{"id": "2726", "name": "临翔区", "code": "530902"}, {
            "id": "2727",
            "name": "凤庆县",
            "code": "530921"
        }, {"id": "2728", "name": "云县", "code": "530922"}, {
            "id": "2729",
            "name": "永德县",
            "code": "530923"
        }, {"id": "2730", "name": "镇康县", "code": "530924"}, {
            "id": "2731",
            "name": "双江拉祜族佤族布朗族傣族自治县",
            "code": "530925"
        }, {"id": "2732", "name": "耿马傣族佤族自治县", "code": "530926"}, {"id": "2733", "name": "沧源佤族自治县", "code": "530927"}]
    }, {
        "id": "349",
        "name": "楚雄彝族自治州",
        "code": "532300",
        "area": [{"id": "2734", "name": "楚雄市", "code": "532301"}, {
            "id": "2735",
            "name": "双柏县",
            "code": "532322"
        }, {"id": "2736", "name": "牟定县", "code": "532323"}, {
            "id": "2737",
            "name": "南华县",
            "code": "532324"
        }, {"id": "2738", "name": "姚安县", "code": "532325"}, {
            "id": "2739",
            "name": "大姚县",
            "code": "532326"
        }, {"id": "2740", "name": "永仁县", "code": "532327"}, {
            "id": "2741",
            "name": "元谋县",
            "code": "532328"
        }, {"id": "2742", "name": "武定县", "code": "532329"}, {"id": "2743", "name": "禄丰县", "code": "532331"}]
    }, {
        "id": "350",
        "name": "红河哈尼族彝族自治州",
        "code": "532500",
        "area": [{"id": "2744", "name": "个旧市", "code": "532501"}, {
            "id": "2745",
            "name": "开远市",
            "code": "532502"
        }, {"id": "2746", "name": "蒙自市", "code": "532522"}, {
            "id": "2747",
            "name": "屏边苗族自治县",
            "code": "532523"
        }, {"id": "2748", "name": "建水县", "code": "532524"}, {
            "id": "2749",
            "name": "石屏县",
            "code": "532525"
        }, {"id": "2750", "name": "弥勒县", "code": "532526"}, {
            "id": "2751",
            "name": "泸西县",
            "code": "532527"
        }, {"id": "2752", "name": "元阳县", "code": "532528"}, {
            "id": "2753",
            "name": "红河县",
            "code": "532529"
        }, {"id": "2754", "name": "金平苗族瑶族傣族自治县", "code": "532530"}, {
            "id": "2755",
            "name": "绿春县",
            "code": "532531"
        }, {"id": "2756", "name": "河口瑶族自治县", "code": "532532"}]
    }, {
        "id": "351",
        "name": "文山壮族苗族自治州",
        "code": "532600",
        "area": [{"id": "2757", "name": "文山市", "code": "532621"}, {
            "id": "2758",
            "name": "砚山县",
            "code": "532622"
        }, {"id": "2759", "name": "西畴县", "code": "532623"}, {
            "id": "2760",
            "name": "麻栗坡县",
            "code": "532624"
        }, {"id": "2761", "name": "马关县", "code": "532625"}, {
            "id": "2762",
            "name": "丘北县",
            "code": "532626"
        }, {"id": "2763", "name": "广南县", "code": "532627"}, {"id": "2764", "name": "富宁县", "code": "532628"}]
    }, {
        "id": "352",
        "name": "西双版纳自治州",
        "code": "532800",
        "area": [{"id": "2765", "name": "景洪市", "code": "532801"}, {
            "id": "2766",
            "name": "勐海县",
            "code": "532822"
        }, {"id": "2767", "name": "勐腊县", "code": "532823"}]
    }, {
        "id": "353",
        "name": "大理白族自治州",
        "code": "532900",
        "area": [{"id": "2768", "name": "大理市", "code": "532901"}, {
            "id": "2769",
            "name": "漾濞彝族自治县",
            "code": "532922"
        }, {"id": "2770", "name": "祥云县", "code": "532923"}, {
            "id": "2771",
            "name": "宾川县",
            "code": "532924"
        }, {"id": "2772", "name": "弥渡县", "code": "532925"}, {
            "id": "2773",
            "name": "南涧彝族自治县",
            "code": "532926"
        }, {"id": "2774", "name": "巍山彝族回族自治县", "code": "532927"}, {
            "id": "2775",
            "name": "永平县",
            "code": "532928"
        }, {"id": "2776", "name": "云龙县", "code": "532929"}, {
            "id": "2777",
            "name": "洱源县",
            "code": "532930"
        }, {"id": "2778", "name": "剑川县", "code": "532931"}, {"id": "2779", "name": "鹤庆县", "code": "532932"}]
    }, {
        "id": "354",
        "name": "德宏傣族景颇族自治州",
        "code": "533100",
        "area": [{"id": "2780", "name": "瑞丽市", "code": "533102"}, {
            "id": "2781",
            "name": "芒市",
            "code": "533103"
        }, {"id": "2782", "name": "梁河县", "code": "533122"}, {
            "id": "2783",
            "name": "盈江县",
            "code": "533123"
        }, {"id": "2784", "name": "陇川县", "code": "533124"}]
    }, {
        "id": "355",
        "name": "怒江傈僳族自治州",
        "code": "533300",
        "area": [{"id": "2785", "name": "泸水县", "code": "533321"}, {
            "id": "2786",
            "name": "福贡县",
            "code": "533323"
        }, {"id": "2787", "name": "贡山独龙族怒族自治县", "code": "533324"}, {
            "id": "2788",
            "name": "兰坪白族普米族自治县",
            "code": "533325"
        }]
    }, {
        "id": "356",
        "name": "迪庆藏族自治州",
        "code": "533400",
        "area": [{"id": "2789", "name": "香格里拉县", "code": "533421"}, {
            "id": "2790",
            "name": "德钦县",
            "code": "533422"
        }, {"id": "2791", "name": "维西僳僳族自治县", "code": "533423"}]
    }]
}, {
    "id": "26",
    "name": "西藏自治区",
    "code": "540000",
    "city": [{
        "id": "334",
        "name": "拉萨市",
        "code": "540100",
        "area": [{"id": "2586", "name": "城关区", "code": "540102"}, {
            "id": "2587",
            "name": "林周县",
            "code": "540121"
        }, {"id": "2588", "name": "当雄县", "code": "540122"}, {
            "id": "2589",
            "name": "尼木县",
            "code": "540123"
        }, {"id": "2590", "name": "曲水县", "code": "540124"}, {
            "id": "2591",
            "name": "堆龙德庆县",
            "code": "540125"
        }, {"id": "2592", "name": "达孜县", "code": "540126"}, {"id": "2593", "name": "墨竹工卡县", "code": "540127"}]
    }, {
        "id": "335",
        "name": "昌都地区",
        "code": "542100",
        "area": [{"id": "2594", "name": "卡若区", "code": "542121"}, {
            "id": "2595",
            "name": "昌都县",
            "code": "542121"
        }, {"id": "2596", "name": "江达县", "code": "542122"}, {
            "id": "2597",
            "name": "贡觉县",
            "code": "542123"
        }, {"id": "2598", "name": "类乌齐县", "code": "542124"}, {
            "id": "2599",
            "name": "丁青县",
            "code": "542125"
        }, {"id": "2600", "name": "察雅县", "code": "542126"}, {
            "id": "2601",
            "name": "八宿县",
            "code": "542127"
        }, {"id": "2602", "name": "左贡县", "code": "542128"}, {
            "id": "2603",
            "name": "芒康县",
            "code": "542129"
        }, {"id": "2604", "name": "洛隆县", "code": "542132"}, {"id": "2605", "name": "边坝县", "code": "542133"}]
    }, {
        "id": "336",
        "name": "山南地区",
        "code": "542200",
        "area": [{"id": "2606", "name": "乃东县", "code": "542221"}, {
            "id": "2607",
            "name": "扎囊县",
            "code": "542222"
        }, {"id": "2608", "name": "贡嘎县", "code": "542223"}, {
            "id": "2609",
            "name": "桑日县",
            "code": "542224"
        }, {"id": "2610", "name": "琼结县", "code": "542225"}, {
            "id": "2611",
            "name": "曲松县",
            "code": "542226"
        }, {"id": "2612", "name": "措美县", "code": "542227"}, {
            "id": "2613",
            "name": "洛扎县",
            "code": "542228"
        }, {"id": "2614", "name": "加查县", "code": "542229"}, {
            "id": "2615",
            "name": "隆子县",
            "code": "542231"
        }, {"id": "2616", "name": "错那县", "code": "542232"}, {"id": "2617", "name": "浪卡子县", "code": "542233"}]
    }, {
        "id": "337",
        "name": "日喀则地区",
        "code": "542300",
        "area": [{"id": "2618", "name": "桑珠孜区", "code": "542301"}, {
            "id": "2619",
            "name": "日喀则市",
            "code": "542301"
        }, {"id": "2620", "name": "南木林县", "code": "542322"}, {
            "id": "2621",
            "name": "江孜县",
            "code": "542323"
        }, {"id": "2622", "name": "定日县", "code": "542324"}, {
            "id": "2623",
            "name": "萨迦县",
            "code": "542325"
        }, {"id": "2624", "name": "拉孜县", "code": "542326"}, {
            "id": "2625",
            "name": "昂仁县",
            "code": "542327"
        }, {"id": "2626", "name": "谢通门县", "code": "542328"}, {
            "id": "2627",
            "name": "白朗县",
            "code": "542329"
        }, {"id": "2628", "name": "仁布县", "code": "542330"}, {
            "id": "2629",
            "name": "康马县",
            "code": "542331"
        }, {"id": "2630", "name": "定结县", "code": "542332"}, {
            "id": "2631",
            "name": "仲巴县",
            "code": "542333"
        }, {"id": "2632", "name": "亚东县", "code": "542334"}, {
            "id": "2633",
            "name": "吉隆县",
            "code": "542335"
        }, {"id": "2634", "name": "聂拉木县", "code": "542336"}, {
            "id": "2635",
            "name": "萨嘎县",
            "code": "542337"
        }, {"id": "2636", "name": "岗巴县", "code": "542338"}]
    }, {
        "id": "338",
        "name": "那曲地区",
        "code": "542400",
        "area": [{"id": "2637", "name": "那曲县", "code": "542421"}, {
            "id": "2638",
            "name": "嘉黎县",
            "code": "542422"
        }, {"id": "2639", "name": "比如县", "code": "542423"}, {
            "id": "2640",
            "name": "聂荣县",
            "code": "542424"
        }, {"id": "2641", "name": "安多县", "code": "542425"}, {
            "id": "2642",
            "name": "申扎县",
            "code": "542426"
        }, {"id": "2643", "name": "索县", "code": "542427"}, {
            "id": "2644",
            "name": "班戈县",
            "code": "542428"
        }, {"id": "2645", "name": "巴青县", "code": "542429"}, {"id": "2646", "name": "尼玛县", "code": "542430"}]
    }, {
        "id": "339",
        "name": "阿里地区",
        "code": "542500",
        "area": [{"id": "2647", "name": "双湖县", "code": "542432"}, {
            "id": "2648",
            "name": "普兰县",
            "code": "542521"
        }, {"id": "2649", "name": "札达县", "code": "542522"}, {
            "id": "2650",
            "name": "噶尔县",
            "code": "542523"
        }, {"id": "2651", "name": "日土县", "code": "542524"}, {
            "id": "2652",
            "name": "革吉县",
            "code": "542525"
        }, {"id": "2653", "name": "改则县", "code": "542526"}, {"id": "2654", "name": "措勤县", "code": "542527"}]
    }, {
        "id": "340",
        "name": "林芝地区",
        "code": "542600",
        "area": [{"id": "2655", "name": "巴宜区", "code": "542621"}, {
            "id": "2656",
            "name": "林芝县",
            "code": "542621"
        }, {"id": "2657", "name": "工布江达县", "code": "542622"}, {
            "id": "2658",
            "name": "米林县",
            "code": "542623"
        }, {"id": "2659", "name": "墨脱县", "code": "542624"}, {
            "id": "2660",
            "name": "波密县",
            "code": "542625"
        }, {"id": "2661", "name": "察隅县", "code": "542626"}, {"id": "2662", "name": "朗县", "code": "542627"}]
    }]
}, {
    "id": "27",
    "name": "陕西省",
    "code": "610000",
    "city": [{
        "id": "280",
        "name": "西安市",
        "code": "610100",
        "area": [{"id": "2174", "name": "新城区", "code": "610102"}, {
            "id": "2175",
            "name": "碑林区",
            "code": "610103"
        }, {"id": "2176", "name": "莲湖区", "code": "610104"}, {
            "id": "2177",
            "name": "灞桥区",
            "code": "610111"
        }, {"id": "2178", "name": "未央区", "code": "610112"}, {
            "id": "2179",
            "name": "雁塔区",
            "code": "610113"
        }, {"id": "2180", "name": "阎良区", "code": "610114"}, {
            "id": "2181",
            "name": "临潼区",
            "code": "610115"
        }, {"id": "2182", "name": "长安区", "code": "610116"}, {
            "id": "2183",
            "name": "蓝田县",
            "code": "610122"
        }, {"id": "2184", "name": "周至县", "code": "610124"}, {
            "id": "2185",
            "name": "户县",
            "code": "610125"
        }, {"id": "2186", "name": "高陵县", "code": "610126"}]
    }, {
        "id": "281",
        "name": "铜川市",
        "code": "610200",
        "area": [{"id": "2187", "name": "王益区", "code": "610202"}, {
            "id": "2188",
            "name": "印台区",
            "code": "610203"
        }, {"id": "2189", "name": "耀州区", "code": "610204"}, {"id": "2190", "name": "宜君县", "code": "610222"}]
    }, {
        "id": "282",
        "name": "宝鸡市",
        "code": "610300",
        "area": [{"id": "2191", "name": "渭滨区", "code": "610302"}, {
            "id": "2192",
            "name": "金台区",
            "code": "610303"
        }, {"id": "2193", "name": "陈仓区", "code": "610304"}, {
            "id": "2194",
            "name": "凤翔县",
            "code": "610322"
        }, {"id": "2195", "name": "岐山县", "code": "610323"}, {
            "id": "2196",
            "name": "扶风县",
            "code": "610324"
        }, {"id": "2197", "name": "眉县", "code": "610326"}, {
            "id": "2198",
            "name": "陇县",
            "code": "610327"
        }, {"id": "2199", "name": "千阳县", "code": "610328"}, {
            "id": "2200",
            "name": "麟游县",
            "code": "610329"
        }, {"id": "2201", "name": "凤县", "code": "610330"}, {"id": "2202", "name": "太白县", "code": "610331"}]
    }, {
        "id": "283",
        "name": "咸阳市",
        "code": "610400",
        "area": [{"id": "2203", "name": "秦都区", "code": "610402"}, {
            "id": "2204",
            "name": "杨陵区",
            "code": "610403"
        }, {"id": "2205", "name": "渭城区", "code": "610404"}, {
            "id": "2206",
            "name": "三原县",
            "code": "610422"
        }, {"id": "2207", "name": "泾阳县", "code": "610423"}, {
            "id": "2208",
            "name": "乾县",
            "code": "610424"
        }, {"id": "2209", "name": "礼泉县", "code": "610425"}, {
            "id": "2210",
            "name": "永寿县",
            "code": "610426"
        }, {"id": "2211", "name": "彬县", "code": "610427"}, {
            "id": "2212",
            "name": "长武县",
            "code": "610428"
        }, {"id": "2213", "name": "旬邑县", "code": "610429"}, {
            "id": "2214",
            "name": "淳化县",
            "code": "610430"
        }, {"id": "2215", "name": "武功县", "code": "610431"}, {"id": "2216", "name": "兴平市", "code": "610481"}]
    }, {
        "id": "284",
        "name": "渭南市",
        "code": "610500",
        "area": [{"id": "2217", "name": "临渭区", "code": "610502"}, {
            "id": "2218",
            "name": "华县",
            "code": "610521"
        }, {"id": "2219", "name": "潼关县", "code": "610522"}, {
            "id": "2220",
            "name": "大荔县",
            "code": "610523"
        }, {"id": "2221", "name": "合阳县", "code": "610524"}, {
            "id": "2222",
            "name": "澄城县",
            "code": "610525"
        }, {"id": "2223", "name": "蒲城县", "code": "610526"}, {
            "id": "2224",
            "name": "白水县",
            "code": "610527"
        }, {"id": "2225", "name": "富平县", "code": "610528"}, {
            "id": "2226",
            "name": "韩城市",
            "code": "610581"
        }, {"id": "2227", "name": "华阴市", "code": "610582"}]
    }, {
        "id": "285",
        "name": "延安市",
        "code": "610600",
        "area": [{"id": "2228", "name": "宝塔区", "code": "610602"}, {
            "id": "2229",
            "name": "延长县",
            "code": "610621"
        }, {"id": "2230", "name": "延川县", "code": "610622"}, {
            "id": "2231",
            "name": "子长县",
            "code": "610623"
        }, {"id": "2232", "name": "安塞县", "code": "610624"}, {
            "id": "2233",
            "name": "志丹县",
            "code": "610625"
        }, {"id": "2234", "name": "吴起县", "code": "610626"}, {
            "id": "2235",
            "name": "甘泉",
            "code": "610627"
        }, {"id": "2236", "name": "富县", "code": "610628"}, {
            "id": "2237",
            "name": "洛川县",
            "code": "610629"
        }, {"id": "2238", "name": "宜川县", "code": "610630"}, {
            "id": "2239",
            "name": "黄龙县",
            "code": "610631"
        }, {"id": "2240", "name": "黄陵县", "code": "610632"}]
    }, {
        "id": "286",
        "name": "汉中市",
        "code": "610700",
        "area": [{"id": "2241", "name": "汉台区", "code": "610702"}, {
            "id": "2242",
            "name": "南郑县",
            "code": "610721"
        }, {"id": "2243", "name": "城固县", "code": "610722"}, {
            "id": "2244",
            "name": "洋县",
            "code": "610723"
        }, {"id": "2245", "name": "西乡县", "code": "610724"}, {
            "id": "2246",
            "name": "勉县",
            "code": "610725"
        }, {"id": "2247", "name": "宁强县", "code": "610726"}, {
            "id": "2248",
            "name": "略阳县",
            "code": "610727"
        }, {"id": "2249", "name": "镇巴县", "code": "610728"}, {
            "id": "2250",
            "name": "留坝县",
            "code": "610729"
        }, {"id": "2251", "name": "佛坪县", "code": "610730"}]
    }, {
        "id": "287",
        "name": "榆林市",
        "code": "610800",
        "area": [{"id": "2252", "name": "榆阳区", "code": "610802"}, {
            "id": "2253",
            "name": "神木县",
            "code": "610821"
        }, {"id": "2254", "name": "府谷县", "code": "610822"}, {
            "id": "2255",
            "name": "横山县",
            "code": "610823"
        }, {"id": "2256", "name": "靖边县", "code": "610824"}, {
            "id": "2257",
            "name": "定边县",
            "code": "610825"
        }, {"id": "2258", "name": "绥德县", "code": "610826"}, {
            "id": "2259",
            "name": "米脂县",
            "code": "610827"
        }, {"id": "2260", "name": "佳县", "code": "610828"}, {
            "id": "2261",
            "name": "吴堡县",
            "code": "610829"
        }, {"id": "2262", "name": "清涧县", "code": "610830"}, {"id": "2263", "name": "子洲县", "code": "610831"}]
    }, {
        "id": "288",
        "name": "安康市",
        "code": "610900",
        "area": [{"id": "2264", "name": "汉滨区", "code": "610902"}, {
            "id": "2265",
            "name": "汉阴县",
            "code": "610921"
        }, {"id": "2266", "name": "石泉县", "code": "610922"}, {
            "id": "2267",
            "name": "宁陕县",
            "code": "610923"
        }, {"id": "2268", "name": "紫阳县", "code": "610924"}, {
            "id": "2269",
            "name": "岚皋县",
            "code": "610925"
        }, {"id": "2270", "name": "平利县", "code": "610926"}, {
            "id": "2271",
            "name": "镇坪县",
            "code": "610927"
        }, {"id": "2272", "name": "旬阳县", "code": "610928"}, {"id": "2273", "name": "白河县", "code": "610929"}]
    }, {
        "id": "289",
        "name": "商洛市",
        "code": "611000",
        "area": [{"id": "2274", "name": "商州区", "code": "611002"}, {
            "id": "2275",
            "name": "洛南县",
            "code": "611021"
        }, {"id": "2276", "name": "丹凤县", "code": "611022"}, {
            "id": "2277",
            "name": "商南县",
            "code": "611023"
        }, {"id": "2278", "name": "山阳县", "code": "611024"}, {
            "id": "2279",
            "name": "镇安县",
            "code": "611025"
        }, {"id": "2280", "name": "柞水县", "code": "611026"}]
    }]
}, {
    "id": "28",
    "name": "甘肃省",
    "code": "620000",
    "city": [{
        "id": "29",
        "name": "兰州市",
        "code": "620100",
        "area": [{"id": "248", "name": "城关区", "code": "620102"}, {
            "id": "249",
            "name": "七里河区",
            "code": "620103"
        }, {"id": "250", "name": "西固区", "code": "620104"}, {"id": "251", "name": "安宁区", "code": "620105"}, {
            "id": "252",
            "name": "红古区",
            "code": "620111"
        }, {"id": "253", "name": "永登县", "code": "620121"}, {"id": "254", "name": "皋兰县", "code": "620122"}, {
            "id": "255",
            "name": "榆中县",
            "code": "620123"
        }]
    }, {
        "id": "30",
        "name": "嘉峪市关市",
        "code": "620200",
        "area": [{"id": "256", "name": "嘉峪市关市", "code": "620200"}]
    }, {
        "id": "31",
        "name": "金昌市",
        "code": "620300",
        "area": [{"id": "257", "name": "金川区", "code": "620302"}, {"id": "258", "name": "永昌县", "code": "620321"}]
    }, {
        "id": "32",
        "name": "白银市",
        "code": "620400",
        "area": [{"id": "259", "name": "白银区", "code": "620402"}, {
            "id": "260",
            "name": "平川区",
            "code": "620403"
        }, {"id": "261", "name": "靖远县", "code": "620421"}, {"id": "262", "name": "会宁县", "code": "620422"}, {
            "id": "263",
            "name": "景泰县",
            "code": "620423"
        }]
    }, {
        "id": "33",
        "name": "天水市",
        "code": "620500",
        "area": [{"id": "264", "name": "秦州区", "code": "620502"}, {
            "id": "265",
            "name": "麦积区",
            "code": "620503"
        }, {"id": "266", "name": "清水县", "code": "620521"}, {"id": "267", "name": "秦安县", "code": "620522"}, {
            "id": "268",
            "name": "甘谷县",
            "code": "620523"
        }, {"id": "269", "name": "武山县", "code": "620524"}, {"id": "270", "name": "张家川回族自治县", "code": "620525"}]
    }, {
        "id": "34",
        "name": "武威市",
        "code": "620600",
        "area": [{"id": "271", "name": "凉州区", "code": "620602"}, {
            "id": "272",
            "name": "民勤县",
            "code": "620621"
        }, {"id": "273", "name": "古浪县", "code": "620622"}, {"id": "274", "name": "天祝藏族自治县", "code": "620623"}]
    }, {
        "id": "35",
        "name": "张掖市",
        "code": "620700",
        "area": [{"id": "275", "name": "甘州区", "code": "620702"}, {
            "id": "276",
            "name": "肃南裕固族自治县",
            "code": "620721"
        }, {"id": "277", "name": "民乐县", "code": "620722"}, {"id": "278", "name": "临泽县", "code": "620723"}, {
            "id": "279",
            "name": "高台县",
            "code": "620724"
        }, {"id": "280", "name": "山丹县", "code": "620725"}]
    }, {
        "id": "36",
        "name": "平凉市",
        "code": "620800",
        "area": [{"id": "281", "name": "崆峒区", "code": "620802"}, {
            "id": "282",
            "name": "泾川县",
            "code": "620821"
        }, {"id": "283", "name": "灵台县", "code": "620822"}, {"id": "284", "name": "崇信县", "code": "620823"}, {
            "id": "285",
            "name": "华亭县",
            "code": "620824"
        }, {"id": "286", "name": "庄浪县", "code": "620825"}, {"id": "287", "name": "静宁县", "code": "620826"}]
    }, {
        "id": "37",
        "name": "酒泉市",
        "code": "620900",
        "area": [{"id": "288", "name": "肃州区", "code": "620902"}, {
            "id": "289",
            "name": "金塔县",
            "code": "620921"
        }, {"id": "290", "name": "瓜州县", "code": "620922"}, {
            "id": "291",
            "name": "肃北蒙古族自治县",
            "code": "620923"
        }, {"id": "292", "name": "阿克塞哈萨克族自治县", "code": "620924"}, {
            "id": "293",
            "name": "玉门市",
            "code": "620981"
        }, {"id": "294", "name": "敦煌市", "code": "620982"}]
    }, {
        "id": "38",
        "name": "庆阳市",
        "code": "621000",
        "area": [{"id": "295", "name": "西峰区", "code": "621002"}, {
            "id": "296",
            "name": "庆城县",
            "code": "621021"
        }, {"id": "297", "name": "环县县", "code": "621022"}, {"id": "298", "name": "华池县", "code": "621023"}, {
            "id": "299",
            "name": "合水县",
            "code": "621024"
        }, {"id": "300", "name": "正宁县", "code": "621025"}, {"id": "301", "name": "宁县县", "code": "621026"}, {
            "id": "302",
            "name": "镇原县",
            "code": "621027"
        }]
    }, {
        "id": "39",
        "name": "定西市",
        "code": "621100",
        "area": [{"id": "303", "name": "安定区", "code": "621102"}, {
            "id": "304",
            "name": "通渭县",
            "code": "621121"
        }, {"id": "305", "name": "陇西县", "code": "621122"}, {"id": "306", "name": "渭源县", "code": "621123"}, {
            "id": "307",
            "name": "临洮县",
            "code": "621124"
        }, {"id": "308", "name": "漳县县", "code": "621125"}, {"id": "309", "name": "岷县县", "code": "621126"}]
    }, {
        "id": "40",
        "name": "陇南市",
        "code": "621200",
        "area": [{"id": "310", "name": "武都区", "code": "621202"}, {
            "id": "311",
            "name": "成县县",
            "code": "621221"
        }, {"id": "312", "name": "文县县", "code": "621222"}, {"id": "313", "name": "宕昌县", "code": "621223"}, {
            "id": "314",
            "name": "康县县",
            "code": "621224"
        }, {"id": "315", "name": "西和县", "code": "621225"}, {"id": "316", "name": "礼县县", "code": "621226"}, {
            "id": "317",
            "name": "徽县县",
            "code": "621227"
        }, {"id": "318", "name": "两当县", "code": "621228"}]
    }, {
        "id": "41",
        "name": "临夏市",
        "code": "622900",
        "area": [{"id": "319", "name": "临夏市", "code": "622901"}, {
            "id": "320",
            "name": "临夏县",
            "code": "622921"
        }, {"id": "321", "name": "康乐县", "code": "622922"}, {"id": "322", "name": "永靖县", "code": "622923"}, {
            "id": "323",
            "name": "广河县",
            "code": "622924"
        }, {"id": "324", "name": "和政县", "code": "622925"}, {
            "id": "325",
            "name": "东乡族自治县",
            "code": "622926"
        }, {"id": "326", "name": "积石山保安族东乡族撒拉族自治县", "code": "622927"}]
    }, {
        "id": "42",
        "name": "甘南市",
        "code": "623000",
        "area": [{"id": "327", "name": "合作市", "code": "623001"}, {
            "id": "328",
            "name": "临潭县",
            "code": "623021"
        }, {"id": "329", "name": "卓尼县", "code": "623022"}, {"id": "330", "name": "舟曲县", "code": "623023"}, {
            "id": "331",
            "name": "迭部县",
            "code": "623024"
        }, {"id": "332", "name": "玛曲县", "code": "623025"}, {"id": "333", "name": "碌曲县", "code": "623026"}, {
            "id": "334",
            "name": "夏河县",
            "code": "623027"
        }]
    }]
}, {
    "id": "29",
    "name": "青海省",
    "code": "630000",
    "city": [{
        "id": "243",
        "name": "西宁市",
        "code": "630100",
        "area": [{"id": "1854", "name": "城东区", "code": "630102"}, {
            "id": "1855",
            "name": "城中区",
            "code": "630103"
        }, {"id": "1856", "name": "城西区", "code": "630104"}, {
            "id": "1857",
            "name": "城北区",
            "code": "630105"
        }, {"id": "1858", "name": "大通回族土族自治县", "code": "630121"}, {
            "id": "1859",
            "name": "湟中县",
            "code": "630122"
        }, {"id": "1860", "name": "湟源县", "code": "630123"}]
    }, {
        "id": "244",
        "name": "海东地区",
        "code": "632100",
        "area": [{"id": "1861", "name": "平安县", "code": "632121"}, {
            "id": "1862",
            "name": "民和回族土族自治县",
            "code": "632122"
        }, {"id": "1863", "name": "乐都县", "code": "632123"}, {
            "id": "1864",
            "name": "互助土族自治县",
            "code": "632126"
        }, {"id": "1865", "name": "化隆回族自治县", "code": "632127"}, {"id": "1866", "name": "循化撒拉族自治县", "code": "632128"}]
    }, {
        "id": "245",
        "name": "海北藏族自治州",
        "code": "632200",
        "area": [{"id": "1867", "name": "门源回族自治县", "code": "632221"}, {
            "id": "1868",
            "name": "祁连县",
            "code": "632222"
        }, {"id": "1869", "name": "海晏县", "code": "632223"}, {"id": "1870", "name": "刚察县", "code": "632224"}]
    }, {
        "id": "246",
        "name": "黄南藏族自治州",
        "code": "632300",
        "area": [{"id": "1871", "name": "同仁县", "code": "632321"}, {
            "id": "1872",
            "name": "尖扎县",
            "code": "632322"
        }, {"id": "1873", "name": "泽库县", "code": "632323"}, {"id": "1874", "name": "河南蒙古族自治县", "code": "632324"}]
    }, {
        "id": "247",
        "name": "海南藏族自治州",
        "code": "632500",
        "area": [{"id": "1875", "name": "共和县", "code": "632521"}, {
            "id": "1876",
            "name": "同德县",
            "code": "632522"
        }, {"id": "1877", "name": "贵德县", "code": "632523"}, {
            "id": "1878",
            "name": "兴海县",
            "code": "632524"
        }, {"id": "1879", "name": "贵南县", "code": "632525"}]
    }, {
        "id": "248",
        "name": "果洛藏族自治州",
        "code": "632600",
        "area": [{"id": "1880", "name": "玛沁县", "code": "632621"}, {
            "id": "1881",
            "name": "班玛县",
            "code": "632622"
        }, {"id": "1882", "name": "甘德县", "code": "632623"}, {
            "id": "1883",
            "name": "达日县",
            "code": "632624"
        }, {"id": "1884", "name": "久治县", "code": "632625"}, {"id": "1885", "name": "玛多县", "code": "632626"}]
    }, {
        "id": "249",
        "name": "玉树藏族自治州",
        "code": "632700",
        "area": [{"id": "1886", "name": "玉树县", "code": "632721"}, {
            "id": "1887",
            "name": "杂多县",
            "code": "632722"
        }, {"id": "1888", "name": "称多县", "code": "632723"}, {
            "id": "1889",
            "name": "治多县",
            "code": "632724"
        }, {"id": "1890", "name": "囊谦县", "code": "632725"}, {"id": "1891", "name": "曲麻莱县", "code": "632726"}]
    }, {
        "id": "250",
        "name": "海西蒙古族藏族自治州",
        "code": "632800",
        "area": [{"id": "1892", "name": "格尔木市", "code": "632801"}, {
            "id": "1893",
            "name": "德令哈市",
            "code": "632802"
        }, {"id": "1894", "name": "乌兰县", "code": "632821"}, {
            "id": "1895",
            "name": "都兰县",
            "code": "632822"
        }, {"id": "1896", "name": "天峻县", "code": "632823"}]
    }]
}, {
    "id": "30",
    "name": "宁夏回族自治区",
    "code": "640000",
    "city": [{
        "id": "238",
        "name": "银川市",
        "code": "640100",
        "area": [{"id": "1832", "name": "兴庆区", "code": "640104"}, {
            "id": "1833",
            "name": "西夏区",
            "code": "640105"
        }, {"id": "1834", "name": "金凤区", "code": "640106"}, {
            "id": "1835",
            "name": "永宁县",
            "code": "640121"
        }, {"id": "1836", "name": "贺兰县", "code": "640122"}, {"id": "1837", "name": "灵武县", "code": "640181"}]
    }, {
        "id": "239",
        "name": "石嘴山市",
        "code": "640200",
        "area": [{"id": "1838", "name": "大武口区", "code": "640202"}, {
            "id": "1839",
            "name": "惠农区",
            "code": "640205"
        }, {"id": "1840", "name": "平罗县", "code": "640221"}]
    }, {
        "id": "240",
        "name": "吴忠市",
        "code": "640300",
        "area": [{"id": "1841", "name": "利通区", "code": "640302"}, {
            "id": "1842",
            "name": "红寺堡区",
            "code": "640303"
        }, {"id": "1843", "name": "盐池县", "code": "640323"}, {
            "id": "1844",
            "name": "同心县",
            "code": "640324"
        }, {"id": "1845", "name": "青铜峡市", "code": "640381"}]
    }, {
        "id": "241",
        "name": "固原市",
        "code": "640400",
        "area": [{"id": "1846", "name": "原州区", "code": "640402"}, {
            "id": "1847",
            "name": "西吉县",
            "code": "640422"
        }, {"id": "1848", "name": "隆德县", "code": "640423"}, {
            "id": "1849",
            "name": "泾源县",
            "code": "640424"
        }, {"id": "1850", "name": "彭阳县", "code": "640425"}]
    }, {
        "id": "242",
        "name": "中卫市",
        "code": "640500",
        "area": [{"id": "1851", "name": "沙坡头区", "code": "640502"}, {
            "id": "1852",
            "name": "中宁县",
            "code": "640521"
        }, {"id": "1853", "name": "海原县", "code": "640522"}]
    }]
}, {
    "id": "31",
    "name": "新疆维吾尔自治区",
    "code": "650000",
    "city": [{
        "id": "312",
        "name": "乌鲁木齐市",
        "code": "650100",
        "area": [{"id": "2481", "name": "天山区", "code": "650102"}, {
            "id": "2482",
            "name": "沙依巴克区",
            "code": "650103"
        }, {"id": "2483", "name": "新市区", "code": "650104"}, {
            "id": "2484",
            "name": "水磨沟区",
            "code": "650105"
        }, {"id": "2485", "name": "头屯河区", "code": "650106"}, {
            "id": "2486",
            "name": "达坂城区",
            "code": "650107"
        }, {"id": "2487", "name": "米东区", "code": "650109"}, {"id": "2488", "name": "乌鲁木齐县", "code": "650121"}]
    }, {
        "id": "313",
        "name": "克拉玛依市",
        "code": "650200",
        "area": [{"id": "2489", "name": "独山子区", "code": "650202"}, {
            "id": "2490",
            "name": "克拉玛依区",
            "code": "650203"
        }, {"id": "2491", "name": "白碱滩区", "code": "650204"}, {"id": "2492", "name": "乌尔禾区", "code": "650205"}]
    }, {
        "id": "314",
        "name": "吐鲁番地区",
        "code": "652100",
        "area": [{"id": "2493", "name": "高昌市", "code": "652101"}, {
            "id": "2494",
            "name": "鄯善县",
            "code": "652122"
        }, {"id": "2495", "name": "托克逊县", "code": "652123"}]
    }, {
        "id": "315",
        "name": "哈密地区",
        "code": "652200",
        "area": [{"id": "2496", "name": "伊州市", "code": "652201"}, {
            "id": "2497",
            "name": "巴里坤哈萨克自治县",
            "code": "652222"
        }, {"id": "2498", "name": "伊吾县", "code": "652223"}]
    }, {
        "id": "316",
        "name": "昌吉回族自治州",
        "code": "652300",
        "area": [{"id": "2499", "name": "昌吉市", "code": "652301"}, {
            "id": "2500",
            "name": "阜康市",
            "code": "652302"
        }, {"id": "2501", "name": "呼图壁县", "code": "652323"}, {
            "id": "2502",
            "name": "玛纳斯县",
            "code": "652324"
        }, {"id": "2503", "name": "奇台县", "code": "652325"}, {
            "id": "2504",
            "name": "吉木萨尔县",
            "code": "652327"
        }, {"id": "2505", "name": "木垒哈萨克自治县", "code": "652328"}]
    }, {
        "id": "317",
        "name": "博尔塔拉蒙古自治州",
        "code": "652700",
        "area": [{"id": "2506", "name": "博乐市", "code": "652701"}, {
            "id": "2507",
            "name": "阿拉山口市",
            "code": "652702"
        }, {"id": "2508", "name": "精河县", "code": "652722"}, {"id": "2509", "name": "温泉县", "code": "652723"}]
    }, {
        "id": "318",
        "name": "巴音郭楞蒙古自治州",
        "code": "652800",
        "area": [{"id": "2510", "name": "库尔勒市", "code": "652801"}, {
            "id": "2511",
            "name": "轮台县",
            "code": "652822"
        }, {"id": "2512", "name": "尉犁县", "code": "652823"}, {
            "id": "2513",
            "name": "若羌县",
            "code": "652824"
        }, {"id": "2514", "name": "且末县", "code": "652825"}, {
            "id": "2515",
            "name": "焉耆回族自治县",
            "code": "652826"
        }, {"id": "2516", "name": "和静县", "code": "652827"}, {
            "id": "2517",
            "name": "和硕县",
            "code": "652828"
        }, {"id": "2518", "name": "博湖县", "code": "652829"}]
    }, {
        "id": "319",
        "name": "阿克苏地区",
        "code": "652900",
        "area": [{"id": "2519", "name": "阿克苏市", "code": "652901"}, {
            "id": "2520",
            "name": "温宿县",
            "code": "652922"
        }, {"id": "2521", "name": "库车县", "code": "652923"}, {
            "id": "2522",
            "name": "沙雅县",
            "code": "652924"
        }, {"id": "2523", "name": "新和县", "code": "652925"}, {
            "id": "2524",
            "name": "拜城县",
            "code": "652926"
        }, {"id": "2525", "name": "乌什县", "code": "652927"}, {
            "id": "2526",
            "name": "阿瓦提县",
            "code": "652928"
        }, {"id": "2527", "name": "柯坪县", "code": "652929"}]
    }, {
        "id": "320",
        "name": "克孜勒苏柯尔克孜自治州",
        "code": "653000",
        "area": [{"id": "2528", "name": "阿图什市", "code": "653001"}, {
            "id": "2529",
            "name": "阿克陶县",
            "code": "653022"
        }, {"id": "2530", "name": "阿合奇县", "code": "653023"}, {"id": "2531", "name": "乌恰县", "code": "653024"}]
    }, {
        "id": "321",
        "name": "喀什地区",
        "code": "653100",
        "area": [{"id": "2532", "name": "喀什市", "code": "653101"}, {
            "id": "2533",
            "name": "疏附县",
            "code": "653121"
        }, {"id": "2534", "name": "疏勒县", "code": "653122"}, {
            "id": "2535",
            "name": "英吉沙县",
            "code": "653123"
        }, {"id": "2536", "name": "泽普县", "code": "653124"}, {
            "id": "2537",
            "name": "莎车县",
            "code": "653125"
        }, {"id": "2538", "name": "叶城县", "code": "653126"}, {
            "id": "2539",
            "name": "麦盖提县",
            "code": "653127"
        }, {"id": "2540", "name": "岳普湖县", "code": "653128"}, {
            "id": "2541",
            "name": "伽师县",
            "code": "653129"
        }, {"id": "2542", "name": "巴楚县", "code": "653130"}, {"id": "2543", "name": "塔什库尔干塔吉克自治县", "code": "653131"}]
    }, {
        "id": "322",
        "name": "和田地区",
        "code": "653200",
        "area": [{"id": "2544", "name": "和田市", "code": "653201"}, {
            "id": "2545",
            "name": "和田县",
            "code": "653221"
        }, {"id": "2546", "name": "墨玉县", "code": "653222"}, {
            "id": "2547",
            "name": "皮山县",
            "code": "653223"
        }, {"id": "2548", "name": "洛浦县", "code": "653224"}, {
            "id": "2549",
            "name": "策勒县",
            "code": "653225"
        }, {"id": "2550", "name": "于田县", "code": "653226"}, {"id": "2551", "name": "民丰县", "code": "653227"}]
    }, {
        "id": "323",
        "name": "伊犁哈萨克自治州",
        "code": "654000",
        "area": [{"id": "2552", "name": "伊宁市", "code": "654002"}, {
            "id": "2553",
            "name": "奎屯市",
            "code": "654003"
        }, {"id": "2554", "name": "霍尔果斯市", "code": "654004"}, {
            "id": "2555",
            "name": "伊宁县",
            "code": "654021"
        }, {"id": "2556", "name": "察布查尔锡自治县", "code": "654022"}, {
            "id": "2557",
            "name": "霍城县",
            "code": "654023"
        }, {"id": "2558", "name": "巩留县", "code": "654024"}, {
            "id": "2559",
            "name": "新源县",
            "code": "654025"
        }, {"id": "2560", "name": "昭苏县", "code": "654026"}, {
            "id": "2561",
            "name": "特克斯县",
            "code": "654027"
        }, {"id": "2562", "name": "尼勒克县", "code": "654028"}]
    }, {
        "id": "324",
        "name": "塔城地区",
        "code": "654200",
        "area": [{"id": "2563", "name": "塔城市", "code": "654201"}, {
            "id": "2564",
            "name": "乌苏市",
            "code": "654202"
        }, {"id": "2565", "name": "额敏县", "code": "654221"}, {
            "id": "2566",
            "name": "沙湾县",
            "code": "654223"
        }, {"id": "2567", "name": "托里县", "code": "654224"}, {
            "id": "2568",
            "name": "裕民县",
            "code": "654225"
        }, {"id": "2569", "name": "和布克赛尔蒙古自治县", "code": "654226"}]
    }, {
        "id": "325",
        "name": "阿勒泰地区",
        "code": "654300",
        "area": [{"id": "2570", "name": "阿勒泰市", "code": "654301"}, {
            "id": "2571",
            "name": "布尔津县",
            "code": "654321"
        }, {"id": "2572", "name": "富蕴县", "code": "654322"}, {
            "id": "2573",
            "name": "福海县",
            "code": "654323"
        }, {"id": "2574", "name": "哈巴河县", "code": "654324"}, {
            "id": "2575",
            "name": "青河县",
            "code": "654325"
        }, {"id": "2576", "name": "吉木乃县", "code": "654326"}]
    }, {
        "id": "326",
        "name": "可克达拉市",
        "code": "659000",
        "area": [{"id": "2577", "name": "双河市", "code": "659007"}, {"id": "2578", "name": "可克达拉市", "code": "659008"}]
    }, {
        "id": "327",
        "name": "石河子市",
        "code": "659001",
        "area": [{"id": "2579", "name": "石河子", "code": "659001"}]
    }, {
        "id": "328",
        "name": "阿拉尔市",
        "code": "659002",
        "area": [{"id": "2580", "name": "阿拉尔", "code": "659002"}]
    }, {
        "id": "329",
        "name": "图木舒克市",
        "code": "659003",
        "area": [{"id": "2581", "name": "图木舒克", "code": "659003"}]
    }, {
        "id": "330",
        "name": "五家渠市",
        "code": "659004",
        "area": [{"id": "2582", "name": "五家渠", "code": "659004"}]
    }, {
        "id": "331",
        "name": "北屯市",
        "code": "659005",
        "area": [{"id": "2583", "name": "北屯", "code": "659005"}]
    }, {
        "id": "332",
        "name": "铁门关市",
        "code": "659006",
        "area": [{"id": "2584", "name": "铁门关", "code": "659006"}]
    }, {"id": "333", "name": "昆玉市", "code": "659009", "area": [{"id": "2585", "name": "昆玉", "code": "659009"}]}]
}, {
    "id": "32",
    "name": "台湾省",
    "code": "710000",
    "city": [{
        "id": "368",
        "name": "连江县",
        "code": "712800",
        "area": [{"id": "2886", "name": "北竿乡", "code": "712806"}, {
            "id": "2887",
            "name": "东引乡",
            "code": "712808"
        }, {"id": "2888", "name": "莒光乡", "code": "712807"}, {"id": "2889", "name": "南竿乡", "code": "712805"}]
    }, {
        "id": "369",
        "name": "高雄市",
        "code": "710200",
        "area": [{"id": "2890", "name": "阿莲区", "code": "710246"}, {
            "id": "2891",
            "name": "大寮区",
            "code": "710255"
        }, {"id": "2892", "name": "大社区", "code": "710243"}, {
            "id": "2893",
            "name": "大树区",
            "code": "710258"
        }, {"id": "2894", "name": "凤山区", "code": "710254"}, {
            "id": "2895",
            "name": "冈山区",
            "code": "710244"
        }, {"id": "2896", "name": "湖内区", "code": "710253"}, {
            "id": "2897",
            "name": "甲仙区",
            "code": "710264"
        }, {"id": "2898", "name": "苓雅区", "code": "710241"}, {
            "id": "2899",
            "name": "林园区",
            "code": "710256"
        }, {"id": "2900", "name": "六龟区", "code": "710261"}, {
            "id": "2901",
            "name": "路竹区",
            "code": "710245"
        }, {"id": "2902", "name": "茂林区", "code": "710267"}, {
            "id": "2903",
            "name": "美浓区",
            "code": "710260"
        }, {"id": "2904", "name": "弥陀区", "code": "710251"}, {
            "id": "2905",
            "name": "那玛夏区",
            "code": "710266"
        }, {"id": "2906", "name": "内门区", "code": "710262"}, {
            "id": "2907",
            "name": "鸟松区",
            "code": "710257"
        }, {"id": "2908", "name": "桥头区", "code": "710249"}, {
            "id": "2909",
            "name": "茄萣区",
            "code": "710268"
        }, {"id": "2910", "name": "旗山区", "code": "710259"}, {
            "id": "2911",
            "name": "仁武区",
            "code": "710242"
        }, {"id": "2912", "name": "杉林区", "code": "710263"}, {
            "id": "2913",
            "name": "桃源区",
            "code": "710265"
        }, {"id": "2914", "name": "田寮区", "code": "710247"}, {
            "id": "2915",
            "name": "燕巢区",
            "code": "710248"
        }, {"id": "2916", "name": "永安区", "code": "710252"}, {
            "id": "2917",
            "name": "梓官区",
            "code": "710250"
        }, {"id": "2918", "name": "鼓山区", "code": "710205"}, {
            "id": "2919",
            "name": "楠梓区",
            "code": "710210"
        }, {"id": "2920", "name": "前金区", "code": "710202"}, {
            "id": "2921",
            "name": "前镇区",
            "code": "710207"
        }, {"id": "2922", "name": "旗津区", "code": "710206"}, {
            "id": "2923",
            "name": "芩雅区",
            "code": "710203"
        }, {"id": "2924", "name": "三民区", "code": "710208"}, {
            "id": "2925",
            "name": "小港区",
            "code": "710211"
        }, {"id": "2926", "name": "新兴区", "code": "710201"}, {
            "id": "2927",
            "name": "盐埕区",
            "code": "710204"
        }, {"id": "2928", "name": "左营区", "code": "710209"}]
    }, {
        "id": "370",
        "name": "花莲县",
        "code": "712600",
        "area": [{"id": "2929", "name": "丰滨乡", "code": "712623"}, {
            "id": "2930",
            "name": "凤林镇",
            "code": "712621"
        }, {"id": "2931", "name": "富里乡", "code": "712628"}, {
            "id": "2932",
            "name": "光复乡",
            "code": "712622"
        }, {"id": "2933", "name": "花莲市", "code": "712615"}, {
            "id": "2934",
            "name": "卓溪乡",
            "code": "712627"
        }, {"id": "2935", "name": "吉安乡", "code": "712619"}, {
            "id": "2936",
            "name": "瑞穗乡",
            "code": "712624"
        }, {"id": "2937", "name": "寿丰乡", "code": "712620"}, {
            "id": "2938",
            "name": "新城乡",
            "code": "712616"
        }, {"id": "2939", "name": "秀林乡", "code": "712618"}, {
            "id": "2940",
            "name": "太鲁阁",
            "code": "712617"
        }, {"id": "2941", "name": "万荣乡", "code": "712625"}, {"id": "2942", "name": "玉里镇", "code": "712626"}]
    }, {
        "id": "371",
        "name": "嘉义市",
        "code": "710900",
        "area": [{"id": "2943", "name": "东区", "code": "710901"}, {"id": "2944", "name": "西区", "code": "710902"}]
    }, {
        "id": "372",
        "name": "嘉义县",
        "code": "711900",
        "area": [{"id": "2945", "name": "阿里山乡", "code": "711922"}, {
            "id": "2946",
            "name": "鹿草乡",
            "code": "711926"
        }, {"id": "2947", "name": "布袋镇", "code": "711936"}, {
            "id": "2948",
            "name": "大林镇",
            "code": "711933"
        }, {"id": "2949", "name": "大埔乡", "code": "711924"}, {
            "id": "2950",
            "name": "东石乡",
            "code": "711929"
        }, {"id": "2951", "name": "番路乡", "code": "711919"}, {
            "id": "2952",
            "name": "中埔乡",
            "code": "711923"
        }, {"id": "2953", "name": "竹崎乡", "code": "711921"}, {
            "id": "2954",
            "name": "六脚乡",
            "code": "711930"
        }, {"id": "2955", "name": "梅山乡", "code": "711920"}, {
            "id": "2956",
            "name": "民雄乡",
            "code": "711932"
        }, {"id": "2957", "name": "朴子市", "code": "711928"}, {
            "id": "2958",
            "name": "水上乡",
            "code": "711925"
        }, {"id": "2959", "name": "溪口乡", "code": "711934"}, {
            "id": "2960",
            "name": "新港乡",
            "code": "711931"
        }, {"id": "2961", "name": "太保市", "code": "711927"}, {"id": "2962", "name": "义竹乡", "code": "711935"}]
    }, {
        "id": "373",
        "name": "基隆市",
        "code": "710700",
        "area": [{"id": "2963", "name": "安乐区", "code": "710705"}, {
            "id": "2964",
            "name": "暖暖区",
            "code": "710706"
        }, {"id": "2965", "name": "七堵区", "code": "710707"}, {
            "id": "2966",
            "name": "仁爱区",
            "code": "710701"
        }, {"id": "2967", "name": "信义区", "code": "710702"}, {
            "id": "2968",
            "name": "中山区",
            "code": "710704"
        }, {"id": "2969", "name": "中正区", "code": "710703"}]
    }, {
        "id": "374",
        "name": "金门县",
        "code": "710500",
        "area": [{"id": "2970", "name": "金城镇", "code": "710510"}, {
            "id": "2971",
            "name": "金湖镇",
            "code": "710508"
        }, {"id": "2972", "name": "金宁乡", "code": "710509"}, {
            "id": "2973",
            "name": "金沙镇",
            "code": "710507"
        }, {"id": "2974", "name": "烈屿乡", "code": "710511"}, {"id": "2975", "name": "乌坵乡", "code": "710512"}]
    }, {
        "id": "375",
        "name": "苗栗县",
        "code": "711500",
        "area": [{"id": "2976", "name": "大湖乡", "code": "711531"}, {
            "id": "2977",
            "name": "公馆乡",
            "code": "711530"
        }, {"id": "2978", "name": "后龙镇", "code": "711524"}, {
            "id": "2979",
            "name": "竹南镇",
            "code": "711519"
        }, {"id": "2980", "name": "卓兰镇", "code": "711536"}, {
            "id": "2981",
            "name": "苗栗市",
            "code": "711527"
        }, {"id": "2982", "name": "南庄乡", "code": "711522"}, {
            "id": "2983",
            "name": "三湾乡",
            "code": "711521"
        }, {"id": "2984", "name": "三义乡", "code": "711534"}, {
            "id": "2985",
            "name": "狮潭乡",
            "code": "711523"
        }, {"id": "2986", "name": "西湖乡", "code": "711535"}, {
            "id": "2987",
            "name": "泰安乡",
            "code": "711532"
        }, {"id": "2988", "name": "铜锣乡", "code": "711533"}, {
            "id": "2989",
            "name": "通霄乡",
            "code": "711525"
        }, {"id": "2990", "name": "头份镇", "code": "711520"}, {
            "id": "2991",
            "name": "头屋乡",
            "code": "711529"
        }, {"id": "2992", "name": "苑里镇", "code": "711526"}, {"id": "2993", "name": "造桥乡", "code": "711528"}]
    }, {
        "id": "376",
        "name": "南投县",
        "code": "710600",
        "area": [{"id": "2994", "name": "草屯镇", "code": "710616"}, {
            "id": "2995",
            "name": "国姓乡",
            "code": "710617"
        }, {"id": "2996", "name": "中寮乡", "code": "710615"}, {
            "id": "2997",
            "name": "竹山镇",
            "code": "710625"
        }, {"id": "2998", "name": "集集镇", "code": "710621"}, {
            "id": "2999",
            "name": "鹿谷乡",
            "code": "710626"
        }, {"id": "3000", "name": "名间乡", "code": "710620"}, {
            "id": "3001",
            "name": "南投市",
            "code": "710614"
        }, {"id": "3002", "name": "埔里镇", "code": "710618"}, {
            "id": "3003",
            "name": "仁爱乡",
            "code": "710619"
        }, {"id": "3004", "name": "水里乡", "code": "710622"}, {
            "id": "3005",
            "name": "信义乡",
            "code": "710624"
        }, {"id": "3006", "name": "鱼池乡", "code": "710623"}]
    }, {
        "id": "377",
        "name": "澎湖县",
        "code": "712700",
        "area": [{"id": "3007", "name": "白沙乡", "code": "712711"}, {
            "id": "3008",
            "name": "七美乡",
            "code": "712710"
        }, {"id": "3009", "name": "湖西乡", "code": "712712"}, {
            "id": "3010",
            "name": "马公乡",
            "code": "712707"
        }, {"id": "3011", "name": "西屿乡", "code": "712708"}, {"id": "3012", "name": "望安乡", "code": "712709"}]
    }, {
        "id": "378",
        "name": "屏东县",
        "code": "712400",
        "area": [{"id": "3013", "name": "长治乡", "code": "712442"}, {
            "id": "3014",
            "name": "潮州镇",
            "code": "712447"
        }, {"id": "3015", "name": "车城乡", "code": "712463"}, {
            "id": "3016",
            "name": "春日乡",
            "code": "712461"
        }, {"id": "3017", "name": "东港镇", "code": "712455"}, {
            "id": "3018",
            "name": "枋寮乡",
            "code": "712459"
        }, {"id": "3019", "name": "枋山乡", "code": "712460"}, {
            "id": "3020",
            "name": "高树乡",
            "code": "712440"
        }, {"id": "3021", "name": "恒春镇", "code": "712465"}, {
            "id": "3022",
            "name": "竹田乡",
            "code": "712444"
        }, {"id": "3023", "name": "佳冬乡", "code": "712457"}, {
            "id": "3024",
            "name": "九如乡",
            "code": "712438"
        }, {"id": "3025", "name": "崁顶乡", "code": "712451"}, {
            "id": "3026",
            "name": "来义乡",
            "code": "712449"
        }, {"id": "3027", "name": "里港乡", "code": "712439"}, {
            "id": "3028",
            "name": "林边乡",
            "code": "712454"
        }, {"id": "3029", "name": "麟洛乡", "code": "712443"}, {
            "id": "3030",
            "name": "琉球乡",
            "code": "712456"
        }, {"id": "3031", "name": "玛家乡", "code": "712437"}, {
            "id": "3032",
            "name": "满州乡",
            "code": "712466"
        }, {"id": "3033", "name": "牡丹乡", "code": "712464"}, {
            "id": "3034",
            "name": "南州乡",
            "code": "712453"
        }, {"id": "3035", "name": "内埔乡", "code": "712445"}, {
            "id": "3036",
            "name": "屏东市",
            "code": "712434"
        }, {"id": "3037", "name": "三地门乡", "code": "712435"}, {
            "id": "3038",
            "name": "狮子乡",
            "code": "712462"
        }, {"id": "3039", "name": "新埤乡", "code": "712452"}, {
            "id": "3040",
            "name": "新园乡",
            "code": "712458"
        }, {"id": "3041", "name": "泰武乡", "code": "712448"}, {
            "id": "3042",
            "name": "万丹乡",
            "code": "712446"
        }, {"id": "3043", "name": "万峦乡", "code": "712450"}, {
            "id": "3044",
            "name": "雾台乡",
            "code": "712436"
        }, {"id": "3045", "name": "盐埔乡", "code": "712441"}]
    }, {
        "id": "379",
        "name": "台北市",
        "code": "710100",
        "area": [{"id": "3046", "name": "北投区", "code": "710109"}, {
            "id": "3047",
            "name": "大安区",
            "code": "710105"
        }, {"id": "3048", "name": "大同区", "code": "710102"}, {
            "id": "3049",
            "name": "南港区",
            "code": "710111"
        }, {"id": "3050", "name": "内湖区", "code": "710110"}, {
            "id": "3051",
            "name": "信义区",
            "code": "710107"
        }, {"id": "3052", "name": "士林区", "code": "710108"}, {
            "id": "3053",
            "name": "松山区",
            "code": "710104"
        }, {"id": "3054", "name": "万华区", "code": "710106"}, {
            "id": "3055",
            "name": "文山区",
            "code": "710112"
        }, {"id": "3056", "name": "中山区", "code": "710103"}, {"id": "3057", "name": "中正区", "code": "710101"}]
    }, {
        "id": "380",
        "name": "台东市",
        "code": "712500",
        "area": [{"id": "3058", "name": "卑南乡", "code": "712521"}, {
            "id": "3059",
            "name": "长滨乡",
            "code": "712528"
        }, {"id": "3060", "name": "成功镇", "code": "712527"}, {
            "id": "3061",
            "name": "池上乡",
            "code": "712525"
        }, {"id": "3062", "name": "达仁乡", "code": "712531"}, {
            "id": "3063",
            "name": "大武乡",
            "code": "712530"
        }, {"id": "3064", "name": "东河乡", "code": "712526"}, {
            "id": "3065",
            "name": "关山镇",
            "code": "712523"
        }, {"id": "3066", "name": "海端乡", "code": "712524"}, {
            "id": "3067",
            "name": "金峰乡",
            "code": "712529"
        }, {"id": "3068", "name": "兰屿乡", "code": "712519"}, {
            "id": "3069",
            "name": "鹿野乡",
            "code": "712522"
        }, {"id": "3070", "name": "绿岛乡", "code": "712518"}, {
            "id": "3071",
            "name": "台东市",
            "code": "712517"
        }, {"id": "3072", "name": "太麻里乡", "code": "712532"}, {"id": "3073", "name": "延平乡", "code": "712520"}]
    }, {
        "id": "381",
        "name": "台南市",
        "code": "710300",
        "area": [{"id": "3074", "name": "安定乡", "code": "710369"}, {
            "id": "3075",
            "name": "白河镇",
            "code": "710359"
        }, {"id": "3076", "name": "北门乡", "code": "710356"}, {
            "id": "3077",
            "name": "大内乡",
            "code": "710366"
        }, {"id": "3078", "name": "东山乡", "code": "710360"}, {
            "id": "3079",
            "name": "关庙乡",
            "code": "710347"
        }, {"id": "3080", "name": "官田乡", "code": "710349"}, {
            "id": "3081",
            "name": "归仁乡",
            "code": "710340"
        }, {"id": "3082", "name": "后壁乡", "code": "710358"}, {
            "id": "3083",
            "name": "佳里镇",
            "code": "710351"
        }, {"id": "3084", "name": "将军乡", "code": "710354"}, {
            "id": "3085",
            "name": "六甲乡",
            "code": "710361"
        }, {"id": "3086", "name": "柳营乡", "code": "710363"}, {
            "id": "3087",
            "name": "龙崎乡",
            "code": "710348"
        }, {"id": "3088", "name": "麻豆镇", "code": "710350"}, {
            "id": "3089",
            "name": "南化乡",
            "code": "710345"
        }, {"id": "3090", "name": "楠西乡", "code": "710344"}, {
            "id": "3091",
            "name": "七股乡",
            "code": "710353"
        }, {"id": "3092", "name": "仁德乡", "code": "710346"}, {
            "id": "3093",
            "name": "善化镇",
            "code": "710365"
        }, {"id": "3094", "name": "山上乡", "code": "710367"}, {
            "id": "3095",
            "name": "下营乡",
            "code": "710362"
        }, {"id": "3096", "name": "西港乡", "code": "710352"}, {
            "id": "3097",
            "name": "新化镇",
            "code": "710341"
        }, {"id": "3098", "name": "新市乡", "code": "710368"}, {
            "id": "3099",
            "name": "新营市",
            "code": "710357"
        }, {"id": "3100", "name": "学甲镇", "code": "710355"}, {
            "id": "3101",
            "name": "盐水镇",
            "code": "710364"
        }, {"id": "3102", "name": "永康市", "code": "710339"}, {
            "id": "3103",
            "name": "玉井乡",
            "code": "710343"
        }, {"id": "3104", "name": "左镇乡", "code": "710342"}, {
            "id": "3105",
            "name": "安南区",
            "code": "710306"
        }, {"id": "3106", "name": "安平区", "code": "710305"}, {
            "id": "3107",
            "name": "北区",
            "code": "710304"
        }, {"id": "3108", "name": "东区", "code": "710302"}, {
            "id": "3109",
            "name": "南区",
            "code": "710303"
        }, {"id": "3110", "name": "中西区", "code": "710301"}]
    }, {
        "id": "382",
        "name": "台中市",
        "code": "710400",
        "area": [{"id": "3111", "name": "大安乡", "code": "710451"}, {
            "id": "3112",
            "name": "大肚乡",
            "code": "710444"
        }, {"id": "3113", "name": "大甲镇", "code": "710449"}, {
            "id": "3114",
            "name": "大里乡",
            "code": "710432"
        }, {"id": "3115", "name": "大雅乡", "code": "710442"}, {
            "id": "3116",
            "name": "东势镇",
            "code": "710438"
        }, {"id": "3117", "name": "丰原市", "code": "710435"}, {
            "id": "3118",
            "name": "和平乡",
            "code": "710439"
        }, {"id": "3119", "name": "后里乡", "code": "710436"}, {
            "id": "3120",
            "name": "龙井乡",
            "code": "710446"
        }, {"id": "3121", "name": "清水镇", "code": "710448"}, {
            "id": "3122",
            "name": "沙鹿镇",
            "code": "710445"
        }, {"id": "3123", "name": "神冈乡", "code": "710443"}, {
            "id": "3124",
            "name": "石冈乡",
            "code": "710437"
        }, {"id": "3125", "name": "太平市", "code": "710431"}, {
            "id": "3126",
            "name": "潭子乡",
            "code": "710441"
        }, {"id": "3127", "name": "外埔乡", "code": "710450"}, {
            "id": "3128",
            "name": "雾峰乡",
            "code": "710433"
        }, {"id": "3129", "name": "梧栖镇", "code": "710447"}, {
            "id": "3130",
            "name": "乌日乡",
            "code": "710434"
        }, {"id": "3131", "name": "新社乡", "code": "710440"}, {
            "id": "3132",
            "name": "北区",
            "code": "710405"
        }, {"id": "3133", "name": "北屯区", "code": "710406"}, {
            "id": "3134",
            "name": "东区",
            "code": "710402"
        }, {"id": "3135", "name": "南区", "code": "710403"}, {
            "id": "3136",
            "name": "南屯区",
            "code": "710408"
        }, {"id": "3137", "name": "西区", "code": "710404"}, {
            "id": "3138",
            "name": "西屯区",
            "code": "710407"
        }, {"id": "3139", "name": "中区", "code": "710401"}]
    }, {
        "id": "383",
        "name": "桃园县",
        "code": "711400",
        "area": [{"id": "3140", "name": "八德市", "code": "711422"}, {
            "id": "3141",
            "name": "大溪镇",
            "code": "711423"
        }, {"id": "3142", "name": "大园乡", "code": "711425"}, {
            "id": "3143",
            "name": "复兴乡",
            "code": "711424"
        }, {"id": "3144", "name": "观音乡", "code": "711419"}, {
            "id": "3145",
            "name": "龟山乡",
            "code": "711421"
        }, {"id": "3146", "name": "中坜市", "code": "711414"}, {
            "id": "3147",
            "name": "龙潭乡",
            "code": "711416"
        }, {"id": "3148", "name": "芦竹乡", "code": "711426"}, {
            "id": "3149",
            "name": "平镇市",
            "code": "711415"
        }, {"id": "3150", "name": "新屋乡", "code": "711418"}, {
            "id": "3151",
            "name": "桃园市",
            "code": "711420"
        }, {"id": "3152", "name": "杨梅镇", "code": "711417"}]
    }, {
        "id": "384",
        "name": "新北市",
        "code": "711100",
        "area": [{"id": "3153", "name": "八里区", "code": "711155"}, {
            "id": "3154",
            "name": "板桥区",
            "code": "711132"
        }, {"id": "3155", "name": "淡水区", "code": "711156"}, {
            "id": "3156",
            "name": "贡寮区",
            "code": "711139"
        }, {"id": "3157", "name": "中和区", "code": "711144"}, {
            "id": "3158",
            "name": "金山区",
            "code": "711131"
        }, {"id": "3159", "name": "林口区", "code": "711152"}, {
            "id": "3160",
            "name": "芦洲区",
            "code": "711153"
        }, {"id": "3161", "name": "坪林区", "code": "711141"}, {
            "id": "3162",
            "name": "平溪区",
            "code": "711137"
        }, {"id": "3163", "name": "瑞芳区", "code": "711136"}, {
            "id": "3164",
            "name": "三重区",
            "code": "711149"
        }, {"id": "3165", "name": "三芝区", "code": "711157"}, {
            "id": "3166",
            "name": "三峡区",
            "code": "711146"
        }, {"id": "3167", "name": "深坑区", "code": "711134"}, {
            "id": "3168",
            "name": "石碇区",
            "code": "711135"
        }, {"id": "3169", "name": "石门区", "code": "711158"}, {
            "id": "3170",
            "name": "双溪区",
            "code": "711138"
        }, {"id": "3171", "name": "树林区", "code": "711147"}, {
            "id": "3172",
            "name": "汐止区",
            "code": "711133"
        }, {"id": "3173", "name": "新店区", "code": "711140"}, {
            "id": "3174",
            "name": "新庄区",
            "code": "711150"
        }, {"id": "3175", "name": "泰山区", "code": "711151"}, {
            "id": "3176",
            "name": "土城区",
            "code": "711145"
        }, {"id": "3177", "name": "万里区", "code": "711130"}, {
            "id": "3178",
            "name": "五股区",
            "code": "711154"
        }, {"id": "3179", "name": "乌来区", "code": "711142"}, {
            "id": "3180",
            "name": "莺歌区",
            "code": "711148"
        }, {"id": "3181", "name": "永和区", "code": "711143"}]
    }, {
        "id": "385",
        "name": "新竹市",
        "code": "710800",
        "area": [{"id": "3182", "name": "北区", "code": "710802"}, {
            "id": "3183",
            "name": "东区",
            "code": "710801"
        }, {"id": "3184", "name": "香山区", "code": "710803"}]
    }, {
        "id": "386",
        "name": "新竹县",
        "code": "711300",
        "area": [{"id": "3185", "name": "宝山乡", "code": "711320"}, {
            "id": "3186",
            "name": "北埔乡",
            "code": "711325"
        }, {"id": "3187", "name": "芎林乡", "code": "711319"}, {
            "id": "3188",
            "name": "峨眉乡",
            "code": "711326"
        }, {"id": "3189", "name": "关西镇", "code": "711318"}, {
            "id": "3190",
            "name": "横山乡",
            "code": "711323"
        }, {"id": "3191", "name": "湖口乡", "code": "711315"}, {
            "id": "3192",
            "name": "竹北市",
            "code": "711314"
        }, {"id": "3193", "name": "竹东镇", "code": "711321"}, {
            "id": "3194",
            "name": "尖石乡",
            "code": "711324"
        }, {"id": "3195", "name": "新丰乡", "code": "711316"}, {
            "id": "3196",
            "name": "新埔镇",
            "code": "711317"
        }, {"id": "3197", "name": "五峰乡", "code": "711322"}]
    }, {
        "id": "387",
        "name": "宜兰县",
        "code": "711200",
        "area": [{"id": "3198", "name": "大同乡", "code": "711221"}, {
            "id": "3199",
            "name": "冬山乡",
            "code": "711223"
        }, {"id": "3200", "name": "壮围乡", "code": "711217"}, {
            "id": "3201",
            "name": "礁溪乡",
            "code": "711216"
        }, {"id": "3202", "name": "罗东镇", "code": "711219"}, {
            "id": "3203",
            "name": "南澳乡",
            "code": "711225"
        }, {"id": "3204", "name": "三星乡", "code": "711220"}, {
            "id": "3205",
            "name": "苏澳镇",
            "code": "711224"
        }, {"id": "3206", "name": "头城镇", "code": "711215"}, {
            "id": "3207",
            "name": "五结乡",
            "code": "711222"
        }, {"id": "3208", "name": "宜兰市", "code": "711214"}, {
            "id": "3209",
            "name": "员山乡",
            "code": "711218"
        }, {"id": "3210", "name": "钓鱼台", "code": "711226"}]
    }, {
        "id": "388",
        "name": "云林县",
        "code": "712100",
        "area": [{"id": "3211", "name": "褒忠乡", "code": "712125"}, {
            "id": "3212",
            "name": "北港镇",
            "code": "712136"
        }, {"id": "3213", "name": "莿桐乡", "code": "712133"}, {
            "id": "3214",
            "name": "大埤乡",
            "code": "712122"
        }, {"id": "3215", "name": "东势乡", "code": "712126"}, {
            "id": "3216",
            "name": "斗六市",
            "code": "712130"
        }, {"id": "3217", "name": "斗南镇", "code": "712121"}, {
            "id": "3218",
            "name": "二仑乡",
            "code": "712135"
        }, {"id": "3219", "name": "古坑乡", "code": "712132"}, {
            "id": "3220",
            "name": "虎尾镇",
            "code": "712123"
        }, {"id": "3221", "name": "口湖乡", "code": "712138"}, {
            "id": "3222",
            "name": "林内乡",
            "code": "712131"
        }, {"id": "3223", "name": "仑背乡", "code": "712128"}, {
            "id": "3224",
            "name": "麦寮乡",
            "code": "712129"
        }, {"id": "3225", "name": "水林乡", "code": "712137"}, {
            "id": "3226",
            "name": "四湖乡",
            "code": "712139"
        }, {"id": "3227", "name": "西螺镇", "code": "712134"}, {
            "id": "3228",
            "name": "台西乡",
            "code": "712127"
        }, {"id": "3229", "name": "土库镇", "code": "712124"}, {"id": "3230", "name": "元长乡", "code": "712140"}]
    }, {
        "id": "389",
        "name": "彰化县",
        "code": "711700",
        "area": [{"id": "3231", "name": "北斗镇", "code": "711744"}, {
            "id": "3232",
            "name": "大城乡",
            "code": "711750"
        }, {"id": "3233", "name": "大村乡", "code": "711741"}, {
            "id": "3234",
            "name": "二林镇",
            "code": "711749"
        }, {"id": "3235", "name": "二水乡", "code": "711752"}, {
            "id": "3236",
            "name": "芳苑乡",
            "code": "711751"
        }, {"id": "3237", "name": "芬园乡", "code": "711728"}, {
            "id": "3238",
            "name": "福兴乡",
            "code": "711732"
        }, {"id": "3239", "name": "和美镇", "code": "711734"}, {
            "id": "3240",
            "name": "花坛乡",
            "code": "711729"
        }, {"id": "3241", "name": "彰化市", "code": "711727"}, {
            "id": "3242",
            "name": "竹塘乡",
            "code": "711748"
        }, {"id": "3243", "name": "鹿港镇", "code": "711731"}, {
            "id": "3244",
            "name": "埤头乡",
            "code": "711746"
        }, {"id": "3245", "name": "埔心乡", "code": "711739"}, {
            "id": "3246",
            "name": "埔盐乡",
            "code": "711742"
        }, {"id": "3247", "name": "伸港乡", "code": "711735"}, {
            "id": "3248",
            "name": "社头乡",
            "code": "711737"
        }, {"id": "3249", "name": "线西乡", "code": "711733"}, {
            "id": "3250",
            "name": "溪湖镇",
            "code": "711740"
        }, {"id": "3251", "name": "溪州乡", "code": "711747"}, {
            "id": "3252",
            "name": "秀水乡",
            "code": "711730"
        }, {"id": "3253", "name": "田中镇", "code": "711743"}, {
            "id": "3254",
            "name": "田尾乡",
            "code": "711745"
        }, {"id": "3255", "name": "永靖乡", "code": "711738"}, {"id": "3256", "name": "员林镇", "code": "711736"}]
    }]
}, {
    "id": "33",
    "name": "澳门特别行政区",
    "code": "820000",
    "city": [{
        "id": "390",
        "name": "澳门半岛",
        "code": "820100",
        "area": [{"id": "3257", "name": "澳门半岛", "code": "820100"}]
    }, {"id": "391", "name": "离岛", "code": "820200", "area": [{"id": "3258", "name": "离岛", "code": "820200"}]}]
}, {
    "id": "34",
    "name": "香港特别行政区",
    "code": "810000",
    "city": [{
        "id": "392",
        "name": "九龙城区",
        "code": "810200",
        "area": [{"id": "3259", "name": "观塘区", "code": "810205"}, {
            "id": "3260",
            "name": "黄大仙区",
            "code": "810204"
        }, {"id": "3261", "name": "九龙城区", "code": "810201"}, {
            "id": "3262",
            "name": "深水埗区",
            "code": "810203"
        }, {"id": "3263", "name": "油尖旺区", "code": "810202"}]
    }, {
        "id": "393",
        "name": "香港岛",
        "code": "810100",
        "area": [{"id": "3264", "name": "东区", "code": "810103"}, {
            "id": "3265",
            "name": "南区",
            "code": "810104"
        }, {"id": "3266", "name": "湾仔", "code": "810102"}, {"id": "3267", "name": "中西区", "code": "810101"}]
    }, {
        "id": "394",
        "name": "新界",
        "code": "810300",
        "area": [{"id": "3268", "name": "北区区", "code": "810301"}, {
            "id": "3269",
            "name": "大埔区",
            "code": "810302"
        }, {"id": "3270", "name": "葵青区", "code": "810308"}, {
            "id": "3271",
            "name": "离岛区",
            "code": "810309"
        }, {"id": "3272", "name": "荃湾区", "code": "810307"}, {
            "id": "3273",
            "name": "沙田区",
            "code": "810303"
        }, {"id": "3274", "name": "屯门区", "code": "810306"}, {
            "id": "3275",
            "name": "西贡区",
            "code": "810304"
        }, {"id": "3276", "name": "元朗区", "code": "810305"}]
    }]
}];
export default cityData;